{
  "appId": "1500",
  "count": 20,
  "notes": [
    {
      "title": "Darwinia 2.3.3-45 hotfix",
      "date": "2024-04-12 07:15:13",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6474562312184492737",
      "content": "This update contains a major bugfix for the 2.3.3 release.\n\nMajor changes:\n\n Fixed broken music playback.\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. This is caused by the \"Direct-to-Display\" feature in Metal, which cannot be opted out of. We have implemented a partial workaround to this problem, but there is still occasional render stuttering. Players can work around this by running the game in Windowed mode, or by running an application that keeps a hidden always-on-top window running (such as Notchmeister). We have an open bug with Apple about this problem and will continue to look for a better solution. \n Windows: Some applications (e.g. ReShade, Bandicam, Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are simply installed but not running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Older graphics drivers may be less reliable and cause crashes. Please update your drivers from your card/chipset vendor's website."
    },
    {
      "title": "Darwinia 2.3.3-40 hotfix",
      "date": "2024-04-09 06:47:22",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5756237364325985317",
      "content": "This update contains significant fixes and enhancements since the 2.3.3 release.\n\nMajor changes:\n\n Fixed crashes on macOS versions older than 14.0.\n Fixed a crash when closing certain level editor and options windows.\n Fixed some prediction bugs causing incorrect rendering of lasers and other weapons.\n Fixed calculation of spirits-per-minute on the Receiver map, and reduced spirits-per-minute goal to 50.\n Fixed a possible crash when generating the language table.\n Enable missing SDL feature required for Playstation DualSense controller support.\n\n\nMinor changes:\n\n Fixed incorrect scaling when using borderless fullscreen and a non-default resolution.\n Fixed an unnecessary render pass break when \"full\" pixel effect is enabled.\n Updated game controller database.\n Updated contributing libraries.\n\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. This is caused by the \"Direct-to-Display\" feature in Metal, which cannot be opted out of. We have implemented a partial workaround to this problem, but there is still occasional render stuttering. Players can work around this by running the game in Windowed mode, or by running an application that keeps a hidden always-on-top window running (such as Notchmeister). We have an open bug with Apple about this problem and will continue to look for a better solution. \n Windows: Some applications (e.g. ReShade, Bandicam, Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are simply installed but not running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Older graphics drivers may be less reliable and cause crashes. Please update your drivers from your card/chipset vendor's website."
    },
    {
      "title": "Darwinia 2.3.3 release",
      "date": "2024-03-06 02:51:32",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5679673637647702029",
      "content": "This update contains significant fixes and enhancements since the 2.3.2 release.\n\nMajor changes:\n\n The Vulkan renderer now requires a minimum of Vulkan 1.1. If your driver does not support Vulkan 1.1, it will try to use other renderers available on your platform.\n Fixed a crash on NVIDIA GPUs when running on recent graphics driver versions. NVIDIA's driver is one of the few to actually implement VK_SWAPCHAIN_CREATE_DEFERRED_MEMORY_ALLOCATION_BIT_EXT, and it interferes with older Vulkan layers (Steam overlay, MangoHUD) that were not designed with that behavior in mind.\n Fixed a crash when handling unexpected keyboard inputs.\n Fixed a very long-standing bug (probably since the original Darwinia release!) around world time handling. In a simplified explanation, the world expects to update at 100Hz, but it was actually updating at 90Hz. This caused numerous graphical glitches and strange behavior such as rubber-banding effects.\n Fixed crash when loading shape files with incorrect triangle counts (e.g. from mods).\n AntHills are now more dangerous. They were incorrectly not updating their objectives, so ants would repeatedly go back and forth between the same locations instead of changing targets to attack or pick up spirits.\n Implemented support for SMAA S2x (MSAA 2x + SMAA).\n Save games for mods are now stored in mod-specific subdirectories. This prevents accidentally loading a save game which does not match the loaded mod. Additionally, it is now possible to have multiple user profiles on a per-mod basis. Unfortunately, existing mod save folders must be moved to the new location by hand. For example, if your mod save game is currently named \"users/ModName\", you should move it to \"modusers/ModName/ModName\".\n Numerous performance and memory usage improvements across the board.\n\nMinor changes:\n\n Game controller detection was not behaving properly, causing the game controller help tips interface to flicker frequently.\n Fixed a minor UI glitch on the Steam Deck in the \"Reset Location\" dialog.\n Reduced Virii entity memory usage by half.\n Flag icons are now much higher resolution.\n Improved startup time on Windows by disabling some SDL features we didn't need.\n Shape explosions now preserve entity velocity.\n Updated contributing libraries.\n\nCompatibility:\n\n Improved compatibility of the ANGLE Direct3D 11 renderer with older graphics chipsets that support less than FL11_1.\n Now supports Mesa's GL-on-12 and Dozen (Vulkan on D3D12) renderers, if installed.\n Improved handling of DXVK for ANGLE D3D11.\n Fixed wildly incorrect rendering on the Haswell-based 2014 Intel Mac Mini.\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. This is caused by the \"Direct-to-Display\" feature in Metal, which cannot be opted out of. We have implemented a partial workaround to this problem, but there is still occasional render stuttering. Players can work around this by running the game in Windowed mode, or by running an application that keeps a hidden always-on-top window running (such as Notchmeister). We have an open bug with Apple about this problem and will continue to look for a better solution. \n Windows: Some applications (e.g. ReShade, Bandicam, Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are simply installed but not running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Older graphics drivers may be less reliable and cause crashes. Please update your drivers from your card/chipset vendor's website."
    },
    {
      "title": "Darwinia 2.3.2 release",
      "date": "2023-08-27 16:47:10",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5141475722339189376",
      "content": "This update contains fixes and enhancements since the 2.3.1 release.\n\nMajor changes:\n\n Added a native OpenGL ES rendering backend.\n Fixed a crash triggered by entering/leaving levels several times.\n Fixed a bug where radar dishes would forget how to rotate if the renderer was restarted (e.g. if the Screen settings were changed while in a level).\n Fixed a bug where cutscenes did not correctly preserve the world state, and could cause some buildings to change team ownership. (e.g. on Temple, the Spam cubes could be assigned the wrong team and be attacked by the red Darwinians)\n Now supports a new NVIDIA driver feature, the DXGI present path for Vulkan/OpenGL. Should greatly improve frame smoothness and eliminate stutters.\n Reduced stutter caused by one-off long frames.\n Reworked some of the water avoidance behavior. There were some bugs in how the water avoidance decisions were made, which caused Darwinians to sometimes become confused and just stand still after leaving water.\n When Darwinians or Squads are in water, instead of dying immediately after 10 consecutive seconds, they start to take damage over time.\n Fixed a bug where Darwinians would clip through the landscape when coming out of water, and then suddenly pop up above ground after several seconds.\n Fixed the floating-on-water animation to update every frame instead of every game tick.\n Worked around a bug in NVIDIA drivers older than 530, which caused some rendering glitches with VK_EXT_graphics_pipeline_library.\n Fixed some cases where AMD FSR 1.0 shaders would not compile correctly when targeting AMD GPUs.\n\nMinor changes:\n\n Introduced timed expiration for cached pipelines and shaders.\n Fixed a failure to initialize OpenGL core renderer on Zink.\n Fixed a bug in the mouse cursor render using 16-bit float RGBA framebuffers.\n Fixed targeting reticles being shown for units behind the camera.\n Minimized clipping of game cursor below the landscape.\n Fixed input handling bugs when running at very low framerates.\n Many code cleanups to modernize the code base a bit.\n Tuned thread priorities for audio and worker threads.\n Improved performance of MiniAudio mixing.\n Several minor performance improvements.\n Updated contributing libraries (MoltenVK, ANGLE, SDL, MiniAudio, etc)\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. This is caused by the \"Direct-to-Display\" feature in Metal, which cannot be opted out of. We have implemented a partial workaround to this problem, but there is still occasional render stuttering. Players can work around this by running the game in Windowed mode. We have an open bug with Apple about this problem and will continue to look for a better solution. You can work around this by running an application that keeps a hidden always-on-top window running (such as the gag app Notchmeister).\n Windows: Some applications (e.g. ReShade, Bandicam, Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are installed but not actually running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Windows: You may experience crashes on Intel graphics drivers with the Vulkan renderer. The cause of these crashes isn't known yet.\n Windows: There is a bug in the AMD graphics drivers that causes the Vulkan extension VK_EXT_full_screen_exclusive to be enabled in \"application controlled\" mode when not requested. This causes unexpected Vulkan error codes to be reported when alt-tabbing out of full screen mode. AMD fixed this issue in driver version 23.5.2."
    },
    {
      "title": "Darwinia 2.3.1 release",
      "date": "2022-12-02 01:56:53",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4979322040019407823",
      "content": "This update contains fixes and enhancements since the 2.3.0-25 release.\n\nMajor changes:\n\n Armour will now try to avoid collisions with buildings, and will not allow deploying gun turrets too close to other buildings.\n Gun turrets were incorrectly accounting for Darwinians, which caused only two of the four ports to be required to operate them.\n Some mods do not specify any lights in their level files, which causes the landscape and shapes to render as empty black space. We now specify a default lighting configuration if no lights are defined in the level file. This should make such levels at least playable, but they may not appear as the mod developer intended.\n Greatly improved game controller experience, now using much different thumbstick and trigger axis scaling methods. This was tested with an Xbox Elite controller, but it should improve the experience on any controller, including the Steam Deck.\n Mods with custom shapes, textures, and sounds should no longer require restarting the game to load correctly.\n Improved sound spatialization accuracy while the camera is moving, and improved sound playback performance.\n Partially worked around stuttering on macOS with high refresh rate displays. It's recommended to use the \"Automatic\" Resolution setting in Screen preferences for this workaround to take effect. Some stuttering may still be observed, see the \"Known Issues\" section below for details.\n Fixed major lighting render bugs on the Metal renderer.\n Many Screen preferences can now be applied without a full renderer restart.\n\nMinor changes:\n\n The in-game screenshot functionality performance has been improved.\n Reduced GPU memory for shape vertex data.\n Dramatically improved performance of \"Full\" Pixel Effect render for grenade/rocket explosions.\n Reduced the sort of jerky animation appearance for falling snow and Receiver spirits.\n Fixed glitched tree render and sounds when Christmas mode is enabled.\n Made falling snow fade out gradually when close to the ground.\n Fixed a localization bug in the intro cutscene for the Escort map.\n Fixed a bug where players could accidentally select units while trying to aim a radar dish or turret.\n Triffid eggs now respect SpawnPopulationLocks if present.\n Fixed some significant first-frame latency in the loader intros.\n Fixed shader pre-compilation missing some shader combinations.\n Fixed a bug with the level editor UI, which caused the increase/decrease buttons to operate on a delay instead of responding instantly and then *repeating* on a delay.\n Fixed several level editor render bugs when switching tool modes.\n Fixed some cases where Virii death animations would glitch in a strange way, especially if killed by rocket or grenade shockwaves.\n Fixed water occluding enemies that traveled out below water level (e.g. spiders or virii).\n Fixed solar panels glitching on rotate in the level editor (they're not supposed to be able to rotate).\n Fixed a bug with radar dish rotation, where rotating laterally in one direction was always faster than rotating in the other.\n Fixed some Darwinian shadow rendering behavior.\n Fixed some minor glitches in the gun turret render, causing them to appear to twitch when idle.\n User profile names can no longer be completely blank and crash the game.\n The sound system now avoids doing resampling when possible, conserving CPU utilization.\n Several level editor bugs around StaticShape buildings have been fixed.\n Shape hit tests were incorrectly accounting for scaling, causing mouse clicks to incorrectly miss some shapes in the level editor.\n Improved shader compilation speed, and improved caching robustness.\n Improved Vulkan frame pacing mechanism, to ensure lower latency rendering.\n Updated contributing libraries (MoltenVK, ANGLE, SDL, MiniAudio, etc)\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. This is caused by the \"Direct-to-Display\" feature in Metal, which cannot be opted out of. We have implemented a partial workaround to this problem, but there is still occasional render stuttering. Players can work around this by running the game in Windowed mode. We have an open bug with Apple about this problem and will continue to look for a better solution.\n Windows: Some applications (e.g. Bandicam, Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are installed but not actually running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Windows: You may experience crashes on Intel graphics drivers with the Vulkan renderer. The cause of these crashes isn't known yet.\n Windows: The Vulkan renderer may appear to stutter when running in windowed mode on NVIDIA graphics cards. NVIDIA is investigating this problem.\n Windows: There is a bug in the AMD graphics drivers that causes the Vulkan extension VK_EXT_full_screen_exclusive to be enabled in \"application controlled\" mode when not requested. This causes unexpected Vulkan error codes to be reported when alt-tabbing out of full screen mode. AMD is aware of the issue and is working on a fix.\n Windows: The Direct3D 11 shader compiler will sometimes fail with \"integer overflow\" errors which will cause the game to crash and exit during shader precompilation. Re-running the game won't reproduce the errors."
    },
    {
      "title": "Darwinia 2.3.0-25 hotfix release",
      "date": "2022-11-13 08:22:40",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6368680725431992090",
      "content": "This update contains some urgent fixes for bugs introduced in the 2.3.0 release.\n\nMajor changes:\n\n FIxed a heap corruption bug that was causing numerous other difficult-to-analyze failures.\n Fixed a crash caused by changing input bindings.\n Windows: Fixed a possible crash in the sound system when changing the output device in Windows sound settings.\n\nMinor changes:\n\n Fixed some gesture input rendering bugs, and increased the visual resolution of drawn gestures.\n Fixed a jarring camera jump when leaving the Gestures task manager view.\n Fixed the initial Officer vertical spawn position to always be at the landscape level.\n Fixed the behavior for the \"Chat Log\" input binding.\n Fixed the behavior of the \"Restore Defaults\" button in the input binding settings window.\n Improved texture quality of mouse cursors and landscape wireframe.\n Updated contributing libraries (SDL, MiniAudio, etc).\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. I have not found a programmatic workaround to this problem, as it relates to the \"Direct-to-Display\" feature in Metal which cannot be opted out of. Players can work around this by running the game in Windowed mode, or by using a fixed <= 60Hz refresh rate in the system's Display preferences. We have an open bug with Apple about this problem and will continue to look for a better solution.\n Windows: Some applications (e.g. Bandicam, Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are installed but not actually running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Windows: You may experience crashes on Intel graphics drivers. The cause of these crashes isn't known yet.\n Windows: The Vulkan renderer may appear to stutter when running in windowed mode on NVIDIA graphics cards. NVIDIA is investigating this problem.\n Windows: There is a bug in the AMD graphics drivers that causes the Vulkan extension VK_EXT_full_screen_exclusive to be enabled in \"application controlled\" mode when not requested. This causes unexpected Vulkan error codes to be reported when alt-tabbing out of full screen mode. There is a workaround in this release to deal with the driver bug, but it is strongly recommended that users upgrade to AMD graphics driver version 22.10.3 or later, which has the fix for this issue."
    },
    {
      "title": "Darwinia 2.3.0 release",
      "date": "2022-11-12 16:55:54",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6368680725429647867",
      "content": "There have been several changes since the previous release, v2.2.0-296.\n\nMajor changes:\n\n Vulkan/Metal: Multi-sampling Antialiasing (MSAA) performance is dramatically improved on some systems. When supported, we now use Multisampled Render To Texture (MSRTT) instead of a render followed by an explicit blit to resolve. This benefits tile-based rendering GPUs especially (e.g. Apple M1/M2, etc), since Vulkan and Metal can both use very fast temporary “memoryless” textures for the multisampled color and depth buffers.\n Vulkan/Metal: Apple GPUs can now use lossless compression for textures and framebuffers, which dramatically reduces memory bandwidth and improves performance.\n Vulkan: AMD GPUs can now use lossless compression for textures and framebuffers (DCC, or “Delta Color Compression”), which improves performance.\n Vulkan/Metal/Direct3D: On systems with multiple distinct GPUs (e.g. laptops with integrated graphics + discrete GPU, or with external GPUs), you can now select which device you want to render on in the Screen preferences.\n Vulkan/Metal: Fixed some awful-looking incorrect shading results around the edges of primitives affected by lighting. There seems to be either a shader compiler or hardware bug causing this, but we have worked around the problem by setting a [[sample_mask]] output in the Metal shader (even when multisampling is off). Unfortunately, this same bug is still present in Apple's built-in OpenGL-on-Metal implementation, and a workaround is impossible there since we have no influence on the generated Metal Shading Language code. It's strongly recommended to only use the Vulkan/Metal renderers on macOS.\n OpenGL: Fixed a bug where glTexStorage* calls were incorrectly being used on OpenGL 3.3-compatible systems which did not have the GL_ARB_texture_storage extension.\n Direct3D: Enabled support for DirectComposition, to allow using the D3D \"Flip\" model.\n SMAA/FXAA: Fix sampler bugs on some systems, which resulted in a completely black screen when either of these antialiasing methods were enabled.\n Sound: Fixed some significant channel mapping bugs if using fewer channels than the device supports (e.g. 2-channel on 7.1-channel hardware)\n Renderer: Shaders are now pre-compiled on startup, which should eliminate a lot of random frame hitches.\n Renderer: Textures are now pre-loaded on startup, which may eliminate frame hitches when previously unused textures are required.\n Renderer: Implemented caching for shader binaries and render pipelines.\n Renderer: Worked around a long-standing Windows AMD Vulkan graphics driver bug that caused the game to crash whenever alt-tabbing out of full screen mode.\n Renderer: Borderless Fullscreen mode now respects the resolution preference, and scales the image to fit the desktop resolution.\n Renderer: Reduced memory usage for several textures that internally require only one or two color channels.\n Windows: The FPS overlay (Shift+F5) in the top left now can display system and GPU memory utilized by the game.\n Windows: Fixes for filesystem unicode path handling on Windows versions older than Windows 10 build 17134. \n macOS: Improved performance on Apple Silicon.\n Windows: Improved audio latency.\n Camera: Fixed some FOV bugs with cutscenes.\n Camera: Fixed some movement bugs when skipping cutscenes.\n Darwinian: FIxed some bugs with Darwinians not detecting nearby enemies quickly enough.\n Darwinian: Now will recognize certain building types as enemies and flee from them.\n Spiders: Made spiders look less ridiculous when landing after a jump.\n Gun Turret: Now will recognize certain building types as enemies and attack them.\n Fixed broken savegame behavior for Launchpad (the Prologue game map).\n Modified automatic UI scaling to better handle ultrawide aspect ratios (e.g. 21:9).\n Fixed another bug where Spiders might stetch in weird ways to attempt to attack Air Strike units.\n Greatly improved performance of the sphere world's \"Internet\" render.\n Sound system performance is much better and more consistent.\n Updated game controller database.\n Updated contributing libraries (MoltenVK, ANGLE, SDL, etc).\n\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. I have not found a programmatic workaround to this problem, as it relates to the \"Direct-to-Display\" feature in Metal which cannot be opted out of. Players can work around this by running the game in Windowed mode, or by using a fixed <= 60Hz refresh rate in the system's Display preferences. We have an open bug with Apple about this problem and will continue to look for a better solution.\n Windows: Some applications (e.g. Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are installed but not actually running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Windows: You may experience crashes on Intel graphics drivers. The cause of these crashes isn't known yet.\n Windows: The Vulkan renderer may appear to stutter when running in windowed mode on NVIDIA graphics cards. NVIDIA is investigating this problem.\n Windows: There is a bug in the AMD graphics drivers that causes the Vulkan extension VK_EXT_full_screen_exclusive to be enabled in \"application controlled\" mode when not requested. This causes unexpected Vulkan error codes to be reported when alt-tabbing out of full screen mode. There is a workaround in this release to deal with the driver bug, but it is strongly recommended that users upgrade to AMD graphics driver version 22.10.3 or later, which has the fix for this issue."
    },
    {
      "title": "Darwinia 2.2.0-296 hotfix release",
      "date": "2022-06-08 17:18:09",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4480532526715332342",
      "content": "Changes since 2.2.0-292:\n\n\n macOS: Fix landscape render on Vulkan (MoltenVK) backend.\n Removed some unused and buggy features in the shader preprocessing code.\n Updated ANGLE and MoltenVK."
    },
    {
      "title": "Darwinia 2.2.0-292 bugfix release",
      "date": "2022-06-07 00:52:57",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4469272893509520433",
      "content": "Changes since 2.2.0-169:\n\n\n Vulkan: when vsync is disabled, Darwinia will use the \"mailbox\" present mode if available. This presentation mode does not block on vsync but also does not have tearing. You will very likely want to enable the FPS limit option to keep CPU/GPU utilization reasonable.\n Vulkan: improved frame latency\n macOS: improved color profile on Metal/Vulkan renderers, to match the macOS-default OpenGL Core color profile\n Map editor: fixed a crash in the landscape editor when cloning a land tile\n Virii: increased follow distance limit\n Camera: fix incorrect FOV during cutscenes\n Re-enable persistent mapped buffers for better performance. Previously this was disabled because of rendering glitches where the wrong meshes were rendered for some objects. I think I've ironed these problems out and it should now work better.\n Fixed some miscellaneous rare crashes\n Darwinia now automatically prefers using discrete GPUs on systems with both integrated and discrete graphics (e.g. Optimus).\n Multiple memory layout and performance optimizations\n ANGLE, SDL, and other contributing libraries updated. There have been numerous improvements in ANGLE since the last release build which may contribute to improved performance."
    },
    {
      "title": "Darwinia 2.2.0-169 bugfix release",
      "date": "2022-05-03 07:48:39",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4348798430292493560",
      "content": "Changes since 2.2.0-138:\n\n Armour units will now prioritize movement orders over collision avoidance\n Armour units will no longer sometimes fly into orbit when reaching their destination\n Spider animation fixes\n Fixed a possible level editor crash when editing the landscape\n Fixed an incompatibility with systems using a Colemak keyboard layout\n Implemented a new Field of View option in Graphics settings\n Implemented a new FPS Limit option in Screen settings, to allow running with vsync disabled and a capped framerate\n Implemented a new Variable Rate Shading option in Graphics settings. This feature is experimental and is disabled by default. It requires the Vulkan renderer and driver support for VK_KHR_fragment_shading_rate with support for pipeline fragment shading rate control. This feature can improve performance for rendering meshes that don't need precise per-pixel shading.\n Updated ANGLE and other contributing libraries"
    },
    {
      "title": "Darwinia 2.2.0-138 bugfix release",
      "date": "2022-04-25 15:28:38",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4348797798090881079",
      "content": "Game fixes:\n\n Armour collision is now more reasonable, and armour units should now follow orders immediately even when doing collision avoidance.\n Failure to resume audio after alt-tabbing back into the game is no longer fatal. When this occurs, the sound system will attempt to restart instead.\n The gesture input render now looks as intended (more blocky)\n User profile names are checked at creation time for valid characters and known reserved file names (e.g. Windows does not allow file or folder names to be \"con\", \"aux\", \"com0\", etc.)\n\n\nLevel editor fixes:\n\n Input fields referring to unsigned bytes (e.g. RGB color values in the level editor) are now clamped properly\n Linking buildings that are not meant to be linked could cause crashes. Several of these have been found and fixed.\n Cloned trees were not being rendered correctly due to incorrect visibility calculations. This may also fix other buildings that relied on recalculating render details after having their position assigned.\n The landscape guide grid window could crash the game in some circumstances."
    },
    {
      "title": "Darwinia 2.2.0-107 hotfix",
      "date": "2022-04-20 22:28:33",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4348797798073732496",
      "content": "A bunch of level editor fixes in this one.\n\nFixed bugs:\n\n Leaving the level editor with the \"flatten area\" window open could crash the game\n Moving a landscape flatten area in the level editor would not automatically regenerate the landscape mesh\n If no lights were defined for a level (e.g. unfinished maps in mods or similar) the game could crash on entering the level\n The circle around SafeArea buildings was not rendering correctly in the level editor."
    },
    {
      "title": "Darwinia 2.2.0-100 hotfix",
      "date": "2022-04-20 17:27:10",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4348797798072970394",
      "content": "Changes:\n\n Static vertex buffer uploads now work without fallbacks, even on Vulkan devices with weird heap layouts. Huge thanks to the ANGLE developers for finding a solution. A user on the forums tested it and it solved the problem on their machine."
    },
    {
      "title": "Darwinia 2.2.0-97 hotfix",
      "date": "2022-04-20 12:58:14",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4348797798072290188",
      "content": "Fix for buffer upload failures in ANGLE with GL_STATIC_DRAW on Vulkan devices with unusual heap layouts\n Fix for OpenGL shader compilation on older GPU drivers which don't understand precision qualifiers for anything other than float/int types\n Update SDL game controller database\n Minor localization fixes"
    },
    {
      "title": "Darwinia 2.2.0-83 hotfix",
      "date": "2022-04-19 21:44:41",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4348797798069979394",
      "content": "Changes:\n\n Fix crash caused by unusual Vulkan memory heap layouts on some devices. ANGLE was requiring memory types that have both the DEVICE_LOCAL and HOST_VISIBLE flags, but some uncommon devices only have very small heaps with those properties. This caused the Vulkan renderer to exhaust the small heap and fail to upload any buffers after that point.\n Fix possible crash when entering a location"
    },
    {
      "title": "Darwinia 2.2.0-77 hotfix",
      "date": "2022-04-19 13:37:49",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5493837466498125627",
      "content": "Changes:\n\n Fix possible hangs in the Vulkan renderer on the Windows NVIDIA driver\n Update ANGLE version"
    },
    {
      "title": "Darwinia 2.2.0-75 hotfix",
      "date": "2022-04-19 11:59:05",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5493837466497877797",
      "content": "Changes:\n\n Fix an incompatibility with some Intel graphics drivers causing shader compile failures on the OpenGL Core renderer\n Fix for crash when a user profile has an all-numeric name\n Fix for draw buffer state handling bug\n\n\nKnown issues:\n\n On Windows systems using AMD graphics with the Vulkan renderer, the game may crash on alt-tab or video mode changes. This is because the AMD graphics driver enables the VK_EXT_full_screen_exclusive extension implicitly, and ANGLE doesn't know how to handle it. This can be worked around by either using Fullscreen Borderless in Screen options, or by using a different Renderer backend (OpenGL Core, Direct3D 11)."
    },
    {
      "title": "Darwinia 2.2.0-69 hotfix",
      "date": "2022-04-18 22:22:27",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5493837466495828340",
      "content": "Fix issue where ZX Spectrum loader freezes the renderer\n Fix a possible crash loading certain mods or save games\n Possible fix for glitching pixel effect shapes\n Minor tonemapping changes"
    },
    {
      "title": "Darwinia 2.2.0-64 hotfix",
      "date": "2022-04-18 18:34:54",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5493837466495257308",
      "content": "Fixed several bugs caused by running the game on Windows in a non-English locale.\n\nNote that save games from previous builds may have been corrupted by the locale encoding issues. If you are having trouble with your save game not loading, you may need to create a new user profile in-game.\n\nTo do this, from the main menu:\n\n Click \"Profile\"\n Click \"Create New Profile\"\n Click the \"Name\" field and give your profile a name\n Click \"Create\"\n Close the menus"
    },
    {
      "title": "Darwinia 10000th Anniversary Edition",
      "date": "2022-04-18 07:55:30",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5493837466493652565",
      "content": "Fully re-mastered in 2022 to celebrate the Darwinian's 10000 anniversary this updated version brings an undisputed indie classic bang up to date.  Running seamlessly on all modern systems, the game hasn't aged a day and is a fresh and relevant now as it was when it first dropped.  Winning 3 out of 5 prizes at the IGF including the Seamous McNally Grand prize for Best Independent Video Game and multiple editors' choice awards, now is the time to play one of the most critically acclaimed indie games of all time.\n\nGraphics\n\nThe entire graphics engine has been rewritten from scratch for compatibility with modern graphics APIs and better performance. Darwinia is currently compatible with systems with support for OpenGL 3.3 core, Direct3D 11, Metal, or Vulkan. Support for non-OpenGL graphics APIs is made possible by ANGLE.\n\nOther high-level changes include:\n\n- All the in-game UI now scales more appropriately with the size and DPI of the monitor it's running on\n- Support for anti-aliasing modes including MSAA, SSAA, SMAA, and FXAA\n- Support for AMD FidelityFX Super Resolution 1.0 (FSR)\n- Support for anisotropic texture filtering\n- Higher fidelity colors and tonemapping\n\nSound\n\nThe sound engine now supports up to 7.1-channel surround sound and uses 3D spatialization (i.e. directional audio and doppler effect), using MiniAudio. The sound engine supports any of the backends that MiniAudio does, including but not limited to WASAPI (Windows), PulseAudio (Linux), and CoreAudio (macOS).\n\nCompatibility\n\nDarwinia now requires hardware and drivers that support a minimum of at least one of these graphics APIs:\n\n- OpenGL 3.3\n- Vulkan 1.1\n- Direct3D 11\n- Metal\n\nOn Intel and AMD CPUs, the minimum instruction set requirement has been raised to SSE4.2, for higher performance 3D graphics math (matrices and vectors). \n\nApple Silicon Support on macOS\nmacOS builds now have support for both Intel and Apple Silicon.\n\n\nSteam integration\n\nThe Steam release has a few minor features integrated for a better experience on the Steam platform, including:\n\n - Cloud saves and Dynamic Cloud Sync support\n - On-screen keyboard support (e.g. on devices using game controllers in Big Picture mode, or the Steam Deck)\n - Tuned default settings for better Steam Deck support\n\nPerformance\n\nOutside of architecture-specific changes, numerous performance improvements have been made throughout the entire game engine. One nice side effect of the heavy emphasis on performance is that Darwinia now requires far less energy to run, increasing battery life and playtime on laptops and other portable devices like the Steam Deck.\n\nBugfixes\n\nThere have been many bugfixes on numerous axes, including scripting, level editing, input handling, graphics, sound, stability, and game AI."
    }
  ]
}