{
  "appId": "2280",
  "count": 13,
  "notes": [
    {
      "title": "DOOM + DOOM II Update 3 Release Notes",
      "date": "2025-04-10 11:51:55",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1796631172249612",
      "content": "Update as of 4/29: Sigil II music pitch has been corrected. Thanks to everybody who reached out!\nSIGIL II\n[hr][/hr]\n\n SIGIL II is now officially included as part of the DOOM + DOOM II package. It is available from the game select menu at startup. Note: Save games from the Mods version are not compatible with the officially included version. However, the existing Mods version will remain online to users subscribed to it.\n\n[hr][/hr]\nImprovements\n\n When viewing a match running a mod, you will now be directed to the Mods page if you do not have the mod\n\n[hr][/hr]\nFixes\n\n Fixed a crash that could occur when using the automap\n Fixed sound issues with ceiling sounds on DOOM II MAP04 and TNT MAP04\n Fixed a crash when playing BTSX Episode 2 in multiplayer\n Fixed a crash that may occur when downloading or deleting many mods during the same launch\n Custom menu logos appear at the top of the menu again when playing a mod\n\nMod Compatibility Fixes\n\n Fixed a crash that occurred when a WAD contains a zero length sound\n Fixed fast doors making double sounds for mods running in Boom or MBF modes\n\n[hr][/hr]\nRead the above release notes in additional languages on Slayers Club here."
    },
    {
      "title": "DOOM + DOOM II Update 2 Release Notes",
      "date": "2025-01-28 12:45:22",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1789580505474824",
      "content": "Edit: For Steam Deck users a hotfix has been applied, so make sure you have the latest version installed before launching and thank you for the quick feedback and providing crashlogs!\n[hr][/hr]\nUpdate 2 adds Multiplayer Mod support for DOOM + DOOM II and game improvements/fixes!\n\nImprovements\n[hr][/hr]\nMultiplayer Mods\n\n Hosts need to activate the mod before entering the multiplayer menu \n Players will need to subscribe to the same mod before joining a match \n We recommend using room codes to join modified matches \n Mods must be authored with Vanilla DOOM, DeHackEd, MBF21 or BOOM to be compatible\n \nGeneral\n\n Resolved an issue in which some red doors did not display as red on the automap \n Fixed multiple crashes reported by the community when loading game saves\n Improved text line wrapping legibility for mod descriptions in Asian languages \n Removed map prefix from intermission screen to be consistent with original game behavior \n\nMultiplayer\n\n Added spectator mode when players are dead and waiting to respawn in co-op mission play (it can also be initiated manually from the scoreboard button) \n Fixed an issue in which disabling the crosshair would also turn off player name and co-op respawn text display \n There are now more than 4 player colors available in game and on scoreboards \n Resolved an issue in which players would lose weapons when respawning in co-op using modern rules \n Fixed an issue in which the cross-platform friends menu could not be properly backed out of when no friends were available \n Further optimized multiplayer networking code \n Addressed crosshair centering issue in certain splitscreen configurations \n Intermission animations now run at the correct speed in splitscreen mode \n\nModsl\n\n The mod downloader can now process more than the first 100 subscribed mods \n\n[hr][/hr]\nFor Mod Creators on PC\n\n Mod screenshots with spaces and other non-alphanumeric characters in their file names will now upload correctly in most cases \n\nMod Compatibility Updates\n\n MBF21 instant kill sectors were incorrectly killing non-enemy actors \n MBF21 instant kill sectors will fire immediately when a monster enters them, instead of waiting \n BOOM and MBF21 effects that kill monsters will deal 1 million damage instead of 10000 damage in order to fix mods that used monsters with high HP values to create an invulnerable enemy \n BOOM generic floor actions were not selecting the right neighbor when finding which sector ceiling or floor height they needed to move to \n Players can hurt and shoot projectiles at their own voodoo dolls (aka player model / clone), to be consistent with the original game \n ENTERPIC in UMAPINFO is correctly shown for the map you are entering instead of the map you just left \n DeHackEd strings for BOOM keys can now be replaced through DEH patches \n BOOM line action 242 (Deep water) will now transfer ceiling and floor lighting \n Now avoids crashing for invalid sized demos when playing the demoloop \n Maps using DMAPINFO will print the map name on automap, level select, and savegames \n Changing DeHackEd ammo type will now actually change the ammo type \n Fixed Berzerk Factor not calculating correctly in the A_WeaponMeleeAttack MBF21 codepointer \n Fixed BTSX Episode 1 and Episode 2 demo playback not rendering fullscreen \n Mods that override DOOM (1993) Episodes 1-3 will use the correct intermission screen \n MBF21 A_Lower codepoint now checks for an invalid weapon before changing weapons if out of ammo \n\n[hr][/hr]\nIf you'd like to read these release notes in additional languages, check 'em out on Slayers Club here (EN-only until 1/31 -- afterwards, change language via the globe button at the bottom of the page)."
    },
    {
      "title": "DOOM + DOOM II Update 1 Release Notes",
      "date": "2024-10-03 11:25:23",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6350729003494537664",
      "content": "Update 1 is live for DOOM + DOOM II and brings a handful of requested improvements and fixes!\n\nImprovements\n[hr][/hr]\nGeneral\n\n Added 21:9 resolution graphics for DOOM, DOOM II, The Plutonia Experiment, and TNT: Evilution \n Left turn, right turn, and strafe keys added to keyboard bindings, allowing playing with old-school keyboard-only tank controls \n Added 3D sound option in Sound Menu, allowing more than 2 speaker setups to be used – this allows individual sound effect levels to be taken into account compared to the original DOOM sound system \n Cheats can now be activated from the pause menu. Entering the original game’s cheat codes will unlock them for future use. You can also unlock all cheats from the Gameplay Settings menu \n\nMultiplayer\n\n The multiplayer match browser can now be filtered and sorted \n Added timer and frag limit added to the multiplayer scoreboard \n\nMods\n\n Players can now search for mods by name in the Mod Browser \n Release notes for mods are now visible in the Mod Details screen \n Checking for Mod updates can now be manually done from the Play Menu \n Added a link in the Play Menu to the Mod’s details page to allow quicker access to unsubscribe, like, and report \n The current page and last selection are kept when backing out from a Mod’s details screen \n Play Mods menu now shows locally installed Mods \n Added a menu option to pop up the folder where you can drop new WAD files \n Added “wad” console command to quickly load a WAD file and restart the game \n\n\nFixes\n[hr][/hr]\nGeneral\n\n When a save game is incompatible due to a map update, you will now restart the level from the beginning, with the inventory you had at the time of the save \n Globally reduced input latency by at least one frame at 60hz \n Various audio issues fixed, including ones around playing looping sounds, positioning, and limits on simultaneous voices \n Loading saves no longer causes enemies to attack other map objects \n Loading saves will correctly restore enemy infighting and tracking of Arch-Vile and Revenant targets \n The correct DOOMguy expression is now displayed on the HUD when being damaged with more than 120 HP \n Progress on the “Until It Is Done” achievement can now be made when playing DOOM & SIGIL \n All difficulty modifiers will restore correctly when loading a save game \n Weapon lowers properly when dying when turning view bobbing off \n\nEpisode-Specific\n\n Resolved soft-locks in MAP03 in Legacy of Rust and TNT: Evilution MAP06 (at the lift near the start of the map) \n Fixed an issue in which some enemies were getting stuck in TNT: Evilution MAP31 \n\nMultiplayer\n\n Fixed an issue in which all platforms could not see each other in the Match Browser \n Fixed an issue in which wall textures would sometime not scroll correctly for multiplayer clients \n\nMods\n\n The game will no longer force quit when attempting to load incompatible Mods, sending you back to the Menu instead \n Fixed an issue in which saves made from certain Mods would not load \n Automap will render correctly for large maps in Mods \n Extended Boom feature compatibility to support a broader range of Mods. If your Boom or MBF21 Mods were having issues prior to this update, please try them again, and thanks everyone for all the reports so far! \n\n[hr][/hr]\nIf you'd like to read these release notes in additional languages, check 'em out on Slayers Club here (change language via the globe button at the bottom of the page)."
    },
    {
      "title": "Minor Update 2 for DOOM + DOOM II",
      "date": "2024-09-05 11:44:37",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/6242640076597112616",
      "content": "This minor update fixes a memory leak when minimizing the game window on PC in DOOM + DOOM II."
    },
    {
      "title": "Minor Update for DOOM + DOOM II",
      "date": "2024-08-22 13:41:39",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5875595438688871849",
      "content": "This minor update makes improvements to how clients communicate with the backend in DOOM + DOOM II."
    },
    {
      "title": "DOOM + DOOM II Release Notes",
      "date": "2024-08-08 16:29:02",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/5963414363391584434",
      "content": "Developed by id Software and originally released in 1993, DOOM pioneered and popularized the first-person shooter, setting a standard for all FPS games. The critically acclaimed sequel, DOOM II, followed in 1994.\n\n[previewyoutube=-4-xswoPRpo;full][/previewyoutube]\n\nNow the definitive, newly enhanced versions of DOOM + DOOM II are available in a single combined release on Xbox One, Xbox Series X|S, PlayStation 4, PlayStation 5 and Nintendo Switch, in addition to PC platforms and Game Pass (subscription required). This definitive enhanced version is our biggest effort yet with online cross-platform Deathmatch and Co-op for up to 16 players, community-published single-player mod support (with in-game mod browser), optimized renderer, accessibility options, optional modern IDKFA soundtrack by Andrew Hulshult (including brand-new DOOM II recordings) selectable alongside the original MIDI soundtracks, presented in up to 120hz in 4K on supported platforms (see FAQ below for details) and a brand-new episode “Legacy of Rust,” with new weapons and demons made in collaboration by individuals from id Software, Nightdive Studios and MachineGames.\n\nNote: Existing owners of DOOM (1993) and / or DOOM II on any of the above platforms receive a free upgrade to the new combined game, and can still access their previously owned versions. (See FAQ below for details.)\n\nhttps://images.mweb.bethesda.net/_images/DOOM_VanityImage_1920x1080-04-ESRB.png?f=jpg&h=1080&w=1920&s=RdZ4un3QVOdX8CUM0mgNM2gszvntQ55jp7WhOt5Z-2k\n[hr][/hr]\nOwners Receive\n\n DOOM\n DOOM II\n Master Levels for DOOM II\n TNT: Evilution\n The Plutonia Experiment\n No Rest for the Living\n SIGIL\n Legacy of Rust (a new episode created in collaboration by individuals from id Software, Nightdive Studios and MachineGames)\n A new Deathmatch map pack featuring 25 maps (to accompany the existing 18) bringing the total Deathmatch levels to 43\n\n[hr][/hr]\nSupported Languages (text only)\n\n English, Simplified Chinese, Traditional Chinese, French, German, Italian, Japanese, Korean, Polish, Portuguese, Russian, Spanish\n\n[hr][/hr]\nNew Features and Improvements\n\n New Features and Improvements\n Online, cross-platform Deathmatch and co-op for up to 16 players\n Community-published single-player mod support with an in-game mod browser\n Chose to play the original MIDI DOOM and DOOM II soundtracks or the modern IDKFA versions by Andrew Hulshult (including brand-new DOOM II recordings)\n Improved performance with multithreaded rendering supporting up to 4K resolution and 120 FPS on Xbox Series X|S, PC and PlayStation 5\n Now on the KEX engine\n BOOM source compatibility makes it possible for hundreds of community-created mods from the past 25 years to be published in-game\n Accessibility options\n\n[hr][/hr]\nBrand New \"Legacy of Rust\" Episode\nhttps://images.mweb.bethesda.net/_images/id1.png?f=jpg&h=408&w=725&s=GtdqvuNa-3oZA9MPqlo5wsP7F7DAoKHjtZHZi8Ya4Vs\nCreated in collaboration by individuals from id Software, Nightdive Studios, and MachineGames, Legacy of Rust is the newest episode for DOOM, and the first official episode since DOOM II to feature new demons and weapons.\n\n\"Vassago's Rest\", the ancient inscriptions called it. With the meaning of the name lost to time, it wasn't long before the interlopers began calling the land by another: \"New Eden\". Just like the Garden of old, mankind's exile from this newly settled realm was swift and brutal.\n\nThis remote region of Hell, overflowing in (un-)natural resources as it were, was almost entirely devoid of demonic presence. The Union Aerospace Corporation, never one to shy away from hubris and excess, learned the hard way that even the demons feared something greater, something deeper. When the Ones Beneath awoke, the UAC's crown jewel was swallowed in a cascade of blood and fire.\n\nThree hours -- all it took to reduce New Eden to a sea of molten glass.\n\nThree minutes -- all it took before the UAC's top brass played their ace.\n\nThree seconds -- all it took for you to weigh the risks before accepting the job.\n\nYour orders are clear: reclaim the lost base and preserve the UAC's Legacy.\n\nOr die trying.\n[hr][/hr]\nid Vault\nDive into the id Vault and explore concept art from DOOM + DOOM II’s development, early versions of monsters, weapons, items, props, FX, HUD + Menus and textures left on the cutting room floor.\n[hr][/hr]\nEnhanced Cooperative Gameplay\nNew rules have been added to improve cooperative mode. If all players die, you will lose, and the level will restart. Respawn teammates by clearing all enemies in the area or finding a safe place to hide. Teammates will spawn near you, letting you get back into the fight quickly\n[hr][/hr]\nSplit-Screen Multiplayer\nDOOM + DOOM II includes 4-player split-screen multiplayer on all platforms, with 8 player split-screen available on Xbox Series X|S and PC. Fight against your friends in Deathmatch or with your friends in Cooperative mode, available in seven campaigns\n[hr][/hr]\nOnline Multiplayer\nFrag with friends and strangers alike across 43 different Deathmatch levels or play any of the episodes in co-op. Play alone or play online with local split screen players. LAN play is also supported.\n[hr][/hr]\nCrossPlay Multiplayer\nPlay with friends no matter which platform they prefer. Crossplay is available on all platforms, so you can play DOOM + DOOM II with everyone. Join your friends quickly using our room code system for finding lobbies\n[hr][/hr]\nNew Deathmatch Map Pack\nA new Deathmatch map pack featuring 25 maps was added thanks to community mappers: Luis “DX-Chain” Armacanqui, Luca Ciriaco, Ralph \"Ralphis\" Vickers, Matthew \"RottKing\" Cibulas, Colton \"Arrowhead\" Murchison, Andrew \"Saar\" Bouvé & Joshua \"tokyopunchout\" Boyle. This new pack compliments the existing 18, bringing the total Deathmatch levels to 43\n[hr][/hr]\nExisting Enhancements \nUpgraded visuals \nModern controller support including: Weapon carousel (for faster weapon switching) \nImproved mouse and keyboard controls \nLocal split-screen deathmatch and co-op for up to 4 players  \nFeatured community mods, including: REKKR, Syringe, Double Impact, Arrival, Revolution and over a dozen more… \n60 FPS and native 16:9 support \nRestored original in-game music using original hardware \nQuick Save/Load support DeHacked mod support Game Pass (Xbox Series X|S, Xbox One and Microsoft Store [PC]) and xCloud Support (Xbox Series X|S and Xbox One) \n[hr][/hr]\nAbout the Included Games \nhttps://images.mweb.bethesda.net/_images/doom-2.png?f=jpg&h=1200&w=2130&s=wcDbSTufK2YuaODPxGEnDA-VslaW7-BriQyjzalp99o\nDOOM (1993) - Original Version \nThe demons came and the marines died...except one. You are the last defense against Hell. Prepare for the most intense battle you’ve ever faced. Experience the complete, original version of the game released in 1993, now with Episode IV: Thy Flesh Consumed\nhttps://images.mweb.bethesda.net/_images/doom2-1.png?f=jpg&h=1200&w=2130&s=46x3yA38FJd7ccOOlg683B8XiDB52M07Xv3vzR7a-k4\nDOOM II – Original Version \nHell has invaded Earth, and to save it, you must battle mightier demons with even more powerful weapons. This beloved sequel to the groundbreaking DOOM (1993) introduced players to the brutal Super Shotgun, the infamous Icon of Sin boss, and more intense FPS action\nhttps://images.mweb.bethesda.net/_images/tnt-1.png?f=jpg&h=1200&w=2130&s=lpSHCPy1BYXAeEyOp96xb9-iKjTQjUBk-2ni5hQblMU\nTNT: Evilution \nThe UAC relocated their experiments to one of the moons of Jupiter. A spaceship, mistaken for a supply vessel, was granted access. But when it got close to the base, demons poured out. All your comrades were slaughtered or zombified. This time it's not about survival. It's about revenge\nhttps://images.mweb.bethesda.net/_images/plutonia-2.png?f=jpg&h=1200&w=2130&s=H4kt-vsv-RAj71-WgKRKhAxx2OLzWTWRL2F1GihoGvM\nThe Plutonia Experiment \nEvery effort has been made by the nation's top scientists to close the seven interdimensional Gates of Hell, but one portal remains open. Alone, you must infiltrate the ravaged base, defeat the demon Gatekeeper, and seal the last Hell portal before the undead take over the world\nhttps://images.mweb.bethesda.net/_images/masterlevels-1.png?f=jpg&h=1200&w=2130&s=CSBzBvlZysZDyW5CP6ccZavL70XCVZ2I2y3Zo2Q9pk8\nMaster Levels for DOOM II\nThis expansion includes twenty additional levels, all with the same hell-spawned horrors and action of the base game. Each level was created by independent designers and supervised by id Software\nhttps://images.mweb.bethesda.net/_images/sigil.png?f=jpg&h=1200&w=2130&s=6eWxeC23fe33cW-b6SIC7V2z8sJEu8FjBroXcFwlu3Y\nSigil\nCreated by id Software co-founder, John Romero, and released as an episode-sized mod consisting of 18 new maps, Sigil fits in between the timelines of DOOM (1993) and DOOM II. Baphomet, the gatekeeper of Hell, “glitched the final teleporter with his hidden sigil, whose eldritch power brings you to even darker shores of Hell. You fight through this stygian pocket of evil to confront the ultimate harbingers of Satan, then finally return to become Earth’s savior.”\nhttps://images.mweb.bethesda.net/_images/id1-1.png?f=jpg&h=1200&w=2130&s=jiBgG0pO7LurY4T1rLiV3U78kQxn9-UR7mYoKTpkxwQ\nLegacy of Rust\nCreated in collaboration with individuals from id Software, Nightdive Studios, and MachineGames, Legacy of Rust is the newest episode for DOOM, and the first official episode since DOOM II to feature new demons and weapons. This 16-map Episode is broken up into two 8-map acts: The Vulcan Abyss and Counterfeit Eden\n[hr][/hr]\nAccessibility Features\nWith this release, we are adding new accessibility features so DOOM + DOOM II can be enjoyed by even more players\n\n Learn more about DOOM + DOOM II's accessibility features in our guide\n\n[hr][/hr]\nPC Specs Minimum Spec (1080p/60 HZ)\n\n Win 10 64-bit version\n Intel Core i5-3570 @3.4 GHz or AMD Ryzen 3 1300X @3.5 GHz\n 8GB System RAM\n NVIDIA GeForce GTX 650 TI (2GB) or AMD HD 7750 (1GB)\n 1920x1080 Resolution\n Minimum 2GB free space on hard drive\n High speed broadband connection required for online play\n\n[hr][/hr]\nRecommended Spec (*4K/120 HZ)\n\n Win 10 64-bit version\n Intel Core i5-6600k @3.5 GHz or AMD Ryzen 5 1600 @3.2 GHz\n 8GB System RAM\n NVIDIA GeForce GTX 1070 (8GB) or AMD RX Vega 56 (8GB) or Intel Arc A 280\n 3480x216 Resolution\n Minimum 2GB free space on hard drive\n High speed broadband connection required for online play\n\n*Compatible display required\n[hr][/hr]\nFAQs\nWhere can I find these same release notes in more languages?\nCheck out these same Release Notes available in additional languages on the Slayers Club website here.\n\nI already own DOOM or DOOM II. How do I access the new release?\nPrevious owners of DOOM or DOOM II on Steam will automatically receive the new version with a free update. It may already be updated by the time you read this!\n\nHow do I access the original versions of the game?\nSteam users can use the Beta Participation property option to download and launch the original versions, or the last version that we launched in 2019 labeled \"previous-re-release\"\n\nWhat are the supported resolutions and framerates on Steam?\nPC: Maximum supported by video card/display\n\nWhat input devices are supported?\nController, keyboard, and mouse are supported on all platforms, including consoles. Split screen is available with mixed mouse/keyboard and controller\n\nDo I need an always online connection to play the game?\nDOOM + DOOM II only requires an online connection to play online multiplayer game modes. The single player campaigns and multiplayer via split screen, LAN, or ad-hoc multiplayer on Switch can be played while offline\n\nIs the Steam controller supported?\nDOOM + DOOM II does not support the Steam controller\n\nHow do I create a mod?\n\n DoomTools, which offers a wide array of utilities that will be useful or critical towards creating a Doom wad file (requires Java)\n Ultimate Doom Builder for level editing (requires Microsoft .Net Framework 4.7.2)\n SLADE for WAD file editing\n\n...and become familiar with online DOOM community wikis, such as DoomWiki.org, and Discords, such as UDBs and SLADE’s.\n\nHow do I upload a mod?\nMod uploading is only available on PC. To begin the process, select a game from the main menu, like DOOM II for example. Then select \"MODS\" from the menu, and select \"UPLOAD\" and follow the instructions!\n\nOn the Minimap, why do the Kill, Item, and Secrets totals not increment for the Host when completed by another player?\nFor the host player, Kills, Items, and Secrets don't count on the Minimap if another player adds them. This is intended. The minimap shows only your total kills, items, and secrets, not the total for the entire party\n[hr][/hr]"
    },
    {
      "title": "We’re simplifying the id Software Steam Store Listings",
      "date": "2022-08-10 15:18:48",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4607764924147340612",
      "content": "Spanning across multiple decades, id Software’s library of work is as vast as it is full of amazing games.\n\nHowever, this means a number of the id’s offerings have been released or reiterated in ways that can make our digital storefronts a touch…confusing. Rather than write out the differences between Final DOOM, Ultimate DOOM and just DOOM, we’re consolidating our Steam library of titles! For those id Software experts that do know all the variations of our games released on Steam, bear with us as we simplify how our games appear so that newcomers have an easier time.\n\nHERE’S THE PLAN:\nStarting August 10, we will begin rolling out changes to our Steam Store listings for select id Software games. In short, we are consolidating each game under one major title and/or changing the title for a simpler shopping experience.\n\nBelow will detail our current plans for Steam consolidation and how it affects your current Steam library if you’ve purchased these games already. And don’t worry, even if we are delisting a title you currently own, you’ll still have the game in your library to download and play like always.\n\nWithout further ado, the lowdown:\n\nDOOM (1993)\nWe will be changing the name of Ultimate DOOM in the Steam Store to DOOM (1993). No other major changes are being made at this time.\n\nDOOM II\nDOOM II will include Final DOOM and Master Levels as one install package. Each can be launched separately as follows:\n\n DOOM II\n DOOM II (Enhanced)\n Master Levels for DOOM II\n Final DOOM\n\nDOOM 3\nDOOM 3 will be merged into a package containing the original DOOM 3 plus the Resurrection of Evil expansion and DOOM 3: BFG Edition. The package allows each version to be installed separately as follows:\n\n DOOM 3\n DOOM 3: Resurrection of Evil (Requires DOOM 3 to be installed)\n DOOM 3: BFG Edition\n\nNOTE: Players that already own DOOM 3 or DOOM 3: BFG Edition on Steam will be upgraded to the DOOM 3 consolidated package with all three releases for free!\n\nQuake II\nQuake II and its mission packs, The Reckoning and Ground Zero, will be merged into one install package with multiple launch options:\n\n Quake II\n The Reckoning\n Ground Zero\n\nQuake III Arena\nQuake III Arena and Quake III Team Arena will be merged into one package with separate installs:\n\n Quake III Arena\n Quake III Team Arena\n\nSTEAM BUNDLES\nIn addition to updating our id Software titles on Steam, we’re also revamping our bundles (as well as introducing some new ones!) Note that if you already own certain titles listed in each bundle, you can complete it to get the remaining games added to your library at a discounted price. See below for details:\n\nDOOM Classic Bundle\nReplaces the DOOM Classic Complete Bundle on Steam, with this bundle now including DOOM 3 and DOOM 64.\n\n Includes DOOM (1993), DOOM II, DOOM 3 and DOOM 64\n\nDOOM Franchise Bundle\nExplore more DOOM with this bundle, including both the classic DOOM games as well as DOOM (2016) and DOOM Eternal.\n\n Includes DOOM Eternal Deluxe Edition, DOOM (2016), DOOM (1993), DOOM II, DOOM 3 and DOOM 64\n\nQuake Collection Bundle\nDive into Quake, all in one convenient bundle!\n\n Package will include Quake, Quake II, Quake III Arena, Quake Live, Quake 4\n\nDELISTED TITLES\nThe following will no longer appear in Steam Store searches, but will remain in your installed library listings:\n\n Quake II Demo\n Quake III Arena Demo\n Quake III Team Arena Demo\n Quake III Team Arena (This will be included with Quake III Arena)\n Final DOOM (This will install with DOOM II)\n Master Levels for DOOM II (This will install with DOOM II)\n Quake II Mission Pack: The Reckoning (This will be added to the Quake II launcher.)\n Quake II Mission Pack: Ground Zero (This will be added to the Quake II launcher.)\n DOOM 3: Resurrection of Evil (This will install with DOOM 3.)\n DOOM 3: BFG Edition (This will install with DOOM 3. Players that own DOOM 3: BFG will be upgraded to DOOM 3.)\n DOOM Classic Complete Bundle (This is being replaced by the DOOM Classic Bundle.)\n\n\nStill have some questions? Head over to our help portal here."
    },
    {
      "title": "Mouse Fix Update Released",
      "date": "2020-10-06 12:12:09",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/3807188575867464801",
      "content": "A small update has been released for our modern DOOM and DOOM II ports today. The only change is a fix for FPS dependent mouse sensitivity. Your sensitivity will feel different for the same slider value compared to before, however it will now feel more consistent, especially at higher framerates when vertical sync is disabled."
    },
    {
      "title": "DOOM Update - September 3",
      "date": "2020-09-04 15:46:01",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/3819571008260691038",
      "content": "Note for existing users\n\nThe unmodified, original DOS version running under DOSBox is still available! When launching the game, select \"Launch DOS version\" and you will have access to the previous version.\n\nhttps://images.ctfassets.net/rporu91m20dc/6aCAJjlPGQZW5nkioiiiSJ/07f1ab4d61e81aeb9824d722fb0204dd/New-Additions-Header.png\n\nAdded Steam Support\n\nAnyone who already owns either The Ultimate DOOM or DOOM II: Hell On Earth on Steam will automatically receive the new re-releases in their libraries. The original DOS versions are still available as a separate launch option from within Steam, and the original DOS IWAD files are in their original location on disk. Please note: if you have modified the files in the Steam install folder directly, some files may be overwritten. You should not modify files in the Steam folder directly, as this may cause issues. Anyone who purchases Steam copies of DOOM or DOOM II: Hell On Earth in the future; it will default to the re-releases but can access the original DOS versions as a separate launch option from within Steam.\n\nAdded widescreen rendering support\n\nFor the first time in an official port, the original DOOM renderer has been modified to natively render 16:9 without any letterboxing. The FOV has been increased to reveal more image on the side instead of chopping off the top and bottom. All new 16:9 versions of the titlescreen, intermission, and ending screens have been added. Many of our Add-Ons have also had widescreen support added, so download the latest version from the Add-Ons listing to check it out!\n\nDeHackEd support\n\nThe engine now can load DeHackEd patches, a popular tool for the original release that modified the game in order to support more advanced behavior. Add-Ons can now use new weapons, change enemy behavior, and more!\n\nDeathmatch 3.0 in split-screen multiplayer\n\nSplit screen deathmatch has been changed to what is commonly known in the community as \"Deathmatch 3.0.\" Weapons will stay in the world after being picked up in order to account for the extreme lethality of DOOM's weapons, and the weakness of the starting pistol, while all items and ammo respawn on a 30 second timer. Invulnerability and Invisibility will never respawn after being picked up for the first time.\n\nAdded optional crosshair\n\nA crosshair, which can be disabled in Gameplay Options, will also change colors when targeting an enemy. This means less guessing if firing a rocket is going to aim at the enemy above you, or fire directly into your face, bringing about an untimely death. Enabling the crosshair may also help reduce motion sickness by giving you a fixed point to focus on.\n\nAdded Gyro Aim\n\nGyro Aim, enabled by default when a DualShock 4 controller is plugged in, allows you to look left and right by either turning the controller, or rolling the controller left or right. This allows for an additional amount of precision by enabling fine corrections to turning in order to track moving enemies, while still using the right analog stick for large turning movements. Gyro Aim can be set to either use the controller's yaw, or pitch, or disabled entirely, along with a separate sensitivity slider.\n\nAdded FPS Limiter\n\nYou can set the FPS limiter inside Video Options to 30, 60, 120, 144, 165, 240, and unlimited FPS.\n\nAdded millisecond accurate timer\n\nA millisecond accurate timer has been added to the minimap, and to the end of level intermission, for anyone looking to speedrun levels.\n\nKeyboard entry of cheat codes\n\niddqd, idkfa, idclip, and all of their friends can now be entered from the keyboard, in addition to the Cheats menu, as in the original 1993 release.\n\nAdded secret area notification\n\nA message and notification is now displayed when you enter into a secret area for the first time.\n\nAdded Ultra-Violence+ Skill Level\n\nUltra-Violence+ is a twist on our existing Ultra-Violence skill level. Deathmatch/Co-op only weapons will spawn in, and enemies are fast like in Nightmare mode. In DOOM II, this means you get the BFG and Rocket Launcher right from the start, but in Final DOOM: Plutonia you'll have a Spider Mastermind staring you down as soon as you spawn in on the first level. It cuts both ways.\n\nhttps://images.ctfassets.net/rporu91m20dc/70TdEr4tsWFJvjjhpAaa2Y/2a5ff033c40b313e959612d0dd5f082d/Fixes-Header.png\n\n\nNightmare behavior has been fully restored to the original 1993 release by making enemies move twice as fast.\nIn honor of double speed enemies returning, the warning when selecting Nightmare difficulty has been restored.\nResolved an issue where lighting in split screen was not accurate compared to single player.\nImproved behavior of additional lighting option to increase light levels more accurately across walls and floors.\nPC/Switch: Reduced input latency by disabling rendering extra frames in advance.\nReduced delay in starting certain MIDI music in Add-On levels.\nResolved an issue from the original 1993 release where the Super Shotgun blast will linger for an extra frame.\nResolved an issue from the original 1993 release where the Former Human would not light up when firing.\nResolved a rendering issue from the original 1993 release where certain textures wouldn't tile vertically, commonly known as the \"Tutti-Frutti Effect\n\n\nhttps://images.ctfassets.net/rporu91m20dc/5OvFBxvTPaSYfzZcxTryeC/35689afd50ccbf880e61987746b4ed9f/CHANGES_header.png\n\n\nRestored original attract loop to the original 1993 release. The original title screen and credits screen are now visible between demo playback.\nRestored cut message from the original 1993 release when picking up a medkit, while having with less than 25 health.\nRestored cut \"ouch face\" from the original 1993 release for when a lot of damage is taken in a single hit.\nIntermission screen is now shown after boss levels, instead of cutting immediately to the ending screens in order to see level completion stats and time. Par times have been added to E1M8, E2M8, and E3M8.\nRandom SFX pitch is now disabled for chainsaw sounds to allow for better looping. Random pitch variation has been reduced for other sounds.\nPickup sounds and player voices will no longer interrupt weapon firing sounds.\nPS4/XB1/PC: VSync option in Video Settings to minimize input latency, at the cost of potential screen tearing.\nAdd-Ons will now use their intended custom graphics during intermission and level loading screens.\nLatest Add-Ons appear on the top of the Downloaded list."
    },
    {
      "title": "Brutal Doom update v20 to add ragdoll physics, more brutality",
      "date": "2014-04-18 16:00:31",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/pcgamer/919041785768853946",
      "content": "I didn   t think it was possible for Doom to get any better, but mods make everything better. The absurdly violent Brutal Doom mod is doing a great job of keeping Doom just as shocking and visceral of an experience as it was when it first came out 20 years ago, and the newest version will add ragdoll physics   because when I shotgun an Imp, I wanna see it tumble.\n\nThe Brutal Doom mod, which you may have seen us squee about before, adds new effects, animations, way too much blood, and other things that heighten the experience. v20, as you can see in the video above, makes each shotgun blast even more satisfying by knocking the enemy back an unreasonable distance. To me it looks like the right amount of ridiculous, but creator Sergeant_Mark_IV said he   s going to tone it down a notch.\n\n   I have been playing a lot of Killing Floor lately and noticed how small zeds are sent rolling on the floor when killed by shotguns at close range, I love this effect, then I thought about making something similar on Brutal Doom,    he said.    Of course it will not send almost every enemy flying away like in the video. I will reduce the minimum range from 300 to 200 units. I mean, the shotgun will only send flying enemies that are VERY close to the player, and shooting on the legs or heads still causes amputations.   \n\nWhen it comes out, v20 should also make the mod run smoother, make blood splatters and ejected magazine last longer, and other nifty things. It seems like Facebook is the best place to keep up with it, and you can download it for free from Moddb."
    },
    {
      "title": "Brutal Doom mod update coming next month, new trailer made of 90% gibs",
      "date": "2013-07-11 12:55:41",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/pcgamer/1478588572389029991",
      "content": "Doom's just not metal enough; thank goodness for Brutal Doom. Released in March last year, the beloved mod sought to make the classic even more hardcore and real—it introduced new death animations, gave objects shadows, and made headshots a thing. Now Brutal Doom's announced its 19th update, and after watching this trailer, I can say that I am very ready for this. (Though my ears, maybe less so.)\n\n\n\n\n\n\n\nBrutal Doom's ModDB page reveals that the update releases August 9, with various unspecified new features, fixes, and \"polishments\" to be added. Developer Sgt Mark IV says that this will \"probably\" be the final version of Brutal Doom. The next game he's keen to focus on uber-gorifying with the Brutal treatment? Hexen. For now, we just wait till August for this. Someone pass me the super-chunky salsa—I want to bite down hard on that tasty, tasty desensitization."
    },
    {
      "title": "Brutal Doom mod update adds custom fatality animations",
      "date": "2012-11-01 15:34:13",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/pcgamer/1514593982820459326",
      "content": "In the word of Dethklok frontman Nathan Explosion: \"Brutal.\" Originally released in March, the Brutal Doom mod furnishes Doom's buckets of blood, steaming guts, and ultra-violence with a critically missing element: more buckets of blood, steaming guts, and ultra-violence. We're talking extreme Chunky Salsa Rule here. A freshly spawned Halloween update provides custom fatality animations as you RIP AND TEAR into Hell's minions. \n\n\n\nHelmed by the one-man efforts of Sergeant Mark IV, Brutal Doom doesn't just coat everything in strawberry juice. The mod also augments weapon and projectile behavior to react slightly more realistically—slightly; you're still fighting demonic hellspawn in a box in space—such as inflicting harmful splash damage to yourself if you're too close to a wall. Stealth kills and movable barrels are also possible. Headshots count. Limbs sever. \n\n\n\n\"Everything in Brutal Doom is extremely intense,\" the good Sergeant writes. \"Everything sounds louder, looks bigger, moves faster, and hits harder. The camera shakes every time something explodes near you. Enemies are harder and smarter, and weapons and explosions are loud as fuck.\n\n\n\n\"Some enemies will scream in anguish and try to crawl away when near death, and they can be used as human shields. Blood will drip through your visor every time you shoot enemies too close.\"\n\n\n\nBrutal."
    },
    {
      "title": "10 amazing Kinect PC hacks",
      "date": "2011-01-10 08:30:16",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/pcgamer/1195904465638563674",
      "content": "Microsoft have recently dropped hints that they might be planning to officially bring the Kinect to PC. If they do, they'll be hard pushed to improve on some of the user made applications that have been appearing since the Kinect was successfully hacked. We've gathered together some of the best below, including a program that turns you into a superhero, another that lets you play Call of Duty: Modern Warfrare with your body, an 80's synth pop music video creation tool, and more.\n\n\n\n1. Playing Call of Duty: Modern Warfare with Kinect\n\n \n\n2. Become a Superhero\n\n\n\n3. Playing Doom with Kinect\n\n\n\n4. Kinect X Ray vision\n\n\n\n5. Playing World of Warcraft with Kinect\n\n\n\n6. Music video\n\n\n\n7. Piano anywhere\n\n\n\n8. Drawn to life\n\nDaVinci prototype on Xbox Kinect from Razorfish - Emerging Experiences on Vimeo.\n\n9. Tetris\n\n\n\n10. Minecraft Statues\n\n\n\n\n\n\n\n\n\nThere are a few great hacks that we've featured on the site before. You might want to check out the video of a man playing RUSE with Kinect, and another of a man using the camera to play Minecraft. Honourable mentions also go to the Invisible Man hack, the virtual air guitar the hovering Kinect robot, and the deeply weird body morph hack. For more hacks and some introductory guides to hacking Kinect yourself, check out Kinect Hacks."
    }
  ]
}