{
  "appId": "2310",
  "count": 13,
  "notes": [
    {
      "title": "Quake - Update 4.1",
      "date": "2022-09-29 12:44:06",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4588629064111145583",
      "content": "Update 4.1 for Quake includes an improved initial Accessibility options setup and a few other minor changes. Thanks to your feedback from the menu flow of Accessibility options we introduced in Update 4, we've improved the initial flow. On first startup, you will be presented with the following screen and have to choose one of the two options:\nhttps://images.ctfassets.net/rporu91m20dc/1cjUc2OaBRvb221wV3s7NU/5ed3b2a439c30a99e7f71e254f29ffa7/Quake_Update4.1_Initial_Accessibility_Screen_960x540.png\nChoosing Disable all settings will disable all Accessibility options and return you to the main menu. Choosing Customize accessibility settings… will bring you into the Accessibility Menu to so you can access the full list of settings.\nWe hope this helps players who were confused in Update 4 by the high-contrast and alternate typeface options being enabled, but weren’t sure how to disable them, while allowing players looking to dive into our Accessibility options quicker access.\n[hr][/hr]\nOTHER MINOR UPDATES\nLevel Select Menu\n\n Restored missing level MGEND: Chthon's Vengeance to the Level Select menu\n\nAdd-ons Menu\n\n Add-ons menu selection images are now 16:9 aspect ratio\n\nThreewave CTF\n\n Restored Threewave CTF spawns to original intended system: players will spawn for the first time in their own base, but afterwards will spawn randomly at deathmatch spawn points. This will prevent players from spawncamping a team inside their base\n\n[hr][/hr]\nICYMI - Read the full release notes from our last major release: Update 4 here."
    },
    {
      "title": "Quake - Update 4",
      "date": "2022-08-18 11:56:10",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4584121659781194965",
      "content": "Update 4 for Quake includes the return of the legendary progenitor of team-based multiplayer: Threewave Capture the Flag! We have resurrected nine iconic levels from the original mod just in time for QuakeCon to bring you and seven of your closest frag friends back together again!\n[hr][/hr]\nTHREEWAVE CAPTURE THE FLAG (CTF)\nhttps://images.ctfassets.net/rporu91m20dc/4iyRQZMzjY47QUqxHCiQZQ/3c0671d58577052b19ae5755956d3764/Quake_ctf.gameplay.png\nThe rules for Capture the Flag are similar to the backyard game: protect your flag, steal the enemy’s, and return it to your own flag to score a point. Threewave CTF comes with some extras to this basic formula by adding power-up runes for teams to fight over, and the famous grappling hook!\n[hr][/hr]\nA BRIEF HISTORY\nFor all those scholarly Rangers out there, here's a brief history...\nThreewave CTF was first released in October of 1996 by Zoid Kirsch. The mod back then was simple, and remixed existing game content to create something new. Matches took place on the single player levels modified to create bases. Keys were used in place of flags, and the grappling hook was an axe that fired a Vore ball. While a little bit of imagination was required, this didn’t hurt the mod’s reception at all. It caught on fire immediately and built a large fanbase of players looking for a deeper alternative to deathmatch.\nOver the course of many updates, and eventually a QuakeWorld version, Threewave CTF would go on make Capture the Flag a household name in multiplayer game modes, and even spawn websites that exclusively covered Capture the Flag modes in games. Threewave CTF would be released officially as a part of Quake II, and the Quake III version of the mod would bring in new flag-based game modes and maps that would later make their way into Quake Live. Quake multiplayer and Threewave CTF have always been intertwined, and now the mod that started it all is now available for free in the enhanced Quake re-release\n[hr][/hr]\nNEW ENHANCEMENTS\nThis latest version of Quake has been enhanced, with an improved flag status display showing if your flag is safely in base, team scoring, and a modern interface. The maps included have been updated with improved lighting and fog effects. All of this is included free in Update 4, and requires no additional download\n[hr][/hr]\nRUNES\nFour power-up runes spawn randomly throughout the map at the start of the match. Teams will vie for control over them, as they bestow their holders great benefits, and will stay with them until death. They fly out of the player on death, so keep an eye out, and grab them as quickly as possible to posses their power. If nobody picks them up eventually, they'll respawn elsewhere. Holding these runes are key to giving your team the edge to win!\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/TXq9i0oRBlVG5jzP4Ax1w/edc76b844c872feef284ab4187490b24/Quake_Rune_Earth.Magic_960x540.png\nRune of Earth Magic | Resistance - Take half damage from all weapons\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/3ItYZNa3p4OX5Pqs3FaouZ/a962d2c81a4a8d1a7c663176a05accd8/Quake_Rune_Black.Magic_960x540.png\nRune of Black Magic | Strength - All weapons deal double damage\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/1hJfBLmolPQJVUlGJ7BkQn/2468176354ec3038d63a9809130a6e54/Quake_Rune_Hell.Magic_960x540.png\nRune of Hell Magic | Haste- Most weapons fire twice as fast, and nail projectile speed doubles\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/1Uy37Nfc1yw77suc4UQn9H/63429546db77f06a4c35d94e8e67dfa4/Quake_Rune_Elder.Magic_960x540.png\nRune of Elder Magic | Regeneration - Regenerate some lost health and armor every second, up to 150\n[hr][/hr]\nGRAPPLING HOOK\nThe grappling hook, accessed via the weapon wheel or by pressing the key bound to the Axe, is more utility than weapon than most options in your armory. Holding down the fire button will shoot the hook, where it will fly straight forward until it hits a wall. Once attached, the hook will pull you in at a very high speed. The hook can be attached to players to do a constant stream of damage; however this will leave you vulnerable to the player you are attached to.\nSwitching weapons while the hook is attached will allow you to hang off walls and fire, however you will be vulnerable as you will be unable to move, doing your best impression of a turret. Using this to ambush an attacker can be an effective tactic, however it should be used sparingly as ambushes only work if they are unexpected!\nAdvanced players can shoot the hook at the ground, and then immediately let go as soon as the hook starts to pull you. This lets you launch into a bunny hop at a very high speed, and makes you less predictable of a target as you weave your way around the map\n[hr][/hr]\nMAPS\nOur update includes nine of the maps from the original mod\nhttps://images.ctfassets.net/rporu91m20dc/hVH0BRfmtin2OLRVI6fDu/ecc567a42f8e532f70966b12dbf4bbba/ctf1.png\nCTF1: MCKINLEY BASE\nCreated by Zoid Kirsch\nTwo bases connected by bridges, and an underwater route. An instant classic, and the most iconic map of the mod\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/5FCUo3En7z4JnHvtWWKRuz/310f73f919c52d73904463711fc8b057/ctf2.png\nCTF2: MCKINLEY STATION\nCreated by Zoid Kirsch\nThe sequel to McKinley Base, with bigger bases, a bigger flag room, and more routes. A classic, refined\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/6huuCopO6vZhOEBn7j7E8j/cad2318276267ab26a7e037788c0e1ff/ctf3.png\nCTF3: SPILL THE BLOOD\nCreated by Dale Bertheola\nCatwalks and bridges hanging over lava and acid, with a wind tunnel into the flag room that provides ample opportunities to overwhelm the defense for some skeet shooting practice\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/55lE1n8c22nsDxWHVo7VZN/e3b3392a4489ff89ac3dd52c7526eb57/ctf4.png\nCTF4: GLOOM CASTLES\nCreated by Tim Willits\nA CTF version of the classic E1M5: Gloom Keep. Two Gloom Keeps, face to face. The front door is the shortest route, but also the riskiest. Lose the defense by taking the long way around\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/2MdzLJfTGTE3rUksKEOtUD/61ac369db9031fd10299f9cb5455a05f/ctf5.png\nCTF5: CAPTUREPHOBOPOLIS\nCreated by American McGee\nThe mouthful of a map returns, but now with flags! This time, the bases are stacked on top of each other: red team on top, and blue team below\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/1C8i4Zii4OrUCMbuIUZQQi/ae45da440fb98c4cacb7e6fb90625950/ctf6.png\nCTF6: VERTIGO\nCreated by Dale Bertheola\nEach flag is flanked by a hulking Quake Q, looking over three paths out of the flag room and one-way wind tunnels\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/2Sm1EOyJHF1pMhrJKMiZ2X/fdfd4440d10c34b82020b574c3e95340/ctf7.png\nCTF7: THE STRONGBOX\nCreated by Brent McLeod\nWith a warehouse at its center, elevators and trains between bases provide ample grapple opportunities into tight flag rooms\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/1drZofczoXtCTyXjBqxZIF/845f06367d34c1789588fe1f10e05077/ctf8.png\nCTF8: CHTHON’S CAPTURE HOUSE\nCreated by Tim Willits\nChthon’s hellish domain has been converted into a base in our smallest map of the set, providing intense combat with nowhere to hide\nhttps://images.ctfassets.net/rporu91m20dc/26wns0NCApE6UDu1za2fGN/9659c10e436dfab57667ed0390e7cdbc/ctf9.png\nCTF9: DA ANCIENT WAR GROUNDS\nCreated by Matt Hooper\nCatapult yourself over the moats into two traditional medieval castles and grab the flag from the throne room\n[hr][/hr]\nBUG FIXES\n\n Fixed Fiend arm clipping into the floor at death\n Fixed auto aim debug variables that could be used to cheat in multiplayer\n Fixed loading lightmaps in huge levels, such as when users side-loaded \"Tears of the False God\" in Arcane Dimensions"
    },
    {
      "title": "Quake update adds new accessibility options after 26 years",
      "date": "2022-04-20 15:01:19",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/4348797798072640113",
      "content": "A new update for the venerable FPS game Quake has added some welcome new accessibility features to the user interface, 26 years after the original version launched for MS-DOS. When you fire up the Steam version of Quake after applying today's patch, you'll notice that the main menu is displayed in a bright white, sans serif font - and there are other new options available as well.\nThe latest Quake patch adds additional accessibility options to Quake's main menu. When you first run the game after applying the patch, that will be the first screen that pops up, giving you the chance to select which of the new features you want enabled. You'll find new options for high contrast menus, the alternate menu typeface, and text-to-speech and speech-to-text options for chat.\nFor players with auditory or visual processing difficulties, these options could make playing the granddaddy of deathmatch significantly easier. In-game messages can be prominently displayed in crisp white lettering over black background blocks, making it much easier to see text like \"you got 5 shells\" or \"you found a secret area.\"\nRead the rest of the story...\nRELATED LINKS:\n\nQuake just got a new horde mode, made by the Wolfenstein devs\n\nQuake 1 gets a \"major update\" that takes aim at mod problems\n\nWhat if: Quake gets a Doom Eternal style reboot?"
    },
    {
      "title": "Quake - Update 3",
      "date": "2022-04-20 12:21:58",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4348797798072198303",
      "content": "Quake Update 3 includes new Accessibility features, three new Horde Mode maps from MachineGames, as well as QOL improvements, and bug fixes\n\nNEW ACCESSIBILITY FEATURES\n[hr][/hr]\nWe are happy to add new accessibility features to Quake so that the gameplay experience can be enjoyed by even more players\n\nAccessibility Options Notification\n\n After installing Update 3, you will be presented with an Accessibility Options notification. Read through the available options to make sure they are set to your preference. Once in-game, these options can be accessed from the Options/Accessibility sub-menu via the Main and Pause Menus\n\n(Note: All Accessibility options default to ON during first launch after install - but can be easily toggled OFF/ON via Disable/Enable All Settings)\nhttps://images.ctfassets.net/rporu91m20dc/53cZ87RNPifGqn0X1JxMSP/04e436498c4eeed604bab5d8e1171dfd/Quake-Accessibility-DisableALL_960x540_ESRB.gif\nAccessibility Options\nhttps://images.ctfassets.net/rporu91m20dc/7giJostYvbfEjA5pei7tsg/1d8626adee361a5006f3314a060e0f26/Quake_Accessibility_Options-1_960x540.png\nRead Chat Out Loud '*'\n\n Converts incoming multiplayer text chat into a synthesized voice\n\nTranscribe Voice Chat\n\n Converts incoming voice chat to text in the multiplayer chat window\n\nSpeak For Me in Voice Chat '*'\n\n Converts outgoing multiplayer text chat into a synthesized voice audible to other players\n\n'*' Voice profiles can be selected from the Accessibility menu when connected to an online multiplayer session\n'*' Text-to-Speech menu narration is not supported\nhttps://images.ctfassets.net/rporu91m20dc/1eDnrMMBOsjqI2qELw1tnD/aa089d1c14874197c51515592045aed2/Quake_Accessibility_Options-2_960x540.png\nNote: There are several Voice Profiles now available in Quake. The number available per language may vary\n[hr][/hr]\nHigh Contrast\n\n Changes the default text field backgrounds to improve User Interface legibility\n\nhttps://images.ctfassets.net/rporu91m20dc/3c8H4Fz4KZxpFUIl8pd4dq/6a3484ea39a6e24c3aae5ec34debd7e9/Quake_Accessibility_Options-1-2_960x540.png\nHigh Contrast OFF\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/7giJostYvbfEjA5pei7tsg/1d8626adee361a5006f3314a060e0f26/Quake_Accessibility_Options-1_960x540.png\nHigh Contrast ON\n[hr][/hr]\nAlternate Typeface\n\n Changes the original in-game font to a more modern one for improved legibility\n\nScreen Flash Amount\n\n Decreases opacity of onscreen effects to reduce flash intensity\n\nCenter Message Time\n\n Changes the display duration of center print HUD messages\n\nCorner Message Time\n\n Changes the display duration of corner print HUD messages\n\nMaximum Lines\n\n Changes the maximum number of onscreen corner print HUD messages\n\nChat Message Time\n\n Changes the display duration of multiplayer text chat messages\n\n[hr][/hr]\nHORDE MODE\nThree New Levels\n\nEnjoy three new Horde Mode levels courtesy of our friends at MachineGames!\n\nhttps://images.ctfassets.net/rporu91m20dc/6zb2TiKo4YxhtLtwSvjn8J/0378492257751c294a6da9cfee3396a4/Quake_Horde-Relic_960x540.png\nRelic\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/HJccYIr2IbCZRvlAQAQ6g/eaf0d6e9b11c7797b9d73859c8c5938b/Quake_Horde-TheTrial_960x540.png\nThe Trial\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/EmfsQOG1KI99J0ZXL7sJn/58d4f54eec73c911133363273f123ebb/Quake_Horde-TheTower_960x540.png\nThe Tower\n[hr][/hr]\nQUALITY OF LIFE IMPROVEMENTS\nGeneral Gameplay\n\n Added option to disable automatic weapon switching on pickup (Note: This may not work with certain Add-ons)\n Improved spawn logic to avoid spawning enemies when the player is on a spawn point\n\nHorde Mode\n\nSkill selection balance adjustments:\nWe’ve received community feedback that Horde Mode is too hard on Easy and too easy on the more difficult skill selections. To accommodate this feedback, we’ve made Horde Mode less difficult on Easy and more difficult on the Hard and Nightmare skill levels. We hope these balance changes are to your liking and look forward look forward to hearing from you on them!\n\n Fewer enemies are spawned in each squad on Easy skill selection\n Boss enemies will start showing up in earlier waves on Hard and Nightmare skill selections\n Hard skill selection now starts with as many enemies as wave 3 had previously\n Nightmare skill selection now starts with as many enemies as wave 6 had previously\n Additional balance adjustments:\n Ammo now respawns every 20 seconds instead of once per round\n Enemies are now more tenacious – they will now route around the map and obstacles to find you. No more hiding and safely picking off harmless monsters from a distance!\n Four player games will now spawn in double the enemies in each wave\n\nMultiplayer\n\n Removed ability to enable cheats in public multiplayer matches (Note: Cheats can still be enabled from a PC host in private matches)\n Changed color of enemy text chat from red to green for increased contrast and improved legibility\n Online multiplayer text chat messages can now be sent via the Pause Menu (Note: Only PC versions support text entry from physical keyboards)\n Added option to toggle the scoreboard on/off with a button press instead of a button hold (in Gameplay Options)\n\nMultiplayer Bots\n\n Added Deathmatch bot support for all single player levels in the original campaign, courtesy of Jorge Martins (Check out their super useful guides made for community modders here)\n Bots now roam around if the current map doesn't have items, finding their own roam goals\n Bots now better handle maps with lots of air blasts that push them around\n Improved bot navigation on MGDM1, and E1M2\n Bots now roam around if map doesn't have items, finding their own roam goals\n Bots now better handle maps with lots of air blasts that push them around\n Improved bot navigation on MGDM1, and E1M2\n\n[hr][/hr]\nBUG FIXES\nGeneral Gameplay\n\n Fixed an issue in which music was not playing correctly on certain Add-ons\n Reduced audio latency throughout the game\n Fixed a bug in which the House of Doom achievement was not unlocking when finding the secret level in Dimension of the Past\n Resolved an issue in which the Corner message would print the incorrect one for a single frame\n Fixed an issue in which menus would not scroll all the way to the top of the screen\n Resolved the issue where the text chat window was too small while playing at 4K resolution on supported platforms\n\nHorde Mode\n\n Fixed a bug in which suicide in Horde Mode would not deduct points and immediately respawn you\n Resolved an issue in which killing a teammate would incorrectly grant a frag and not end kill streaks\n Removed the random offset from dropped powerups to prevent them from falling out of the level\n\nMultiplayer Bots\n\n Fixed an issue in which bots would sometimes miss shootable triggers\n Fix bots incorrectly using Mjolnir when they don’t have ammo\n Addresses the issue where bots wouldn’t chatter when killing an enemy, or if teamkilled\n\n[hr][/hr]\nMODDING IMPROVEMENTS FOR MODDERS\nThe following changes apply to users who may be developing Add-ons that work on the PC version of Quake\n\nGeneral Modding Improvements\n\n Our QuakeC source code is now available! This includes the QuakeC source for the base game, Scourge of Armagon, Dissolution of Eternity, and the new Dimension of the Machine, which includes Horde Mode. This code is released under the GPL license and can be obtained from the id Software GitHub here\n QuakeC built-ins that are unique to the rerelease are now looked up by name, rather than hardcoded builtin numbers which could interfere with other engines\n Fixed issue with long centerprints disconnecting clients when sent, which could occur when using long custom intermission end texts in Copper\n Added \"walkpathtogoal\" QuakeC built-in. This can be used as a drop-in replacement for the existing AI movement to allow any entity to take advantage of bot pathfinding without needing them to be a bot client. Create a friendly dog that does your bidding, or haunted items that run away from the player to avoid being picked up. The world is your oyster!\n New entities are available for ranged, flying, and boss spawn points. The horde spawning logic will use these points if available\n Monster spawners can be controlled by using trigger_multitouch entities to enable or disable them as the player moves throughout the map\n\nMultiplayer Bots\n\n Added \"bot_movetopoint\" - new QuakeC built-in to give bots a high level command to move to a point\n Added \"bot_followentity\" - new QuakeC built-in to give bots a high level command to follow any entity that they are aware of\n Added Bot_PreThink - new QuakeC function that gets called before bots run their update logic in the engine\n Added Bot_PostThink - new QuakeC function that's called after bots run their update logic in the engine\n Added \"objective\" flag to items.txt processing. This allows you to tag any item as an objective. Bots track these as a special case, but rely on you to tell them what to do about it\n Warn at startup if weapons are not correctly setup with a power of two number in QuakeC\n Add cvar \"bot_entityRespawnFunc\" to tell the bots which function in a QuakeC mod handles respawning items. Bots use this knowledge to understand when items like the MegaHealth will actually respawn\n Bots can receive and will react to two stuffcmds: “color” and “kill”\n Update monster teams regularly - allows mods to add/remove monsters from teams during the game, and have bots understand the change\n Support idea that monsters can \"belong\" to a player in DM\n\nBot Navigation Editor\n\n Add cvar \"navEdit_removeNoclipOnExit\" to disable turning off noclip when exiting nav editor\n Expose bot pathfinding heuristic value to users in the nav editor, and save the heuristic into the nav file\n Rename cvar navEdit_waterLookPointDist to navEdit_inWaterLookPointDist for clarity\n When underwater, place nav node centered on crosshair\n Fix nav node placement in shallow water\n Add ability to clear start/goal nodes when testing paths in the editor by pressing F8\n Add ability to toggle seeing traversals when testing paths in the editor by pressing F5\n Add \"NoMonsters\" flag to nav nodes. Allows you to mark nodes that AI shouldn't use (eg. if the node is too close to a wall or obstacle that might get an AI stuck, but are not issues for bots)"
    },
    {
      "title": "Quake | Free Add-ons Available | Honey, Underdark Overbright & Copper",
      "date": "2022-02-09 14:55:31",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4235075565596472644",
      "content": "Enjoy battling through new maps in Underdark Overbright as well as experience the original game with community-driven gameplay adjustments with a bonus to this Add-on, Copper.\n\nhttps://images.ctfassets.net/rporu91m20dc/3oMPerJVgGorknYUBRTMnN/193b7fb7cc24a11e9a949f918f5e35e0/QUAKE_UDOB_in-body_1-3.jpg\n\nUnderdark Overbright is an eight-level episode set in a mix of medieval architecture and overgrown environments, serving as a prime example of the modern Quake modding community. The new episode brings you through some unique moments such as an underwater gauntlet, a fight to survive on sinking lava platforms and single-player revisitations of Deathmatch classics. As a bonus, the original Quake episodes are available from the Underdark Overbright hub map as well as a whole new end level, so definitely check it out!\n\nUNDERDARK OVERBRIGHT & COPPER\n\nhttps://images.ctfassets.net/rporu91m20dc/3IILRJch7aiyLwc0QKm86B/6b017fe4ed5e8d3c8b4b5d9d54d1d1b4/QUAKE_UDOB_in-body_end-3.jpg\n\nSpeaking of the original Quake, also included in this Add-on is Copper - a modification that slightly alters Quake’s gameplay! With adjusted behaviors for items, monsters and weaponry, Copper’s quality-of-life changes offer a new take on your next trip through the Slipgate.\n\nHONEY\n\nhttps://images.ctfassets.net/rporu91m20dc/4NfpgLKGQ3jdY0UEW2y9gZ/090bcdaedcf0f2ef23aa83b63c73222d/QUAKE_HONEY_in-body_3.png\n\nEncounter waterlogged crypts and underground temples as you face the darkness, combating a deadly plague blighting the land. With expert use of fog effects and silhouettes, traversing through Honey’s maps are just as good at ambiance as they are obscuring the deadly threats you’ll face in this fan-favorite Add-on!\n\nhttps://images.ctfassets.net/rporu91m20dc/1RRWvLAJjHMSp0Y9VnWXP2/0f2c96b1e5f4798be704da025c037fe4/QUAKE_HONEY_in-body_4.png\n\nDownload Honey, Underdark Overbright & Copper for free via the Add-on menu in Quake today! Learn more how Underdark Overbright & Copper were developed with our exclusive interview with the original creators, Lunaran and Scampie! And of course our exclusive interview with Honey creator and MachineGames alum, Christian Grawert!"
    },
    {
      "title": "Quake Remastered's second update adds a horde mode and new singleplayer levels",
      "date": "2021-12-02 14:51:03",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/4224936215384735666",
      "content": "Nightdive Studios' excellent remaster of Quake already contained a bonus episode from Wolfenstein reboot devs, MachineGames. The game's second major update, released today, adds even more new content from the Swedish studio...\n                Read more."
    },
    {
      "title": "Quake - Update 2",
      "date": "2021-12-02 11:25:58",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4224936215384179641",
      "content": "Update 2 contains a brand-new Horde Mode made by MachineGames with 1-4 player co-op (including optional bots), new Add-on \"Honey\", some quality-of-life improvements, and bug fixes.\nIt also marks the Quake release on the Epic Games Store (for PC). With Horde Mode you can play solo, with bots, or friends, and face off against waves of enemies of increasing difficulty. Earn Silver Keys to unlock access to better weapons. Survive long enough and earn a Gold Key, which will allow you to escape, or stay behind and fight against the armies of Quake until you fall\n\n\n\nHORDE MODE\n[hr][/hr]\nOverview\n\n All new multiplayer PvE experience designed by MachineGames \n Supports 1 - 4 players or bots in local multiplayer and online modes (Custom matches only)\n Playable on all difficulty levels\n Includes 4 new maps specifically designed for Horde Mode\n\nRules\n\n Score points by killing enemies\n Kill multiple enemies in quick succession for bonus points\n Your progression is reset after the last player dies\n Every 3rd wave has boss monsters but once you clear it, you get a Silver key to unlock more weapons and items\n After the 9th wave, you get a gold key to unlock the exit, or you can keep fighting as long as you are able\n Monsters have a chance of dropping quad damage and the pentagram of protection (powerups last for 5 seconds once picked up and despawn if not picked up after 10 seconds)\n\n[hr][/hr]\nNEW ADD-ON: HONEY\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/3tJ5fjdFjbLjmbfEvaLEdt/f383363ac9f29167265ab5ccf39297b7/QUAKE_HONEY_in-body_5.png\n\n Expand your Quake experience with the free Honey Add-on and delve deep into the darkness to conquer a deadly plague infecting the land\n For a unique look behind the curtain, check out our Nods to Mods interview with the author of \"Honey\", MachineGames' own Senior Level Designer - Christian Grawer here\n Read more about how to access Honey here\n\n[hr][/hr]\nIMPROVEMENTS\n[hr][/hr]\n\n Improved auto aim to reduce amount of snapping and view locking onto enemies\n Crosshair color and type can now be changed from the Gameplay options menu\n Add-ons menu can now be used to play previously downloaded add-ons while offline\n Text chat and push to talk voice chat are now available in pre-game lobbies\n Added ability to invite friends across PC platforms using players on your Bethesda.net friends list (optional)\n\n[hr][/hr]\nRANGER SKINS IN QUAKE CHAMPIONS AND DOOM ETERNAL\n[hr][/hr]\nhttps://images.contentful.com/rporu91m20dc/6PXCqwNGJM6TT3IJCD2K27/64fdd2943abc955f61811aa2e9a1cdcc/DE_QC_RangerSkins--1920x1080.png\n\n Owners of our Quake re-release can log in with their Bethesda.net credentials in-game to earn the Ranger Slayer Skin for DOOM Eternal and the Quake Guy Ranger Skin with the Gladus Axe in Quake Champions! (NOTE: In addition to owning Quake, players must also own DOOM Eternal or Quake Champions to use their respective skins)\n For more info, click here\n Note: Nintendo Switch users can unlock the Ranger Slayer Skin in DOOM Eternal alongside Update 6.66 sometime in early 2022. Stay tuned to the Slayers Club for updates!\n\n[hr][/hr]\nBUG FIXES\n[hr][/hr]\n\n Fixed Death Knight incorrectly referred to as Hell Knight in the main Quake campaign\n Bots now chat less\n Fixed cases where texture borders were visible around certain HUD elements\n Fixed weapon firing immediately after respawning in multiplayer\n Turning off Enable Microphone before connecting to online services now properly mutes the microphone\n\n[hr][/hr]\nMODDING IMPROVEMENTS\n[hr][/hr]\nThe following changes apply to users who may be developing add-ons that work on the PC version of Quake\n\n Added new cvar navEdit_onlyTraceAgainstWorld to validate look position only against the world (skipping all other entities). This cvar is exposed as a user option in the nav editor\n Added new cvar navEdit_skipLookPointValidation which completely skips look point validation, allowing user to place nodes anywhere • Bots now understand Zombies are killed easier with explosives and will switch weapons if possible\n Further improved bot control of powerups on the map in DM\n Bot characters are now reloaded when loading a new mod/Add-on\n Make sure FL_ISBOT flag is set on the bot client when the bot calls \"ClientConnect\" and \"PutClientInServer\" inside QuakeC. This allows mods to run bot specific logic when a bot spawns in\n Fixed bots trying to pick up weaker armors, when wearing a stronger set\n Added nav editor cvars that are handy when switching back and forth between editor and game for testing, navEdit_removeGodModeOnExit, and navEdit_removeNotargetOnExit\n Added g_removeAllAI to remove all AI that are on the map. Will check regularly for spawned AI to remove them as well\n Added nav editor cvar navEdit_showLinkType. Useful for debugging pathing issues. Cycles between showing all links/nodes, only nodes with one way links, and only nodes with non-walk links"
    },
    {
      "title": "Quake 1 gets a \"major update\" that takes aim at mod problems",
      "date": "2021-10-10 13:07:00",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/PCGamesN/4069556867215824632",
      "content": "The first big patch for the Quake 1 enhanced edition has dropped, described by Bethesda as a \"major update\" that takes aim at issues such as controls, bot support in multiplayer, and numerous bug fixes. It also features numerous mod support improvements to get new and old Quake mods working with the new remaster.\nThe new enhanced edition of the first game in the Quake series was announced at QuakeCon in August and released the same day, along with two original expansions created by Wolfenstein: The New Order developer MachineGames and a PC version of Quake 64. It was great news - especially as it was released as a free patch for anyone who owned Quake on Steam.\nHowever, despite being a remaster of a 25-year-old game, the enhanced edition didn't launch without issues. Players reported numerous issues, including control problems such as with gamepads, mods not being compatible with the new version, multiplayer not working correctly, choppy performance - especially on the new expansion, Dimension of the Machine.\nRead the rest of the story...\nRELATED LINKS:\n\nWhat if: Quake gets a Doom Eternal style reboot?\n\nQuake remastered is real, out now, and brings Quake 64 to PC\n\nIt looks like a Quake announcement is coming soon"
    },
    {
      "title": "Quake remaster gets big update expanding bot and mod support",
      "date": "2021-10-08 18:40:19",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/PC Gamer/4069556867209432473",
      "content": "new update for Quake's enhanced version is out, adding in significantly more bot and modding support for the remastered shooter that released in August. Improvements to user control and accessibility measures are also included...\n                Read more."
    },
    {
      "title": "Quake - Update 1",
      "date": "2021-10-07 11:40:18",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4069556867204660148",
      "content": "Update 1 includes improvements to user controls, the addition of bot support to multiple Deathmatch maps, improvements to bot functionality and several notable bug fixes\n\nImprovements\n[hr][/hr]\nControls\n\n Improved analog stick input on controllers – now more responsive by default \n Added deadzone, aim acceleration, exponent and aim smoothing options to tweak gamepad input in the Input Options menu \n\nMap Improvements: Dimension of the Machine\n\n Hell or Dark Water (MGE3M2): added checkpoint spawns in co-op after traps section \n Grave Machine (MGE4M1): added checkpoint spawns in co-op and fixed pain triggers around pentagram \n A Grave Mistake (MGE4M2): added checkpoint spawns in co-op and pain triggers to prevent falling through and skipping them \n\nGeneral Improvements\n\n Save game process is faster on large levels\n Hosts are now identified by an icon instead of a color to make it easier to distinguish for color blind players\n Weapon wheel HUD element is no longer cut off on local multiplayer vertical split-screen\n\nOnline Multiplayer\n\n Removed visible game limit in match browser\n Improved Scourge of Armagon client-side prediction\n\nBots\nAdded bot support for the following levels:\n\n The Slipgate Complex (E1M1)\n Castle of the Damned (E1M2)\n The House of Chthon (E1M7)\n The Elder God Shrine (E4M3)\n Shub-Niggurath's Pit (END)\n The Edge of Oblivion (HIPDM1)\n The Pumping Station (HIP1M1)\n\n\n Improved bot melee attack, swimming and weapon selection behaviors\n Added text dialogues for when bots make kills or get killed\n Improved bot handling of elevators\n Improved bot navigation on The Abandoned Base (DM3)\n\nMisc. Improvements \n\n Added monitor select option\n\nControl Updates:\n\n Added quick save and quick load key binds\n Added default keyboard binds for the Laser Cannon, and Mjolnir in Scourge of Armagon\n\nNote: Users with existing save data may need to bind these manually from the Input Options menu\n[hr][/hr]\nBUG FIXES\n[hr][/hr]\nGameplay\n\n Fixed backward movement speed accidentally being set to walk\n Game speed now correctly resets after using the Weapon Wheel\n Resolved a bug that could result in the player getting stuck when jumping out of the water\n Turning off friendly fire no longer prevents self-damage\n\nAudio\n\n Fixed rare audio crash in Scourge of Armagon\n Resolved issue that caused excessive clipping when multiple sounds play simultaneously\n Resolved an issue in which the wrong audio track was playing during the Scourge of Armagon demo\n Fixed an issue in which Track 11 was playing instead of Track 10 on Gloom Keep (E1M5), The Wizard’s Manse (E2M5), The wind Tunnels (E3M5) and Hell’s Atrium (E4M5)\n\nMaps\n\n The Silver Key no longer shows up in Hell’s Atrium (E4M5) on Deathmatch\n Fixed an issue in which some decals were oriented incorrectly in Scourge of Armagon\n Fixed a lighting bug in The Door to Chthon (E1M6) that caused the darkened path to be lit prematurely\n Darkened lighting on the roof to restore the original visual effect on Shub-Niggurath's Pit (END)\n\nGeneral\n\n Usernames with quotation marks now appear correctly in game\n Spanish episode end slate text is no longer cut off\n Texture smoothing setting restores correctly after deactivating the Quake 64 add-on\n Fixed bug in which enhanced Ogre model would sink into ground plane after death\n\nOnline Multiplayer\n\n Resolved issue when sounds would drop and entities disappear or flicker during online play\n\nBots\n\n Resolved issue where bots would not grab needed pickups\n Bots should now see all triggers and doors as shootable\n Bots no longer linger in slime or lava for too long\n Removed Bot support on maps that lack waypoints\n Fixed issue in which bots tried to re-use single-use buttons and triggers\n\nMisc.\n\n Fixed an issue in which the Max FPS option did not correctly display custom settings in drop down menu\n Disabled GPU culling to improve performance in Dimension of the Machine\n\n[hr][/hr]\nMODDING IMPROVEMENTS\n[hr][/hr]\nThe following changes apply to users who may be developing add-ons that work on the PC version of Quake\n\n Added the pr_checkextension cvar and checkextension (\"QUAKE_EX\") function in QuakeC to detect if the mod is running under the updated Quake client\n Added the cl_nocsqc cvar (it is permanently set to 1 to indicate to modders that CSQC is not supported)\n Removed the -heapsize command line parameter. It is no longer used in favor of a dynamically sized heap\n Added FL_NO_BOTS edict flag (Instructs bots to ignore specified object(s) in QuakeC)\n Added a QuakeC built-in for playing a sound on a client: void localsound( entity client, string sample ) = #80;\n\nAdded the following QuakeC built-in functions for drawing debug shapes on clients (these are intended to help mod authors visually debug logic in 3D space):\n\n void draw_point( vector point, float colormap, float lifetime, float depthtest ) = #81;\n void draw_line( vector start, vector end, float colormap, float lifetime, float depthtest ) = #82;\n void draw_arrow( vector start, vector end, float colormap, float size, float lifetime, float depthtest ) = #83;\n void draw_ray( vector start, vector direction, float length, float colormap, float size, float lifetime, float depthtest ) = #84;\n void draw_circle( vector origin, float radius, float colormap, float lifetime, float depthtest ) = #85;\n void draw_bounds( vector min, vector max, float colormap, float lifetime, float depthtest ) = #86;\n void draw_worldtext( string s, vector origin, float size, float lifetime, float depthtest ) = #87;\n void draw_sphere( vector origin, float radius, float colormap, float lifetime, float depthtest ) = #88;\n void draw_cylinder( vector origin, float halfHeight, float radius, float colormap, float lifetime, float depthtest ) = #89;\n\n\n Added logic that resets AI state to neutral when activating the bot navigation editor\n Added bot nav editor fullbright toggle key bind to F2\n Added \"CheckForFloor\" flag to nav nodes (this can be used for drawbridges, floor traps, etc.)\n Added \"CheckForSolid\" flag to nav nodes (this can be used for crushers, traps, movable walls, etc.)\n Added ability to place nav nodes in shallow lava\n\nAdded the following cvars to change nav editor window positions:\n\n nav_properties_xpos\n nav_properties_ypos\n nav_legend_xpos\n nav_legend_ypos\n\nAdded navEdit_defaultNodeRadius to set preferred default nav node radius\nAdded ability to lock node height in place when moving nodes around\nAdded navEdit_defaultNodeRadius to set preferred default nav node radius\nAdded navEdit_waterLookPointDist to control how far away nodes will be placed in front of player when in water\n[hr][/hr]\nMODDING FIXES\n[hr][/hr]\n\n Fixed an issue in which the save command was appending an \"s\" to the beginning of filenames, resolving auto-save in mods like “Copper”\n Fixed Alpha not being applied to brush models\n Restored original behavior of centerprint, sprint, and bprint built-ins to fix issues with mods expecting arguments to concatenate instead of a string format"
    },
    {
      "title": "Quake | Minor Update Release Notes | September 2",
      "date": "2021-09-02 10:30:51",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4020014099088431299",
      "content": "Multiplayer Update for All Platforms\n\n This minor update fixes an issue that caused multiplayer lobby instability for some users"
    },
    {
      "title": "Release Notes & FAQ",
      "date": "2021-08-19 14:23:49",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/4022264629312099495",
      "content": "Quake – the legendary dark fantasy FPS that revolutionized the genre is now enhanced! This new offering features cross-play, dedicated servers for online deathmatch matchmaking, free optional Add-ons, split-screen support for local deathmatch and co-op, AI opponents in deathmatch and more!\n\nNote: Steam users who already own Quake will automatically receive the new enhanced version with a free download! \n\nRead the FAQ below for details on how to access the enhanced version.\n\n\nRELEASE NOTES\n\n Enhanced Graphics\nBetter lighting, new models, updated maps, and a dynamic shadow system headline the graphical features available in Quake. Individual features of the enhanced graphics can be turned on and off to your preference\n\n Includes Original Expansion Packs\nThe two retail expansion packs, Scourge of Armagon, and Dissolution of Eternity are both now bundled with Quake, and are integrated into the main game. The downloadable expansion pack, Dimension of the Past, has also been upgraded and included\n\n Includes Soundtrack\nThe iconic original soundtrack by Trent Reznor of Nine Inch Nails is now included on all versions for the first time. The soundtracks for Scourge of Armagon, and Dissolution of Eternity are also included when playing those expansion packs\n\n Brand New \"Dimension of the Machine\" Episode\nCreated for Quake's 25th anniversary, Dimension of the Machine is a brand new experience created by the MachineGames team. Continue your fight through brand new dimensions, figure out the secret to restarting the machine, and come face to face with an old foe\n\n Free Optional Add-ons\nSimilar to our re-releases of DOOM (1993) and DOOM II, we will also be periodically releasing free optional Add-ons available to download in the in-game \"Adds-on\" menu. Our first Add-on is Quake 64, which includes the original alternate soundtrack by acclaimed composer Aubrey Hodges\n\n Split-Screen Multiplayer\nQuake includes 4 player split-screen multiplayer on all platforms, in both deathmatch and co-op modes. Fight against your friends, or with your friends in all five campaigns. AI bots are also available to play against in deathmatch mode\n\n Online Multiplayer\nPlay custom matches on player-hosted servers, or hop into matchmaking and play on dedicated servers. Quake also now includes the extra levels Acrophobia, and The Edge available in deathmatch mode. Dimension of the Machine also contains all new deathmatch levels\n\n Cross-Play Multiplayer\nPlay with friends no matter which platform they prefer. Cross-play is available on all platforms, so you can play Quake with everyone\n\n Supported Languages\nEnglish, French, Italian, Spanish, German, Russian\n\nPC SPECS\nMinimum Spec (1080p/60 HZ)\n\n Windows 10\n Intel Core i5-3570 @ 3.4 GHz or AMD Ryzen 3 1300x @ 3.5 GHz\n NVIDIA GeForce GTX 650 TI (2GB) or AMD HD 7750 (1GB)\n 8GB System RAM\n Minimum 2GB free space on hard drive (additional space required for optional Add-ons)\n High speed broadband connection required for online play\n\nRecommended Spec (*4K/120 HZ)\n\n Windows 10\n Intel Core i5-6600k @ 3.5 GHz or AMD Ryzen 5 1600 @ 3.2 GHz\n NVIDIA GeForce GTX 1070 (8GB) or AMD RX Vega 56 (8GB)\n 8GB System RAM\n Minimum 2GB free space on hard drive (additional space required for optional Add-ons)\n High speed broadband connection required for online play\n\n*Compatible display required\n[hr][/hr]\nFAQS\nI bought Quake already, how do I get access to the new release?\nPrevious owners of Quake on Steam will automatically receive the new version with a free download. It may already be updated by the time you read this! Additionally, if you didn't own Scourge of Armagon and Dissolution of Eternity on Steam, you will also be granted access to the original versions of those in-game\n\nHow do I access the original versions of the game on Steam?\nSteam: Launch options are available to launch the original versions of the games, and the original files are still on disk in the same place\n\nHow do I play with friends on other platforms via cross-play?\nThe easiest way to join a cross-play match with friends is using the room code system. The room code is a 4 letter code that can be seen inside the pre-game lobby. Send this to your friends over text message, Discord, or yelling very loudly, and they'll be able to join through the multiplayer menu without having to search through the match browser or enter passwords. Note that on some platforms, cross-play can be disabled at the system level. If you have problems joining cross-play matches, ensure that this is enabled\n\nIf I already own Quake on Steam, will my saves carry over?\nExisting save games do not carry over from the original to the enhanced versions of Quake and Steam and Bethesda Launcher. You can continue to use original Quake save games by launching the original version of the game on both platforms\n\nWill I need a Bethesda.net account to play the game?\nA Bethesda.net account is required for online multiplayer, and Add-ons. Everything else in the game is playable without linking your account\n\nWhat are the resolutions and framerates for PC?\nPC: Maximum supported by video card/display\n\nWhat input devices are supported on PC?\nOn the PC, mouse and keyboard and most controllers should work. Split-screen is available with mixed mouse/keyboard and controller\n\nDo I need an always online connection to play the game?\nQuake can be played offline. Currently, official Add-ons require an internet connection to play even if previously downloaded, however we hope to address this in a future update\n\nAre existing mods supported on PC?\nThe PC enhanced version will load any mod that the original version supported (when existing mods have been placed in the game install directory). However it will not support some mods that require a new/different source port from the original game\n\nNote: We did raise some engine limits from the original version in our new enhanced version but cannot confirm compatibility with all modern Quake mods\n\nCould Not Join Lobby' error on when trying to join Multiplayer?\nThis error occurs on all platforms when you're system clock is out of sync. Please consult you system manual for how to re-sync your system clock. \n[hr][/hr]\nKNOWN ISSUES\n\n In local multiplayer, the weapon wheel will be partially cut off in vertical split screen. This does not occur in horizontal split screen\n If the player uses the Attack input to respawn in multiplayer, they will fire a shot as they respawn\n Users are unable to access downloaded Add-ons without being connected to the internet. This is not intended functionality and will be fixed in a future update\n While in local multiplayer, if you wish to remove players from the lobby, you need to back out of the local multiplayer menu and re-enter it\n Some player movement issues may occur in online co-op matches in Scourge of Armagon\n The Guardian death sounds in may repeat indefinitely in Scourge of Armagon. If this occurs, either save and load your progress or exit the level\n Players switching away from Quake by using ALT+TAB, may notice that they lose control over the cursor. If this occurs, simply return to Quake, and interact with the game to restore control"
    },
    {
      "title": "New Quake project hinted at again as Quake on Steam gets beta branch update",
      "date": "2021-08-19 06:30:19",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/4022264629310920066",
      "content": "It looks like owners of the original Quake game on Steam may be in for a big surprise as QuakeCon 2021 draws ever closer.The SteamDB tracker, which gives users an insight into the mysterious goings-on on the Steam storefront's backend, has picked up two updates to the original Quake game on Steam.According to the history that's being logged by the tracker, a new beta branch has been added to the game, as well as a new 64-bit executable. What could that mean? It could mean that we're getting some sort of ray-tracing update to the original game (simiarly to what we've seen with Quake 2, previously) or it could mean that we're getting a teaser for a whole new Quake project, too. Read more"
    }
  ]
}