{
  "appId": "2500",
  "count": 5,
  "notes": [
    {
      "title": "Boreal Blade Announced!",
      "date": "2019-08-28 09:56:32",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/2415540140452791656",
      "content": "https://steamcdn-a.akamaihd.net/steamcommunity/public/images/clans/32975759/0ba0ddfc9b18acac16961e611ee300118f064555.jpg\r\n\r\nYou probably are unaware of it, but there has been a small team of Frozenbyteans making a game about sword fighting in all secrecy. We’ve been developing, testing, designing and perfecting this game for quite some time now. So let us introduce you to Boreal Blade, a team-based melee fighting game with a focus on PvP combat that combines reactionary and tactical gameplay, and allows you to alternate attacks and to develop a unique fighting style.\r\n\r\nhttps://youtu.be/5SmZqbvZlb0\r\nSteam Beta\r\nBoreal Blade will be making its way to PC during 2019, but all interested players are welcome to join the Steam beta which is available now! Just head to the official Boreal Blade Discord to request a key. On Discord you can also give feedback to the devs, discuss about the game and look for fellow warriors to battle with. And remember that you can also wishlish the game on Steam while waiting for the release. \r\n\r\nhttps://steamcdn-a.akamaihd.net/steamcommunity/public/images/clans/32975759/e4bb8cd55f814a131ad7deb2c9d835b605ad150d.png\r\n\r\nAbout Boreal Blade\r\n\r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/extras/600px.gif?t=1566826417\r\n\r\nThey have a saying in Norvalg: Fight for a cause worth dying for.\r\n\r\nA noble sentiment, but what happens when almost every cause is good enough to die for? Whenever a decision needs to be made – whether it is about heading to war or determining where the cheese should go in a sandwich – fierce Norvalgian warriors gather in their famous debating arenas, pray for strength from their gods and fight until the truth is uncovered. Are you ready to join the battle?\r\n \r\nBoreal Blade is a team-based melee fighting game with a focus on player vs player combat and gameplay consisting of both reactive and proactive elements. The game features various weapon types and three distinctive fighting styles, allowing players to choose between two-handed weapons, a shield and a weapon combo, or long thrusting weapons like spears and pikes. Three armour classes with their strengths and weaknesses are also included to guarantee a varied, everchanging fighting experience.\r\n \r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/ss_7125a860b535127a60753b55abd691ea1fa9a0bf.1920x1080.jpg?t=1566826417\r\n\r\nBoreal Blade strikes an excellent balance between realism and gameplay. The game turns away from the rock-paper-scissors approach where weapons and shields matter only when the player presses the corresponding button to use them for attacking or blocking. Actually, there is no block button at all, but the passive blocking featured in the game allows players to block attacks by simply positioning themselves wisely and timing their attacks with care. Pre-determined attack key combinations and complex counter moves have been abandoned in favour of the beautiful simplicity of only a single attack button - and hundreds of ways to variate every attack. Players can move their weapon and character around freely, turning an attack into a block - and back to another attack just in a blink of an eye. Strikes and blocks meld into a seamless continuity. Weapon movement feels very natural, allowing players to create and modify their signature moves and distinctive fighting styles. More seasoned warriors can spice up their game with dodges, sprints, blocks, powered attacks, feint attacks and weapon throws to confuse opponents and make the battle more unpredictable and exciting.\r\n \r\nBoreal Blade gives competitive players the chance to hone their prediction of attacks, counter-attacks, timing and the use of different stances to defeat their enemies on the battlefield and to hack them into pieces!\r\n\r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/ss_b5d655557688dde67c8a6d51e2a2d91b740e0786.1920x1080.jpg?t=1566826417\r\n\r\nKey Features\r\n\r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/extras/bb_steam_title_gameplay.png?t=1566826417\r\nReactionary and tactical gameplay\r\n\r\nComplete freedom of attack and block direction performed with simple controls, allowing players to concentrate on their battle tactics and series of manoeuvres and to control the flow of the battle.\r\nThere are hundreds of ways to variate attacks and players have complete freedom to move the weapon and character around, encouraging them to experiment and find the fighting style that suits them best.\r\n\r\nhttps://steamcdn-a.akamaihd.net/steam/apps/598780/extras/bb_steam_title_game_modes.png?t=1566994382\r\nFour multiplayer game modes\r\n\r\nPlayers can charge into combat together with their clan mate warriors in Team Deathmatch and Boreal Battle modes where two teams go up against each other.\r\nBoreal Claim mode consists of two teams who take turns attacking or defending a banner against the other team.\r\nIn Deathmatch it is everyone for themselves – the first warrior to get 20 kills wins the match!\r\n\r\nhttps://steamcdn-a.akamaihd.net/steam/apps/598780/extras/bb_steam_title_fighting_styles.png?t=1566994382\r\nFour different fighting styles\r\n\r\nHundreds of weapons, shields, pieces of armour and battle items for developing customized fighting styles and battle tactics.\r\n\r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/extras/bb_steam_title_character_creation.png?t=1566826417\r\nDetailed character creation and game world\r\n\r\nCreate your warrior and choose their equipment, accessories and weapons and customize their appearance with jewellery, facial hair and armour dyes.\r\nExplore the different fighting arenas across the Nordic mythology inspired, paintinglike Norvalg.\r\n\r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/ss_68c7525241fa580914dca5cf8cf26146793eba3e.1920x1080.jpg?t=1566826417\r\n\r\nThe game was also released today on Nintendo eShop for Nintendo Switch. There is a free demo version and full game available for all aspiring warriors. Both the demo and the full game are compatible, allowing players of both versions play together!\r\n\r\nhttps://store.steampowered.com/app/598780/Boreal_Blade/\r\nJoin the mailing list at https://www.borealblade.com to make sure you never miss an update! And remember that you can join the Steam Beta and discussion at Discord.\r\n\r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/ss_e08bdb10fe49e786c1ed13d1ba9d5a176c326f5a.1920x1080.jpg?t=1566826417"
    },
    {
      "title": "Frozenbyte 15th Anniversary and Update to Shadwen!",
      "date": "2016-08-09 13:20:41",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/3819571572126365252",
      "content": "http://i.imgur.com/PmJO07R.jpg\r\n\r\nTo celebrate our 15th anniversary we are having our games on sale and added an update to Shadwen! \r\n\r\nThe update, called Escape from the Castle, adds 14 re-worked levels to Shadwen for free to all platforms: Windows, Linux and Mac. You can read more from our blog or go to Shadwen's Steam page from here.\r\n\r\nDon't forget to take advance of the bundle prices for example with Frozenbyte Collection. Its price adjusts if you already own some of the games!\r\n\r\nWe also made a video to show our progress from our first game, Shadowgrounds to Shadwen. You can find it below.\r\n\r\nhttps://www.youtube.com/watch?v=KmZ9OTmBLjQ\r\n\r\nThank you all for supporting us for so long! :)\r\n\r\nhttp://i.imgur.com/vNEibtO.jpg"
    },
    {
      "title": "Frozenbyte 15th Anniversary and Update to Shadwen!",
      "date": "2016-08-09 13:20:41",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/252584970548764947",
      "content": "http://i.imgur.com/PmJO07R.jpg\r\n\r\nTo celebrate our 15th anniversary we are having our games on sale and added an update to Shadwen! \r\n\r\nThe update, called Escape from the Castle, adds 14 re-worked levels to Shadwen for free to all platforms: Windows, Linux and Mac. You can read more from our blog or go to Shadwen's Steam page from here.\r\n\r\nDon't forget to take advance of the bundle prices for example with Frozenbyte Collection. Its price adjusts if you already own some of the games!\r\n\r\nWe also made a video to show our progress from our first game, Shadowgrounds to Shadwen. You can find it below.\r\n\r\nhttps://www.youtube.com/watch?v=KmZ9OTmBLjQ\r\n\r\nThank you all for supporting us for so long! :)\r\n\r\nhttp://i.imgur.com/vNEibtO.jpg"
    },
    {
      "title": "Frozenbyte Christmas Calendar 2015!",
      "date": "2015-12-09 06:23:48",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/377538283353793967",
      "content": "Chance to win free Frozenbyte games each day!\r\n\r\nhttp://i.imgur.com/NfzZNiA.jpg\r\n\r\nTo celebrate the upcoming holidays, we wanted to do a Christmas Calendar for you this year.\r\n\r\nWe'll post pics and give away game codes for our games each day until 24th December for some lucky winners - so if you don't have all our games yet or you have friends you think might enjoy them, check our blog for more info!\r\n\r\nHOW TO PARTICIPATE:\r\n\r\nYou can participate on any of our social media channels (links below) - detailed rules always on our blog (first link). If you participate on all of them, your chances to win are higher. :)\r\n\r\n\r\nFrozenbyte Blog (Christmas Calendar)\r\n@Frozenbyte on Twitter\r\n@ShadwenGame on Twitter\r\nFrozenbyte Games on Facebook\r\nShadwen on Facebook\r\n@FrozenbyteGames on Instagram\r\nfrozenbytegames on Snapchat\r\n\r\n\r\nHappy upcoming holidays! :)"
    },
    {
      "title": "Frozenbyte Christmas Calendar 2015!",
      "date": "2015-12-09 06:23:48",
      "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/3819571572126365310",
      "content": "Chance to win free Frozenbyte games each day!\r\n\r\nhttp://i.imgur.com/NfzZNiA.jpg\r\n\r\nTo celebrate the upcoming holidays, we wanted to do a Christmas Calendar for you this year.\r\n\r\nWe'll post pics and give away game codes for our games each day until 24th December for some lucky winners - so if you don't have all our games yet or you have friends you think might enjoy them, check our blog for more info!\r\n\r\nHOW TO PARTICIPATE:\r\n\r\nYou can participate on any of our social media channels (links below) - detailed rules always on our blog (first link). If you participate on all of them, your chances to win are higher. :)\r\n\r\n\r\nFrozenbyte Blog (Christmas Calendar)\r\n@Frozenbyte on Twitter\r\n@ShadwenGame on Twitter\r\nFrozenbyte Games on Facebook\r\nShadwen on Facebook\r\n@FrozenbyteGames on Instagram\r\nfrozenbytegames on Snapchat\r\n\r\n\r\nHappy upcoming holidays! :)"
    }
  ]
}