[
    {
        "cluster_id": "C001",
        "name": "System Compatibility",
        "description": "Patch notes detailing fixes and known issues related to operating system compatibility, graphics drivers, hardware-specific problems, third-party software conflicts, general system stability, and core technical infrastructure improvements.",
        "single_notes": [
            {
                "app_id": "1500",
                "title": "Darwinia 2.3.3-45 hotfix",
                "content": "This update contains a major bugfix for the 2.3.3 release.\n\nMajor changes:\n\n Fixed broken music playback.\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. This is caused by the \"Direct-to-Display\" feature in Metal, which cannot be opted out of. We have implemented a partial workaround to this problem, but there is still occasional render stuttering. Players can work around this by running the game in Windowed mode, or by running an application that keeps a hidden always-on-top window running (such as Notchmeister). We have an open bug with Apple about this problem and will continue to look for a better solution. \n Windows: Some applications (e.g. ReShade, Bandicam, Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are simply installed but not running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Older graphics drivers may be less reliable and cause crashes. Please update your drivers from your card/chipset vendor's website."
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.3.3-40 hotfix",
                "content": "This update contains significant fixes and enhancements since the 2.3.3 release.\n\nMajor changes:\n\n Fixed crashes on macOS versions older than 14.0.\n Fixed a crash when closing certain level editor and options windows.\n Fixed some prediction bugs causing incorrect rendering of lasers and other weapons.\n Fixed calculation of spirits-per-minute on the Receiver map, and reduced spirits-per-minute goal to 50.\n Fixed a possible crash when generating the language table.\n Enable missing SDL feature required for Playstation DualSense controller support.\n\n\nMinor changes:\n\n Fixed incorrect scaling when using borderless fullscreen and a non-default resolution.\n Fixed an unnecessary render pass break when \"full\" pixel effect is enabled.\n Updated game controller database.\n Updated contributing libraries.\n\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. This is caused by the \"Direct-to-Display\" feature in Metal, which cannot be opted out of. We have implemented a partial workaround to this problem, but there is still occasional render stuttering. Players can work around this by running the game in Windowed mode, or by running an application that keeps a hidden always-on-top window running (such as Notchmeister). We have an open bug with Apple about this problem and will continue to look for a better solution. \n Windows: Some applications (e.g. ReShade, Bandicam, Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are simply installed but not running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Older graphics drivers may be less reliable and cause crashes. Please update your drivers from your card/chipset vendor's website."
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.3.3 release",
                "content": "This update contains significant fixes and enhancements since the 2.3.2 release.\n\nMajor changes:\n\n The Vulkan renderer now requires a minimum of Vulkan 1.1. If your driver does not support Vulkan 1.1, it will try to use other renderers available on your platform.\n Fixed a crash on NVIDIA GPUs when running on recent graphics driver versions. NVIDIA's driver is one of the few to actually implement VK_SWAPCHAIN_CREATE_DEFERRED_MEMORY_ALLOCATION_BIT_EXT, and it interferes with older Vulkan layers (Steam overlay, MangoHUD) that were not designed with that behavior in mind.\n Fixed a crash when handling unexpected keyboard inputs.\n Fixed a very long-standing bug (probably since the original Darwinia release!) around world time handling. In a simplified explanation, the world expects to update at 100Hz, but it was actually updating at 90Hz. This caused numerous graphical glitches and strange behavior such as rubber-banding effects.\n Fixed crash when loading shape files with incorrect triangle counts (e.g. from mods).\n AntHills are now more dangerous. They were incorrectly not updating their objectives, so ants would repeatedly go back and forth between the same locations instead of changing targets to attack or pick up spirits.\n Implemented support for SMAA S2x (MSAA 2x + SMAA).\n Save games for mods are now stored in mod-specific subdirectories. This prevents accidentally loading a save game which does not match the loaded mod. Additionally, it is now possible to have multiple user profiles on a per-mod basis. Unfortunately, existing mod save folders must be moved to the new location by hand. For example, if your mod save game is currently named \"users/ModName\", you should move it to \"modusers/ModName/ModName\".\n Numerous performance and memory usage improvements across the board.\n\nMinor changes:\n\n Game controller detection was not behaving properly, causing the game controller help tips interface to flicker frequently.\n Fixed a minor UI glitch on the Steam Deck in the \"Reset Location\" dialog.\n Reduced Virii entity memory usage by half.\n Flag icons are now much higher resolution.\n Improved startup time on Windows by disabling some SDL features we didn't need.\n Shape explosions now preserve entity velocity.\n Updated contributing libraries.\n\nCompatibility:\n\n Improved compatibility of the ANGLE Direct3D 11 renderer with older graphics chipsets that support less than FL11_1.\n Now supports Mesa's GL-on-12 and Dozen (Vulkan on D3D12) renderers, if installed.\n Improved handling of DXVK for ANGLE D3D11.\n Fixed wildly incorrect rendering on the Haswell-based 2014 Intel Mac Mini.\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. This is caused by the \"Direct-to-Display\" feature in Metal, which cannot be opted out of. We have implemented a partial workaround to this problem, but there is still occasional render stuttering. Players can work around this by running the game in Windowed mode, or by running an application that keeps a hidden always-on-top window running (such as Notchmeister). We have an open bug with Apple about this problem and will continue to look for a better solution. \n Windows: Some applications (e.g. ReShade, Bandicam, Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are simply installed but not running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Older graphics drivers may be less reliable and cause crashes. Please update your drivers from your card/chipset vendor's website."
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.3.2 release",
                "content": "This update contains fixes and enhancements since the 2.3.1 release.\n\nMajor changes:\n\n Added a native OpenGL ES rendering backend.\n Fixed a crash triggered by entering/leaving levels several times.\n Fixed a bug where radar dishes would forget how to rotate if the renderer was restarted (e.g. if the Screen settings were changed while in a level).\n Fixed a bug where cutscenes did not correctly preserve the world state, and could cause some buildings to change team ownership. (e.g. on Temple, the Spam cubes could be assigned the wrong team and be attacked by the red Darwinians)\n Now supports a new NVIDIA driver feature, the DXGI present path for Vulkan/OpenGL. Should greatly improve frame smoothness and eliminate stutters.\n Reduced stutter caused by one-off long frames.\n Reworked some of the water avoidance behavior. There were some bugs in how the water avoidance decisions were made, which caused Darwinians to sometimes become confused and just stand still after leaving water.\n When Darwinians or Squads are in water, instead of dying immediately after 10 consecutive seconds, they start to take damage over time.\n Fixed a bug where Darwinians would clip through the landscape when coming out of water, and then suddenly pop up above ground after several seconds.\n Fixed the floating-on-water animation to update every frame instead of every game tick.\n Worked around a bug in NVIDIA drivers older than 530, which caused some rendering glitches with VK_EXT_graphics_pipeline_library.\n Fixed some cases where AMD FSR 1.0 shaders would not compile correctly when targeting AMD GPUs.\n\nMinor changes:\n\n Introduced timed expiration for cached pipelines and shaders.\n Fixed a failure to initialize OpenGL core renderer on Zink.\n Fixed a bug in the mouse cursor render using 16-bit float RGBA framebuffers.\n Fixed targeting reticles being shown for units behind the camera.\n Minimized clipping of game cursor below the landscape.\n Fixed input handling bugs when running at very low framerates.\n Many code cleanups to modernize the code base a bit.\n Tuned thread priorities for audio and worker threads.\n Improved performance of MiniAudio mixing.\n Several minor performance improvements.\n Updated contributing libraries (MoltenVK, ANGLE, SDL, MiniAudio, etc)\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. This is caused by the \"Direct-to-Display\" feature in Metal, which cannot be opted out of. We have implemented a partial workaround to this problem, but there is still occasional render stuttering. Players can work around this by running the game in Windowed mode. We have an open bug with Apple about this problem and will continue to look for a better solution. You can work around this by running an application that keeps a hidden always-on-top window running (such as the gag app Notchmeister).\n Windows: Some applications (e.g. ReShade, Bandicam, Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are installed but not actually running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Windows: You may experience crashes on Intel graphics drivers with the Vulkan renderer. The cause of these crashes isn't known yet.\n Windows: There is a bug in the AMD graphics drivers that causes the Vulkan extension VK_EXT_full_screen_exclusive to be enabled in \"application controlled\" mode when not requested. This causes unexpected Vulkan error codes to be reported when alt-tabbing out of full screen mode. AMD fixed this issue in driver version 23.5.2."
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.3.1 release",
                "content": "This update contains fixes and enhancements since the 2.3.0-25 release.\n\nMajor changes:\n\n Armour will now try to avoid collisions with buildings, and will not allow deploying gun turrets too close to other buildings.\n Gun turrets were incorrectly accounting for Darwinians, which caused only two of the four ports to be required to operate them.\n Some mods do not specify any lights in their level files, which causes the landscape and shapes to render as empty black space. We now specify a default lighting configuration if no lights are defined in the level file. This should make such levels at least playable, but they may not appear as the mod developer intended.\n Greatly improved game controller experience, now using much different thumbstick and trigger axis scaling methods. This was tested with an Xbox Elite controller, but it should improve the experience on any controller, including the Steam Deck.\n Mods with custom shapes, textures, and sounds should no longer require restarting the game to load correctly.\n Improved sound spatialization accuracy while the camera is moving, and improved sound playback performance.\n Partially worked around stuttering on macOS with high refresh rate displays. It's recommended to use the \"Automatic\" Resolution setting in Screen preferences for this workaround to take effect. Some stuttering may still be observed, see the \"Known Issues\" section below for details.\n Fixed major lighting render bugs on the Metal renderer.\n Many Screen preferences can now be applied without a full renderer restart.\n\nMinor changes:\n\n The in-game screenshot functionality performance has been improved.\n Reduced GPU memory for shape vertex data.\n Dramatically improved performance of \"Full\" Pixel Effect render for grenade/rocket explosions.\n Reduced the sort of jerky animation appearance for falling snow and Receiver spirits.\n Fixed glitched tree render and sounds when Christmas mode is enabled.\n Made falling snow fade out gradually when close to the ground.\n Fixed a localization bug in the intro cutscene for the Escort map.\n Fixed a bug where players could accidentally select units while trying to aim a radar dish or turret.\n Triffid eggs now respect SpawnPopulationLocks if present.\n Fixed some significant first-frame latency in the loader intros.\n Fixed shader pre-compilation missing some shader combinations.\n Fixed a bug with the level editor UI, which caused the increase/decrease buttons to operate on a delay instead of responding instantly and then *repeating* on a delay.\n Fixed several level editor render bugs when switching tool modes.\n Fixed some cases where Virii death animations would glitch in a strange way, especially if killed by rocket or grenade shockwaves.\n Fixed water occluding enemies that traveled out below water level (e.g. spiders or virii).\n Fixed solar panels glitching on rotate in the level editor (they're not supposed to be able to rotate).\n Fixed a bug with radar dish rotation, where rotating laterally in one direction was always faster than rotating in the other.\n Fixed some Darwinian shadow rendering behavior.\n Fixed some minor glitches in the gun turret render, causing them to appear to twitch when idle.\n User profile names can no longer be completely blank and crash the game.\n The sound system now avoids doing resampling when possible, conserving CPU utilization.\n Several level editor bugs around StaticShape buildings have been fixed.\n Shape hit tests were incorrectly accounting for scaling, causing mouse clicks to incorrectly miss some shapes in the level editor.\n Improved shader compilation speed, and improved caching robustness.\n Improved Vulkan frame pacing mechanism, to ensure lower latency rendering.\n Updated contributing libraries (MoltenVK, ANGLE, SDL, MiniAudio, etc)\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. This is caused by the \"Direct-to-Display\" feature in Metal, which cannot be opted out of. We have implemented a partial workaround to this problem, but there is still occasional render stuttering. Players can work around this by running the game in Windowed mode. We have an open bug with Apple about this problem and will continue to look for a better solution.\n Windows: Some applications (e.g. Bandicam, Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are installed but not actually running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Windows: You may experience crashes on Intel graphics drivers with the Vulkan renderer. The cause of these crashes isn't known yet.\n Windows: The Vulkan renderer may appear to stutter when running in windowed mode on NVIDIA graphics cards. NVIDIA is investigating this problem.\n Windows: There is a bug in the AMD graphics drivers that causes the Vulkan extension VK_EXT_full_screen_exclusive to be enabled in \"application controlled\" mode when not requested. This causes unexpected Vulkan error codes to be reported when alt-tabbing out of full screen mode. AMD is aware of the issue and is working on a fix.\n Windows: The Direct3D 11 shader compiler will sometimes fail with \"integer overflow\" errors which will cause the game to crash and exit during shader precompilation. Re-running the game won't reproduce the errors."
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.3.0-25 hotfix release",
                "content": "This update contains some urgent fixes for bugs introduced in the 2.3.0 release.\n\nMajor changes:\n\n FIxed a heap corruption bug that was causing numerous other difficult-to-analyze failures.\n Fixed a crash caused by changing input bindings.\n Windows: Fixed a possible crash in the sound system when changing the output device in Windows sound settings.\n\nMinor changes:\n\n Fixed some gesture input rendering bugs, and increased the visual resolution of drawn gestures.\n Fixed a jarring camera jump when leaving the Gestures task manager view.\n Fixed the initial Officer vertical spawn position to always be at the landscape level.\n Fixed the behavior for the \"Chat Log\" input binding.\n Fixed the behavior of the \"Restore Defaults\" button in the input binding settings window.\n Improved texture quality of mouse cursors and landscape wireframe.\n Updated contributing libraries (SDL, MiniAudio, etc).\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. I have not found a programmatic workaround to this problem, as it relates to the \"Direct-to-Display\" feature in Metal which cannot be opted out of. Players can work around this by running the game in Windowed mode, or by using a fixed <= 60Hz refresh rate in the system's Display preferences. We have an open bug with Apple about this problem and will continue to look for a better solution.\n Windows: Some applications (e.g. Bandicam, Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are installed but not actually running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Windows: You may experience crashes on Intel graphics drivers. The cause of these crashes isn't known yet.\n Windows: The Vulkan renderer may appear to stutter when running in windowed mode on NVIDIA graphics cards. NVIDIA is investigating this problem.\n Windows: There is a bug in the AMD graphics drivers that causes the Vulkan extension VK_EXT_full_screen_exclusive to be enabled in \"application controlled\" mode when not requested. This causes unexpected Vulkan error codes to be reported when alt-tabbing out of full screen mode. There is a workaround in this release to deal with the driver bug, but it is strongly recommended that users upgrade to AMD graphics driver version 22.10.3 or later, which has the fix for this issue."
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.2.0-296 hotfix release",
                "content": "Changes since 2.2.0-292:\n\n\n macOS: Fix landscape render on Vulkan (MoltenVK) backend.\n Removed some unused and buggy features in the shader preprocessing code.\n Updated ANGLE and MoltenVK."
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.2.0-292 bugfix release",
                "content": "Changes since 2.2.0-169:\n\n\n Vulkan: when vsync is disabled, Darwinia will use the \"mailbox\" present mode if available. This presentation mode does not block on vsync but also does not have tearing. You will very likely want to enable the FPS limit option to keep CPU/GPU utilization reasonable.\n Vulkan: improved frame latency\n macOS: improved color profile on Metal/Vulkan renderers, to match the macOS-default OpenGL Core color profile\n Map editor: fixed a crash in the landscape editor when cloning a land tile\n Virii: increased follow distance limit\n Camera: fix incorrect FOV during cutscenes\n Re-enable persistent mapped buffers for better performance. Previously this was disabled because of rendering glitches where the wrong meshes were rendered for some objects. I think I've ironed these problems out and it should now work better.\n Fixed some miscellaneous rare crashes\n Darwinia now automatically prefers using discrete GPUs on systems with both integrated and discrete graphics (e.g. Optimus).\n Multiple memory layout and performance optimizations\n ANGLE, SDL, and other contributing libraries updated. There have been numerous improvements in ANGLE since the last release build which may contribute to improved performance."
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.2.0-169 bugfix release",
                "content": "Changes since 2.2.0-138:\n\n Armour units will now prioritize movement orders over collision avoidance\n Armour units will no longer sometimes fly into orbit when reaching their destination\n Spider animation fixes\n Fixed a possible level editor crash when editing the landscape\n Fixed an incompatibility with systems using a Colemak keyboard layout\n Implemented a new Field of View option in Graphics settings\n Implemented a new FPS Limit option in Screen settings, to allow running with vsync disabled and a capped framerate\n Implemented a new Variable Rate Shading option in Graphics settings. This feature is experimental and is disabled by default. It requires the Vulkan renderer and driver support for VK_KHR_fragment_shading_rate with support for pipeline fragment shading rate control. This feature can improve performance for rendering meshes that don't need precise per-pixel shading.\n Updated ANGLE and other contributing libraries"
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.2.0-138 bugfix release",
                "content": "Game fixes:\n\n Armour collision is now more reasonable, and armour units should now follow orders immediately even when doing collision avoidance.\n Failure to resume audio after alt-tabbing back into the game is no longer fatal. When this occurs, the sound system will attempt to restart instead.\n The gesture input render now looks as intended (more blocky)\n User profile names are checked at creation time for valid characters and known reserved file names (e.g. Windows does not allow file or folder names to be \"con\", \"aux\", \"com0\", etc.)\n\n\nLevel editor fixes:\n\n Input fields referring to unsigned bytes (e.g. RGB color values in the level editor) are now clamped properly\n Linking buildings that are not meant to be linked could cause crashes. Several of these have been found and fixed.\n Cloned trees were not being rendered correctly due to incorrect visibility calculations. This may also fix other buildings that relied on recalculating render details after having their position assigned.\n The landscape guide grid window could crash the game in some circumstances."
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.2.0-100 hotfix",
                "content": "Changes:\n\n Static vertex buffer uploads now work without fallbacks, even on Vulkan devices with weird heap layouts. Huge thanks to the ANGLE developers for finding a solution. A user on the forums tested it and it solved the problem on their machine."
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.2.0-97 hotfix",
                "content": "Fix for buffer upload failures in ANGLE with GL_STATIC_DRAW on Vulkan devices with unusual heap layouts\n Fix for OpenGL shader compilation on older GPU drivers which don't understand precision qualifiers for anything other than float/int types\n Update SDL game controller database\n Minor localization fixes"
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.2.0-83 hotfix",
                "content": "Changes:\n\n Fix crash caused by unusual Vulkan memory heap layouts on some devices. ANGLE was requiring memory types that have both the DEVICE_LOCAL and HOST_VISIBLE flags, but some uncommon devices only have very small heaps with those properties. This caused the Vulkan renderer to exhaust the small heap and fail to upload any buffers after that point.\n Fix possible crash when entering a location"
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.2.0-77 hotfix",
                "content": "Changes:\n\n Fix possible hangs in the Vulkan renderer on the Windows NVIDIA driver\n Update ANGLE version"
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.2.0-75 hotfix",
                "content": "Changes:\n\n Fix an incompatibility with some Intel graphics drivers causing shader compile failures on the OpenGL Core renderer\n Fix for crash when a user profile has an all-numeric name\n Fix for draw buffer state handling bug\n\n\nKnown issues:\n\n On Windows systems using AMD graphics with the Vulkan renderer, the game may crash on alt-tab or video mode changes. This is because the AMD graphics driver enables the VK_EXT_full_screen_exclusive extension implicitly, and ANGLE doesn't know how to handle it. This can be worked around by either using Fullscreen Borderless in Screen options, or by using a different Renderer backend (OpenGL Core, Direct3D 11)."
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.2.0-69 hotfix",
                "content": "Fix issue where ZX Spectrum loader freezes the renderer\n Fix a possible crash loading certain mods or save games\n Possible fix for glitching pixel effect shapes\n Minor tonemapping changes"
            },
            {
                "app_id": "1500",
                "title": "Darwinia 2.2.0-64 hotfix",
                "content": "Fixed several bugs caused by running the game on Windows in a non-English locale.\n\nNote that save games from previous builds may have been corrupted by the locale encoding issues. If you are having trouble with your save game not loading, you may need to create a new user profile in-game.\n\nTo do this, from the main menu:\n\n Click \"Profile\"\n Click \"Create New Profile\"\n Click the \"Name\" field and give your profile a name\n Click \"Create\"\n Close the menus"
            },
            {
                "app_id": "2280",
                "title": "Minor Update 2 for DOOM + DOOM II",
                "content": "This minor update fixes a memory leak when minimizing the game window on PC in DOOM + DOOM II."
            },
            {
                "app_id": "2280",
                "title": "Minor Update for DOOM + DOOM II",
                "content": "This minor update makes improvements to how clients communicate with the backend in DOOM + DOOM II."
            },
            {
                "app_id": "2280",
                "title": "Mouse Fix Update Released",
                "content": "A small update has been released for our modern DOOM and DOOM II ports today. The only change is a fix for FPS dependent mouse sensitivity. Your sensitivity will feel different for the same slider value compared to before, however it will now feel more consistent, especially at higher framerates when vertical sync is disabled."
            }
        ]
    },
    {
        "cluster_id": "C002",
        "name": "Level Editor Fixes",
        "description": "Patch notes dedicated to fixing bugs, crashes, and improving functionality within the game's level or map editor.",
        "single_notes": [
            {
                "app_id": "1500",
                "title": "Darwinia 2.2.0-107 hotfix",
                "content": "A bunch of level editor fixes in this one.\n\nFixed bugs:\n\n Leaving the level editor with the \"flatten area\" window open could crash the game\n Moving a landscape flatten area in the level editor would not automatically regenerate the landscape mesh\n If no lights were defined for a level (e.g. unfinished maps in mods or similar) the game could crash on entering the level\n The circle around SafeArea buildings was not rendering correctly in the level editor."
            }
        ]
    },
    {
        "cluster_id": "C003",
        "name": "Engine Rework",
        "description": "Patch notes describing significant overhauls or rewrites of core game engines, graphics, or audio systems to support modern hardware, APIs, and improve overall performance and features. This includes major platform compatibility additions.",
        "single_notes": [
            {
                "app_id": "1500",
                "title": "Darwinia 2.3.0 release",
                "content": "There have been several changes since the previous release, v2.2.0-296.\n\nMajor changes:\n\n Vulkan/Metal: Multi-sampling Antialiasing (MSAA) performance is dramatically improved on some systems. When supported, we now use Multisampled Render To Texture (MSRTT) instead of a render followed by an explicit blit to resolve. This benefits tile-based rendering GPUs especially (e.g. Apple M1/M2, etc), since Vulkan and Metal can both use very fast temporary “memoryless” textures for the multisampled color and depth buffers.\n Vulkan/Metal: Apple GPUs can now use lossless compression for textures and framebuffers, which dramatically reduces memory bandwidth and improves performance.\n Vulkan: AMD GPUs can now use lossless compression for textures and framebuffers (DCC, or “Delta Color Compression”), which improves performance.\n Vulkan/Metal/Direct3D: On systems with multiple distinct GPUs (e.g. laptops with integrated graphics + discrete GPU, or with external GPUs), you can now select which device you want to render on in the Screen preferences.\n Vulkan/Metal: Fixed some awful-looking incorrect shading results around the edges of primitives affected by lighting. There seems to be either a shader compiler or hardware bug causing this, but we have worked around the problem by setting a [[sample_mask]] output in the Metal shader (even when multisampling is off). Unfortunately, this same bug is still present in Apple's built-in OpenGL-on-Metal implementation, and a workaround is impossible there since we have no influence on the generated Metal Shading Language code. It's strongly recommended to only use the Vulkan/Metal renderers on macOS.\n OpenGL: Fixed a bug where glTexStorage* calls were incorrectly being used on OpenGL 3.3-compatible systems which did not have the GL_ARB_texture_storage extension.\n Direct3D: Enabled support for DirectComposition, to allow using the D3D \"Flip\" model.\n SMAA/FXAA: Fix sampler bugs on some systems, which resulted in a completely black screen when either of these antialiasing methods were enabled.\n Sound: Fixed some significant channel mapping bugs if using fewer channels than the device supports (e.g. 2-channel on 7.1-channel hardware)\n Renderer: Shaders are now pre-compiled on startup, which should eliminate a lot of random frame hitches.\n Renderer: Textures are now pre-loaded on startup, which may eliminate frame hitches when previously unused textures are required.\n Renderer: Implemented caching for shader binaries and render pipelines.\n Renderer: Worked around a long-standing Windows AMD Vulkan graphics driver bug that caused the game to crash whenever alt-tabbing out of full screen mode.\n Renderer: Borderless Fullscreen mode now respects the resolution preference, and scales the image to fit the desktop resolution.\n Renderer: Reduced memory usage for several textures that internally require only one or two color channels.\n Windows: The FPS overlay (Shift+F5) in the top left now can display system and GPU memory utilized by the game.\n Windows: Fixes for filesystem unicode path handling on Windows versions older than Windows 10 build 17134. \n macOS: Improved performance on Apple Silicon.\n Windows: Improved audio latency.\n Camera: Fixed some FOV bugs with cutscenes.\n Camera: Fixed some movement bugs when skipping cutscenes.\n Darwinian: FIxed some bugs with Darwinians not detecting nearby enemies quickly enough.\n Darwinian: Now will recognize certain building types as enemies and flee from them.\n Spiders: Made spiders look less ridiculous when landing after a jump.\n Gun Turret: Now will recognize certain building types as enemies and attack them.\n Fixed broken savegame behavior for Launchpad (the Prologue game map).\n Modified automatic UI scaling to better handle ultrawide aspect ratios (e.g. 21:9).\n Fixed another bug where Spiders might stetch in weird ways to attempt to attack Air Strike units.\n Greatly improved performance of the sphere world's \"Internet\" render.\n Sound system performance is much better and more consistent.\n Updated game controller database.\n Updated contributing libraries (MoltenVK, ANGLE, SDL, etc).\n\n\nKnown issues:\n\n macOS: On MacBook Pro 14\"/16\" with 120Hz displays (or in fact any Mac with > 60Hz displays) there is stuttering in full screen mode. I have not found a programmatic workaround to this problem, as it relates to the \"Direct-to-Display\" feature in Metal which cannot be opted out of. Players can work around this by running the game in Windowed mode, or by using a fixed <= 60Hz refresh rate in the system's Display preferences. We have an open bug with Apple about this problem and will continue to look for a better solution.\n Windows: Some applications (e.g. Overwolf, RivaTuner Statistics Server, etc) may inject Vulkan layers into the game process, even if those applications are installed but not actually running. Some of these layers are known to cause occasional crashes when using the Vulkan renderer. To work around this, either uninstall those applications or use a different renderer in the Screen preferences (OpenGL or Direct3D 11).\n Windows: You may experience crashes on Intel graphics drivers. The cause of these crashes isn't known yet.\n Windows: The Vulkan renderer may appear to stutter when running in windowed mode on NVIDIA graphics cards. NVIDIA is investigating this problem.\n Windows: There is a bug in the AMD graphics drivers that causes the Vulkan extension VK_EXT_full_screen_exclusive to be enabled in \"application controlled\" mode when not requested. This causes unexpected Vulkan error codes to be reported when alt-tabbing out of full screen mode. There is a workaround in this release to deal with the driver bug, but it is strongly recommended that users upgrade to AMD graphics driver version 22.10.3 or later, which has the fix for this issue."
            },
            {
                "app_id": "1500",
                "title": "Darwinia 10000th Anniversary Edition",
                "content": "Fully re-mastered in 2022 to celebrate the Darwinian's 10000 anniversary this updated version brings an undisputed indie classic bang up to date. Running seamlessly on all modern systems, the game hasn't aged a day and is a fresh and relevant now as it was when it first dropped. Winning 3 out of 5 prizes at the IGF including the Seamous McNally Grand prize for Best Independent Video Game and multiple editors' choice awards, now is the time to play one of the most critically acclaimed indie games of all time.\n\nGraphics\n\nThe entire graphics engine has been rewritten from scratch for compatibility with modern graphics APIs and better performance. Darwinia is currently compatible with systems with support for OpenGL 3.3 core, Direct3D 11, Metal, or Vulkan. Support for non-OpenGL graphics APIs is made possible by ANGLE.\n\nOther high-level changes include:\n\n- All the in-game UI now scales more appropriately with the size and DPI of the monitor it's running on\n- Support for anti-aliasing modes including MSAA, SSAA, SMAA, and FXAA\n- Support for AMD FidelityFX Super Resolution 1.0 (FSR)\n- Support for anisotropic texture filtering\n- Higher fidelity colors and tonemapping\n\nSound\n\nThe sound engine now supports up to 7.1-channel surround sound and uses 3D spatialization (i.e. directional audio and doppler effect), using MiniAudio. The sound engine supports any of the backends that MiniAudio does, including but not limited to WASAPI (Windows), PulseAudio (Linux), and CoreAudio (macOS).\n\nCompatibility\n\nDarwinia now requires hardware and drivers that support a minimum of at least one of these graphics APIs:\n\n- OpenGL 3.3\n- Vulkan 1.1\n- Direct3D 11\n- Metal\n\nOn Intel and AMD CPUs, the minimum instruction set requirement has been raised to SSE4.2, for higher performance 3D graphics math (matrices and vectors). \n\nApple Silicon Support on macOS\nmacOS builds now have support for both Intel and Apple Silicon.\n\n\nSteam integration\n\nThe Steam release has a few minor features integrated for a better experience on the Steam platform, including:\n\n - Cloud saves and Dynamic Cloud Sync support\n - On-screen keyboard support (e.g. on devices using game controllers in Big Picture mode, or the Steam Deck)\n - Tuned default settings for better Steam Deck support\n\nPerformance\n\nOutside of architecture-specific changes, numerous performance improvements have been made throughout the entire game engine. One nice side effect of the heavy emphasis on performance is that Darwinia now requires far less energy to run, increasing battery life and playtime on laptops and other portable devices like the Steam Deck.\n\nBugfixes\n\nThere have been many bugfixes on numerous axes, including scripting, level editing, input handling, graphics, sound, stability, and game AI."
            },
            {
                "app_id": "2280",
                "title": "DOOM + DOOM II Release Notes",
                "content": "Developed by id Software and originally released in 1993, DOOM pioneered and popularized the first-person shooter, setting a standard for all FPS games. The critically acclaimed sequel, DOOM II, followed in 1994.\n\n[previewyoutube=-4-xswoPRpo;full][/previewyoutube]\n\nNow the definitive, newly enhanced versions of DOOM + DOOM II are available in a single combined release on Xbox One, Xbox Series X|S, PlayStation 4, PlayStation 5 and Nintendo Switch, in addition to PC platforms and Game Pass (subscription required). This definitive enhanced version is our biggest effort yet with online cross-platform Deathmatch and Co-op for up to 16 players, community-published single-player mod support (with in-game mod browser), optimized renderer, accessibility options, optional modern IDKFA soundtrack by Andrew Hulshult (including brand-new DOOM II recordings) selectable alongside the original MIDI soundtracks, presented in up to 120hz in 4K on supported platforms (see FAQ below for details) and a brand-new episode “Legacy of Rust,” with new weapons and demons made in collaboration by individuals from id Software, Nightdive Studios and MachineGames.\n\nNote: Existing owners of DOOM (1993) and / or DOOM II on any of the above platforms receive a free upgrade to the new combined game, and can still access their previously owned versions. (See FAQ below for details.)\n\nhttps://images.mweb.bethesda.net/_images/DOOM_VanityImage_1920x1080-04-ESRB.png?f=jpg&h=1080&w=1920&s=RdZ4un3QVOdX8CUM0mgNM2gszvntQ55jp7WhOt5Z-2k\n[hr][/hr]\nOwners Receive\n\n DOOM\n DOOM II\n Master Levels for DOOM II\n TNT: Evilution\n The Plutonia Experiment\n No Rest for the Living\n SIGIL\n Legacy of Rust (a new episode created in collaboration by individuals from id Software, Nightdive Studios and MachineGames)\n A new Deathmatch map pack featuring 25 maps (to accompany the existing 18) bringing the total Deathmatch levels to 43\n\n[hr][/hr]\nSupported Languages (text only)\n\n English, Simplified Chinese, Traditional Chinese, French, German, Italian, Japanese, Korean, Polish, Portuguese, Russian, Spanish\n\n[hr][/hr]\nNew Features and Improvements\n\n New Features and Improvements\n Online, cross-platform Deathmatch and co-op for up to 16 players\n Community-published single-player mod support with an in-game mod browser\n Chose to play the original MIDI DOOM and DOOM II soundtracks or the modern IDKFA versions by Andrew Hulshult (including brand-new DOOM II recordings)\n Improved performance with multithreaded rendering supporting up to 4K resolution and 120 FPS on Xbox Series X|S, PC and PlayStation 5\n Now on the KEX engine\n BOOM source compatibility makes it possible for hundreds of community-created mods from the past 25 years to be published in-game\n Accessibility options\n\n[hr][/hr]\nBrand New \"Legacy of Rust\" Episode\nhttps://images.mweb.bethesda.net/_images/id1.png?f=jpg&h=408&w=725&s=GtdqvuNa-3oZA9MPqlo5wsP7F7DAoKHjtZHZi8Ya4Vs\nCreated in collaboration by individuals from id Software, Nightdive Studios, and MachineGames, Legacy of Rust is the newest episode for DOOM, and the first official episode since DOOM II to feature new demons and weapons. This 16-map Episode is broken up into two 8-map acts: The Vulcan Abyss and Counterfeit Eden\n[hr][/hr]\nid Vault\nDive into the id Vault and explore concept art from DOOM + DOOM II’s development, early versions of monsters, weapons, items, props, FX, HUD + Menus and textures left on the cutting room floor.\n[hr][/hr]\nEnhanced Cooperative Gameplay\nNew rules have been added to improve cooperative mode. If all players die, you will lose, and the level will restart. Respawn teammates by clearing all enemies in the area or finding a safe place to hide. Teammates will spawn near you, letting you get back into the fight quickly\n[hr][/hr]\nSplit-Screen Multiplayer\nDOOM + DOOM II includes 4-player split-screen multiplayer on all platforms, with 8 player split-screen available on Xbox Series X|S and PC. Fight against your friends in Deathmatch or with your friends in Cooperative mode, available in seven campaigns\n[hr][/hr]\nOnline Multiplayer\nFrag with friends and strangers alike across 43 different Deathmatch levels or play any of the episodes in co-op. Play alone or play online with local split screen players. LAN play is also supported.\n[hr][/hr]\nCrossPlay Multiplayer\nPlay with friends no matter which platform they prefer. Crossplay is available on all platforms, so you can play DOOM + DOOM II with everyone. Join your friends quickly using our room code system for finding lobbies\n[hr][/hr]\nNew Deathmatch Map Pack\nA new Deathmatch map pack featuring 25 maps was added thanks to community mappers: Luis “DX-Chain” Armacanqui, Luca Ciriaco, Ralph \"Ralphis\" Vickers, Matthew \"RottKing\" Cibulas, Colton \"Arrowhead\" Murchison, Andrew \"Saar\" Bouvé & Joshua \"tokyopunchout\" Boyle. This new pack compliments the existing 18, bringing the total Deathmatch levels to 43\n[hr][/hr]\nExisting Enhancements \nUpgraded visuals \nModern controller support including: Weapon carousel (for faster weapon switching) \nImproved mouse and keyboard controls \nLocal split-screen deathmatch and co-op for up to 4 players  \nFeatured community mods, including: REKKR, Syringe, Double Impact, Arrival, Revolution and over a dozen more… \n60 FPS and native 16:9 support \nRestored original in-game music using original hardware \nQuick Save/Load support DeHacked mod support Game Pass (Xbox Series X|S, Xbox One and Microsoft Store [PC]) and xCloud Support (Xbox Series X|S and Xbox One) \n[hr][/hr]\nAbout the Included Games \nhttps://images.mweb.bethesda.net/_images/doom-2.png?f=jpg&h=1200&w=2130&s=wcDbSTufK2YuaODPxGEnDA-VslaW7-BriQyjzalp99o\nDOOM (1993) - Original Version \nThe demons came and the marines died...except one. You are the last defense against Hell. Prepare for the most intense battle you’ve ever faced. Experience the complete, original version of the game released in 1993, now with Episode IV: Thy Flesh Consumed\nhttps://images.mweb.bethesda.net/_images/doom2-1.png?f=jpg&h=1200&w=2130&s=46x3yA38FJd7ccOOlg683B8XiDB52M07Xv3vzR7a-k4\nDOOM II – Original Version \nHell has invaded Earth, and to save it, you must battle mightier demons with even more powerful weapons. This beloved sequel to the groundbreaking DOOM (1993) introduced players to the brutal Super Shotgun, the infamous Icon of Sin boss, and more intense FPS action\nhttps://images.mweb.bethesda.net/_images/tnt-1.png?f=jpg&h=1200&w=2130&s=lpSHCPy1BYXAeEyOp96xb9-iKjTQjUBk-2ni5hQblMU\nTNT: Evilution \nThe UAC relocated their experiments to one of the moons of Jupiter. A spaceship, mistaken for a supply vessel, was granted access. But when it got close to the base, demons poured out. All your comrades were slaughtered or zombified. This time it's not about survival. It's about revenge\nhttps://images.mweb.bethesda.net/_images/plutonia-2.png?f=jpg&h=1200&w=2130&s=H4kt-vsv-RAj71-WgKRKhAxx2OLzWTWRL2F1GihoGvM\nThe Plutonia Experiment \nEvery effort has been made by the nation's top scientists to close the seven interdimensional Gates of Hell, but one portal remains open. Alone, you must infiltrate the ravaged base, defeat the demon Gatekeeper, and seal the last Hell portal before the undead take over the world\nhttps://images.mweb.bethesda.net/_images/masterlevels-1.png?f=jpg&h=1200&w=2130&s=CSBzBvlZysZDy5CP6ccZavL70XCVZ2I2y3Zo2Q9pk8\nMaster Levels for DOOM II\nThis expansion includes twenty additional levels, all with the same hell-spawned horrors and action of the base game. Each level was created by independent designers and supervised by id Software\nhttps://images.mweb.bethesda.net/_images/sigil.png?f=jpg&h=1200&w=2130&s=6eWxeC23fe33cW-b6SIC7V2z8sJEu8FjBroXcFwlu3Y\nSigil\nCreated by id Software co-founder, John Romero, and released as an episode-sized mod consisting of 18 new maps, Sigil fits in between the timelines of DOOM (1993) and DOOM II. Baphomet, the gatekeeper of Hell, “glitched the final teleporter with his hidden sigil, whose eldritch power brings you to even darker shores of Hell. You fight through this stygian pocket of evil to confront the ultimate harbingers of Satan, then finally return to become Earth’s savior.”\nhttps://images.mweb.bethesda.net/_images/id1-1.png?f=jpg&h=1200&w=2130&s=jiBgG0pO7LurY4T1rLiV3U78kQxn9-UR7mYoKTpkxwQ\nLegacy of Rust\nCreated in collaboration with individuals from id Software, Nightdive Studios, and MachineGames, Legacy of Rust is the newest episode for DOOM, and the first official episode since DOOM II to feature new demons and weapons. This 16-map Episode is broken up into two 8-map acts: The Vulcan Abyss and Counterfeit Eden\n[hr][/hr]\nAccessibility Features\nWith this release, we are adding new accessibility features so DOOM + DOOM II can be enjoyed by even more players\n\n Learn more about DOOM + DOOM II's accessibility features in our guide\n\n[hr][/hr]\nPC Specs Minimum Spec (1080p/60 HZ)\n\n Win 10 64-bit version\n Intel Core i5-3570 @3.4 GHz or AMD Ryzen 3 1300X @3.5 GHz\n 8GB System RAM\n NVIDIA GeForce GTX 650 TI (2GB) or AMD HD 7750 (1GB)\n 1920x1080 Resolution\n Minimum 2GB free space on hard drive\n High speed broadband connection required for online play\n\n[hr][/hr]\nRecommended Spec (*4K/120 HZ)\n\n Win 10 64-bit version\n Intel Core i5-6600k @3.5 GHz or AMD Ryzen 5 1600 @3.2 GHz\n 8GB System RAM\n NVIDIA GeForce GTX 1070 (8GB) or AMD RX Vega 56 (8GB) or Intel Arc A 280\n 3480x216 Resolution\n Minimum 2GB free space on hard drive\n High speed broadband connection required for online play\n\n*Compatible display required\n[hr][/hr]\nFAQs\nWhere can I find these same release notes in more languages?\nCheck out these same Release Notes available in additional languages on the Slayers Club website here.\n\nI already own DOOM or DOOM II. How do I access the new release?\nPrevious owners of DOOM or DOOM II on Steam will automatically receive the new version with a free update. It may already be updated by the time you read this!\n\nHow do I access the original versions of the game?\nSteam users can use the Beta Participation property option to download and launch the original versions, or the last version that we launched in 2019 labeled \"previous-re-release\"\n\nWhat are the supported resolutions and framerates on Steam?\nPC: Maximum supported by video card/display\n\nWhat input devices are supported?\nController, keyboard, and mouse are supported on all platforms, including consoles. Split screen is available with mixed mouse/keyboard and controller\n\nDo I need an always online connection to play the game?\nDOOM + DOOM II only requires an online connection to play online multiplayer game modes. The single player campaigns and multiplayer via split screen, LAN, or ad-hoc multiplayer on Switch can be played while offline\n\nIs the Steam controller supported?\nDOOM + DOOM II does not support the Steam controller\n\nHow do I create a mod?\n\n DoomTools, which offers a wide array of utilities that will be useful or critical towards creating a Doom wad file (requires Java)\n Ultimate Doom Builder for level editing (requires Microsoft .Net Framework 4.7.2)\n SLADE for WAD file editing\n\n...and become familiar with online DOOM community wikis, such as DoomWiki.org, and Discords, such as UDBs and SLADE’s.\n\nHow do I upload a mod?\nMod uploading is only available on PC. To begin the process, select a game from the main menu, like DOOM II for example. Then select \"MODS\" from the menu, and select \"UPLOAD\" and follow the instructions!\n\nOn the Minimap, why do the Kill, Item, and Secrets totals not increment for the Host when completed by another player?\nFor the host player, Kills, Items, and Secrets don't count on the Minimap if another player adds them. This is intended. The minimap shows only your total kills, items, and secrets, not the total for the entire party\n[hr][/hr]"
            },
            {
                "app_id": "2280",
                "title": "DOOM Update - September 3",
                "content": "Note for existing users\n\nThe unmodified, original DOS version running under DOSBox is still available! When launching the game, select \"Launch DOS version\" and you will have access to the previous version.\n\nhttps://images.ctfassets.net/rporu91m20dc/6aCAJjlPGQZW5nkioiiiSJ/07f1ab4d61e81aeb9824d722fb0204dd/New-Additions-Header.png\n\nAdded Steam Support\n\nAnyone who already owns either The Ultimate DOOM or DOOM II: Hell On Earth on Steam will automatically receive the new re-releases in their libraries. The original DOS versions are still available as a separate launch option from within Steam, and the original DOS IWAD files are in their original location on disk. Please note: if you have modified the files in the Steam install folder directly, some files may be overwritten. You should not modify files in the Steam folder directly, as this may cause issues. Anyone who purchases Steam copies of DOOM or DOOM II: Hell On Earth in the future; it will default to the re-releases but can access the original DOS versions as a separate launch option from within Steam.\n\nAdded widescreen rendering support\n\nFor the first time in an official port, the original DOOM renderer has been modified to natively render 16:9 without any letterboxing. The FOV has been increased to reveal more image on the side instead of chopping off the top and bottom. All new 16:9 versions of the titlescreen, intermission, and ending screens have been added. Many of our Add-Ons have also had widescreen support added, so download the latest version from the Add-Ons listing to check it out!\n\nDeHackEd support\n\nThe engine now can load DeHackEd patches, a popular tool for the original release that modified the game in order to support more advanced behavior. Add-Ons can now use new weapons, change enemy behavior, and more!\n\nDeathmatch 3.0 in split-screen multiplayer\n\nSplit screen deathmatch has been changed to what is commonly known in the community as \"Deathmatch 3.0.\" Weapons will stay in the world after being picked up in order to account for the extreme lethality of DOOM's weapons, and the weakness of the starting pistol, while all items and ammo respawn on a 30 second timer. Invulnerability and Invisibility will never respawn after being picked up for the first time.\n\nAdded optional crosshair\n\nA crosshair, which can be disabled in Gameplay Options, will also change colors when targeting an enemy. This means less guessing if firing a rocket is going to aim at the enemy above you, or fire directly into your face, bringing about an untimely death. Enabling the crosshair may also help reduce motion sickness by giving you a fixed point to focus on.\n\nAdded Gyro Aim\n\nGyro Aim, enabled by default when a DualShock 4 controller is plugged in, allows you to look left and right by either turning the controller, or rolling the controller left or right. This allows for an additional amount of precision by enabling fine corrections to turning in order to track moving enemies, while still using the right analog stick for large turning movements. Gyro Aim can be set to either use the controller's yaw, or pitch, or disabled entirely, along with a separate sensitivity slider.\n\nAdded FPS Limiter\n\nYou can set the FPS limiter inside Video Options to 30, 60, 120, 144, 165, 240, and unlimited FPS.\n\nAdded millisecond accurate timer\n\nA millisecond accurate timer has been added to the minimap, and to the end of level intermission, for anyone looking to speedrun levels.\n\nKeyboard entry of cheat codes\n\niddqd, idkfa, idclip, and all of their friends can now be entered from the keyboard, in addition to the Cheats menu, as in the original 1993 release.\n\nAdded secret area notification\n\nA message and notification is now displayed when you enter into a secret area for the first time.\n\nAdded Ultra-Violence+ Skill Level\n\nUltra-Violence+ is a twist on our existing Ultra-Violence skill level. Deathmatch/Co-op only weapons will spawn in, and enemies are fast like in Nightmare mode. In DOOM II, this means you get the BFG and Rocket Launcher right from the start, but in Final DOOM: Plutonia you'll have a Spider Mastermind staring you down as soon as you spawn in on the first level. It cuts both ways.\n\nhttps://images.ctfassets.net/rporu91m20dc/70TdEr4tsWFJvjjhpAaa2Y/2a5ff033c40b313e959612d0dd5f082d/Fixes-Header.png\n\n\nNightmare behavior has been fully restored to the original 1993 release by making enemies move twice as fast.\nIn honor of double speed enemies returning, the warning when selecting Nightmare difficulty has been restored.\nResolved an issue where lighting in split screen was not accurate compared to single player.\nImproved behavior of additional lighting option to increase light levels more accurately across walls and floors.\nPC/Switch: Reduced input latency by disabling rendering extra frames in advance.\nReduced delay in starting certain MIDI music in Add-On levels.\nResolved an issue from the original 1993 release where the Super Shotgun blast will linger for an extra frame.\nResolved an issue from the original 1993 release where the Former Human would not light up when firing.\nResolved a rendering issue from the original 1993 release where certain textures wouldn't tile vertically, commonly known as the \"Tutti-Frutti Effect\n\n\nhttps://images.ctfassets.net/rporu91m20dc/5OvFBxvTPaSYfzZcxTryeC/35689afd50ccbf880e61987746b4ed9f/CHANGES_header.png\n\n\nRestored original attract loop to the original 1993 release. The original title screen and credits screen are now visible between demo playback.\nRestored cut message from the original 1993 release when picking up a medkit, while having with less than 25 health.\nRestored cut \"ouch face\" from the original 1993 release for when a lot of damage is taken in a single hit.\nIntermission screen is now shown after boss levels, instead of cutting immediately to the ending screens in order to see level completion stats and time. Par times have been added to E1M8, E2M8, and E3M8.\nRandom SFX pitch is now disabled for chainsaw sounds to allow for better looping. Random pitch variation has been reduced for other sounds.\nPickup sounds and player voices will no longer interrupt weapon firing sounds.\nPS4/XB1/PC: VSync option in Video Settings to minimize input latency, at the cost of potential screen tearing.\nAdd-Ons will now use their intended custom graphics during intermission and level loading screens.\nLatest Add-Ons appear on the top of the Downloaded list."
            },
            {
                "app_id": "2310",
                "title": "Release Notes & FAQ",
                "content": "Quake – the legendary dark fantasy FPS that revolutionized the genre is now enhanced! This new offering features cross-play, dedicated servers for online deathmatch matchmaking, free optional Add-ons, split-screen support for local deathmatch and co-op, AI opponents in deathmatch and more!\n\nNote: Steam users who already own Quake will automatically receive the new enhanced version with a free download! \n\nRead the FAQ below for details on how to access the enhanced version.\n\n\nRELEASE NOTES\n\n Enhanced Graphics\nBetter lighting, new models, updated maps, and a dynamic shadow system headline the graphical features available in Quake. Individual features of the enhanced graphics can be turned on and off to your preference\n\n Includes Original Expansion Packs\nThe two retail expansion packs, Scourge of Armagon, and Dissolution of Eternity are both now bundled with Quake, and are integrated into the main game. The downloadable expansion pack, Dimension of the Past, has also been upgraded and included\n\n Includes Soundtrack\nThe iconic original soundtrack by Trent Reznor of Nine Inch Nails is now included on all versions for the first time. The soundtracks for Scourge of Armagon, and Dissolution of Eternity are also included when playing those expansion packs\n\n Brand New \"Dimension of the Machine\" Episode\nCreated for Quake's 25th anniversary, Dimension of the Machine is a brand new experience created by the MachineGames team. Continue your fight through brand new dimensions, figure out the secret to restarting the machine, and come face to face with an old foe\n\n Free Optional Add-ons\nSimilar to our re-releases of DOOM (1993) and DOOM II, we will also be periodically releasing free optional Add-ons available to download in the in-game \"Adds-on\" menu. Our first Add-on is Quake 64, which includes the original alternate soundtrack by acclaimed composer Aubrey Hodges\n\n Split-Screen Multiplayer\nQuake includes 4 player split-screen multiplayer on all platforms, in both deathmatch and co-op modes. Fight against your friends, or with your friends in all five campaigns. AI bots are also available to play against in deathmatch mode\n\n Online Multiplayer\nPlay custom matches on player-hosted servers, or hop into matchmaking and play on dedicated servers. Quake also now includes the extra levels Acrophobia, and The Edge available in deathmatch mode. Dimension of the Machine also contains all new deathmatch levels\n\n Cross-Play Multiplayer\nPlay with friends no matter which platform they prefer. Cross-play is available on all platforms, so you can play Quake with everyone\n\n Supported Languages\nEnglish, French, Italian, Spanish, German, Russian\n\nPC SPECS\nMinimum Spec (1080p/60 HZ)\n\n Windows 10\n Intel Core i5-3570 @ 3.4 GHz or AMD Ryzen 3 1300x @ 3.5 GHz\n NVIDIA GeForce GTX 650 TI (2GB) or AMD HD 7750 (1GB)\n 8GB System RAM\n Minimum 2GB free space on hard drive (additional space required for optional Add-ons)\n High speed broadband connection required for online play\n\nRecommended Spec (*4K/120 HZ)\n\n Windows 10\n Intel Core i5-6600k @ 3.5 GHz or AMD Ryzen 5 1600 @ 3.2 GHz\n NVIDIA GeForce GTX 1070 (8GB) or AMD RX Vega 56 (8GB)\n 8GB System RAM\n Minimum 2GB free space on hard drive (additional space required for optional Add-ons)\n High speed broadband connection required for online play\n\n*Compatible display required\n[hr][/hr]\nFAQS\nI bought Quake already, how do I get access to the new release?\nPrevious owners of Quake on Steam will automatically receive the new version with a free download. It may already be updated by the time you read this! Additionally, if you didn't own Scourge of Armagon and Dissolution of Eternity on Steam, you will also be granted access to the original versions of those in-game\n\nHow do I access the original versions of the game on Steam?\nSteam: Launch options are available to launch the original versions of the games, and the original files are still on disk in the same place\n\nHow do I play with friends on other platforms via cross-play?\nThe easiest way to join a cross-play match with friends is using the room code system. The room code is a 4 letter code that can be seen inside the pre-game lobby. Send this to your friends over text message, Discord, or yelling very loudly, and they'll be able to join through the multiplayer menu without having to search through the match browser or enter passwords. Note that on some platforms, cross-play can be disabled at the system level. If you have problems joining cross-play matches, ensure that this is enabled\n\nIf I already own Quake on Steam, will my saves carry over?\nExisting save games do not carry over from the original to the enhanced versions of Quake and Steam and Bethesda Launcher. You can continue to use original Quake save games by launching the original version of the game on both platforms\n\nWill I need a Bethesda.net account to play the game?\nA Bethesda.net account is required for online multiplayer, and Add-ons. Everything else in the game is playable without linking your account\n\nWhat are the resolutions and framerates for PC?\nPC: Maximum supported by video card/display\n\nWhat input devices are supported on PC?\nOn the PC, mouse and keyboard and most controllers should work. Split-screen is available with mixed mouse/keyboard and controller\n\nDo I need an always online connection to play the game?\nQuake can be played offline. Currently, official Add-ons require an internet connection to play even if previously downloaded, however we hope to address this in a future update\n\nAre existing mods supported on PC?\nThe PC enhanced version will load any mod that the original version supported (when existing mods have been placed in the game install directory). However it will not support some mods that require a new/different source port from the original game\n\nNote: We did raise some engine limits from the original version in our new enhanced version but cannot confirm compatibility with all modern Quake mods\n\nCould Not Join Lobby' error on when trying to join Multiplayer?\nThis error occurs on all platforms when you're system clock is out of sync. Please consult you system manual for how to re-sync your system clock. \n[hr][/hr]\nKNOWN ISSUES\n\n In local multiplayer, the weapon wheel will be partially cut off in vertical split screen. This does not occur in horizontal split screen\n If the player uses the Attack input to respawn in multiplayer, they will fire a shot as they respawn\n Users are unable to access downloaded Add-ons without being connected to the internet. This is not intended functionality and will be fixed in a future update\n While in local multiplayer, if you wish to remove players from the lobby, you need to back out of the local multiplayer menu and re-enter it\n Some player movement issues may occur in online co-op matches in Scourge of Armagon\n The Guardian death sounds in may repeat indefinitely in Scourge of Armagon. If this occurs, either save and load your progress or exit the level\n Players switching away from Quake by using ALT+TAB, may notice that they lose control over the cursor. If this occurs, simply return to Quake, and interact with the game to restore control"
            },
            {
                "app_id": "2310",
                "title": "New Quake project hinted at again as Quake on Steam gets beta branch update",
                "content": "It looks like owners of the original Quake game on Steam may be in for a big surprise as QuakeCon 2021 draws ever closer.The SteamDB tracker, which gives users an insight into the mysterious goings-on on the Steam storefront's backend, has picked up two updates to the original Quake game on Steam.According to the history that's being logged by the tracker, a new beta branch has been added to the game, as well as a new 64-bit executable. What could that mean? It could mean that we're getting some sort of ray-tracing update to the original game (simiarly to what we've seen with Quake 2, previously) or it could mean that we're getting a teaser for a whole new Quake project, too. Read more"
            }
        ]
    },
    {
        "cluster_id": "C004",
        "name": "Content, Mods & Multiplayer",
        "description": "Patch notes detailing the addition of new game content (e.g., episodes, campaigns, modes), features, fixes, or improvements related to game mods, modding tools/APIs, their compatibility, community content, and multiplayer functionality.",
        "single_notes": [
            {
                "app_id": "2280",
                "title": "DOOM + DOOM II Update 3 Release Notes",
                "content": "Update as of 4/29: Sigil II music pitch has been corrected. Thanks to everybody who reached out!\nSIGIL II\n[hr][/hr]\n\n SIGIL II is now officially included as part of the DOOM + DOOM II package. It is available from the game select menu at startup. Note: Save games from the Mods version are not compatible with the officially included version. However, the existing Mods version will remain online to users subscribed to it.\n\n[hr][/hr]\nImprovements\n\n When viewing a match running a mod, you will now be directed to the Mods page if you do not have the mod\n\n[hr][/hr]\nFixes\n\n Fixed a crash that could occur when using the automap\n Fixed sound issues with ceiling sounds on DOOM II MAP04 and TNT MAP04\n Fixed a crash when playing BTSX Episode 2 in multiplayer\n Fixed a crash that may occur when downloading or deleting many mods during the same launch\n Custom menu logos appear at the top of the menu again when playing a mod\n\nMod Compatibility Fixes\n\n Fixed a crash that occurred when a WAD contains a zero length sound\n Fixed fast doors making double sounds for mods running in Boom or MBF modes\n\n[hr][/hr]\nRead the above release notes in additional languages on Slayers Club here."
            },
            {
                "app_id": "2280",
                "title": "DOOM + DOOM II Update 2 Release Notes",
                "content": "Edit: For Steam Deck users a hotfix has been applied, so make sure you have the latest version installed before launching and thank you for the quick feedback and providing crashlogs!\n[hr][/hr]\nUpdate 2 adds Multiplayer Mod support for DOOM + DOOM II and game improvements/fixes!\n\nImprovements\n[hr][/hr]\nMultiplayer Mods\n\n Hosts need to activate the mod before entering the multiplayer menu\\xa0\n Players will need to subscribe to the same mod before joining a match\\xa0\n We recommend using room codes to join modified matches\\xa0\n Mods must be authored with Vanilla DOOM, DeHackEd, MBF21 or BOOM to be compatible\n\\xa0\nGeneral\n\n Resolved an issue in which some red doors did not display as red on the automap \n Fixed multiple crashes reported by the community when loading game saves\n Improved text line wrapping legibility for mod descriptions in Asian languages \n Removed map prefix from intermission screen to be consistent with original game behavior \n\nMultiplayer\n\n Added spectator mode when players are dead and waiting to respawn in co-op mission play (it can also be initiated manually from the scoreboard button) \n Fixed an issue in which disabling the crosshair would also turn off player name and co-op respawn text display \n There are now more than 4 player colors available in game and on scoreboards \n Resolved an issue in which players would lose weapons when respawning in co-op using modern rules \n Fixed an issue in which the cross-platform friends menu could not be properly backed out of when no friends were available \n Further optimized multiplayer networking code \n Addressed crosshair centering issue in certain splitscreen configurations \n Intermission animations now run at the correct speed in splitscreen mode \n\nModsl\n\n The mod downloader can now process more than the first 100 subscribed mods \n\n[hr][/hr]\nFor Mod Creators on PC\n\n Mod screenshots with spaces and other non-alphanumeric characters in their file names will now upload correctly in most cases \n\nMod Compatibility Updates\n\n MBF21 instant kill sectors were incorrectly killing non-enemy actors \n MBF21 instant kill sectors will fire immediately when a monster enters them, instead of waiting \n BOOM and MBF21 effects that kill monsters will deal 1 million damage instead of 10000 damage in order to fix mods that used monsters with high HP values to create an invulnerable enemy \n BOOM generic floor actions were not selecting the right neighbor when finding which sector ceiling or floor height they needed to move to \n Players can hurt and shoot projectiles at their own voodoo dolls (aka player model / clone), to be consistent with the original game \n ENTERPIC in UMAPINFO is correctly shown for the map you are entering instead of the map you just left \n DeHackEd strings for BOOM keys can now be replaced through DEH patches \n BOOM line action 242 (Deep water) will now transfer ceiling and floor lighting \n Now avoids crashing for invalid sized demos when playing the demoloop \n Maps using DMAPINFO will print the map name on automap, level select, and savegames \n Changing DeHackEd ammo type will now actually change the ammo type \n Fixed Berzerk Factor not calculating correctly in the A_WeaponMeleeAttack MBF21 codepointer \n Fixed BTSX Episode 1 and Episode 2 demo playback not rendering fullscreen \n Mods that override DOOM (1993) Episodes 1-3 will use the correct intermission screen \n MBF21 A_Lower codepoint now checks for an invalid weapon before changing weapons if out of ammo \n\n[hr][/hr]\nIf you'd like to read these release notes in additional languages, check 'em out on Slayers Club here (EN-only until 1/31 -- afterwards, change language via the globe button at the bottom of the page)."
            },
            {
                "app_id": "2280",
                "title": "DOOM + DOOM II Update 1 Release Notes",
                "content": "Update 1 is live for DOOM + DOOM II and brings a handful of requested improvements and fixes!\n\nImprovements\n[hr][/hr]\nGeneral\n\n Added 21:9 resolution graphics for DOOM, DOOM II, The Plutonia Experiment, and TNT: Evilution\\xa0\n Left turn, right turn, and strafe keys added to keyboard bindings, allowing playing with old-school keyboard-only tank controls\\xa0\n Added 3D sound option in Sound Menu, allowing more than 2 speaker setups to be used – this allows individual sound effect levels to be taken into account compared to the original DOOM sound system\\xa0\n Cheats can now be activated from the pause menu. Entering the original game’s cheat codes will unlock them for future use. You can also unlock all cheats from the Gameplay Settings menu\\xa0\n\nMultiplayer\n\n The multiplayer match browser can now be filtered and sorted\\xa0\n Added timer and frag limit added to the multiplayer scoreboard\\xa0\n\nMods\n\n Players can now search for mods by name in the Mod Browser\\xa0\n Release notes for mods are now visible in the Mod Details screen\\xa0\n Checking for Mod updates can now be manually done from the Play Menu\\xa0\n Added a link in the Play Menu to the Mod’s details page to allow quicker access to unsubscribe, like, and report\\xa0\n The current page and last selection are kept when backing out from a Mod’s details screen\\xa0\n Play Mods menu now shows locally installed Mods\\xa0\n Added a menu option to pop up the folder where you can drop new WAD files\\xa0\n Added “wad” console command to quickly load a WAD file and restart the game\\xa0\n\n\nFixes\n[hr][/hr]\nGeneral\n\n When a save game is incompatible due to a map update, you will now restart the level from the beginning, with the inventory you had at the time of the save \n Globally reduced input latency by at least one frame at 60hz \n Various audio issues fixed, including ones around playing looping sounds, positioning, and limits on simultaneous voices \n Loading saves no longer causes enemies to attack other map objects \n Loading saves will correctly restore enemy infighting and tracking of Arch-Vile and Revenant targets \n The correct DOOMguy expression is now displayed on the HUD when being damaged with more than 120 HP \n Progress on the “Until It Is Done” achievement can now be made when playing DOOM & SIGIL \n All difficulty modifiers will restore correctly when loading a save game \n Weapon lowers properly when dying when turning view bobbing off \n\nEpisode-Specific\n\n Resolved soft-locks in MAP03 in Legacy of Rust and TNT: Evilution MAP06 (at the lift near the start of the map) \n Fixed an issue in which some enemies were getting stuck in TNT: Evilution MAP31 \n\nMultiplayer\n\n Fixed an issue in which all platforms could not see each other in the Match Browser \n Fixed an issue in which wall textures would sometime not scroll correctly for multiplayer clients \n\nMods\n\n The game will no longer force quit when attempting to load incompatible Mods, sending you back to the Menu instead \n Fixed an issue in which saves made from certain Mods would not load \n Automap will render correctly for large maps in Mods \n Extended Boom feature compatibility to support a broader range of Mods. If your Boom or MBF21 Mods were having issues prior to this update, please try them again, and thanks everyone for all the reports so far! \n\n[hr][/hr]\nIf you'd like to read these release notes in additional languages, check 'em out on Slayers Club here (change language via the globe button at the bottom of the page)."
            },
            {
                "app_id": "2280",
                "title": "10 amazing Kinect PC hacks",
                "content": "Microsoft have recently dropped hints that they might be planning to officially bring the Kinect to PC. If they do, they'll be hard pushed to improve on some of the user made applications that have been appearing since the Kinect was successfully hacked. We've gathered together some of the best below, including a program that turns you into a superhero, another that lets you play Call of Duty: Modern Warfrare with your body, an 80's synth pop music video creation tool, and more.\n\n\n\n1. Playing Call of Duty: Modern Warfare with Kinect\n\n \n\n2. Become a Superhero\n\n\n\n3. Playing Doom with Kinect\n\n\n\n4. Kinect X Ray vision\n\n\n\n5. Playing World of Warcraft with Kinect\n\n\n\n6. Music video\n\n\n\n7. Piano anywhere\n\nDaVinci prototype on Xbox Kinect from Razorfish - Emerging Experiences on Vimeo.\n\n9. Tetris\n\n\n\n10. Minecraft Statues\n\n\n\n\n\n\n\n\n\nThere are a few great hacks that we've featured on the site before. You might want to check out the video of a man playing RUSE with Kinect, and another of a man using the camera to play Minecraft. Honourable mentions also go to the Invisible Man hack, the virtual air guitar the hovering Kinect robot, and the deeply weird body morph hack. For more hacks and some introductory guides to hacking Kinect yourself, check out Kinect Hacks."
            },
            {
                "app_id": "2310",
                "title": "Quake - Update 4",
                "content": "Update 4 for Quake includes the return of the legendary progenitor of team-based multiplayer: Threewave Capture the Flag! We have resurrected nine iconic levels from the original mod just in time for QuakeCon to bring you and seven of your closest frag friends back together again!\n[hr][/hr]\nTHREEWAVE CAPTURE THE FLAG (CTF)\nhttps://images.ctfassets.net/rporu91m20dc/4iyRQZMzjY47QUqxHCiQZQ/3c0671d58577052b19ae5755956d3764/Quake_ctf.gameplay.png\nThe rules for Capture the Flag are similar to the backyard game: protect your flag, steal the enemy’s, and return it to your own flag to score a point. Threewave CTF comes with some extras to this basic formula by adding power-up runes for teams to fight over, and the famous grappling hook!\n[hr][/hr]\nA BRIEF HISTORY\nFor all those scholarly Rangers out there, here's a brief history...\nThreewave CTF was first released in October of 1996 by Zoid Kirsch. The mod back then was simple, and remixed existing game content to create something new. Matches took place on the single player levels modified to create bases. Keys were used in place of flags, and the grappling hook was an axe that fired a Vore ball. While a little bit of imagination was required, this didn’t hurt the mod’s reception at all. It caught on fire immediately and built a large fanbase of players looking for a deeper alternative to deathmatch.\nOver the course of many updates, and eventually a QuakeWorld version, Threewave CTF would go on make Capture the Flag a household name in multiplayer game modes, and even spawn websites that exclusively covered Capture the Flag modes in games. Threewave CTF would be released officially as a part of Quake II, and the Quake III version of the mod would bring in new flag-based game modes and maps that would later make their way into Quake Live. Quake multiplayer and Threewave CTF have always been intertwined, and now the mod that started it all is now available for free in the enhanced Quake re-release\n[hr][/hr]\nNEW ENHANCEMENTS\nThis latest version of Quake has been enhanced, with an improved flag status display showing if your flag is safely in base, team scoring, and a modern interface. The maps included have been updated with improved lighting and fog effects. All of this is included free in Update 4, and requires no additional download\n[hr][/hr]\nRUNES\nFour power-up runes spawn randomly throughout the map at the start of the match. Teams will vie for control over them, as they bestow their holders great benefits, and will stay with them until death. They fly out of the player on death, so keep an eye out, and grab them as quickly as possible to posses their power. If nobody picks them up eventually, they'll respawn elsewhere. Holding these runes are key to giving your team the edge to win!\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/TXq9i0oRBlVG5jzP4Ax1w/edc76b844c872feef284ab4187490b24/Quake_Rune_Earth.Magic_960x540.png\nRune of Earth Magic | Resistance - Take half damage from all weapons\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/3ItYZNa3p4OX5Pqs3FaouZ/a962d2c81a4a8d1a7c663176a05accd8/Quake_Rune_Black.Magic_960x540.png\nRune of Black Magic | Strength - All weapons deal double damage\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/1hJfBLmolPQJVUlGJ7BkQn/2468176354ec3038d63a9809130a6e54/Quake_Rune_Hell.Magic_960x540.png\nRune of Hell Magic | Haste- Most weapons fire twice as fast, and nail projectile speed doubles\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/1Uy37Nfc1yw77suc4UQn9H/63429546db77f06a4c35d94e8e67dfa4/Quake_Rune_Elder.Magic_960x540.png\nRune of Elder Magic | Regeneration - Regenerate some lost health and armor every second, up to 150\n[hr][/hr]\nGRAPPLING HOOK\nThe grappling hook, accessed via the weapon wheel or by pressing the key bound to the Axe, is more utility than weapon than most options in your armory. Holding down the fire button will shoot the hook, where it will fly straight forward until it hits a wall. Once attached, the hook will pull you in at a very high speed. The hook can be attached to players to do a constant stream of damage; however this will leave you vulnerable to the player you are attached to.\nSwitching weapons while the hook is attached will allow you to hang off walls and fire, however you will be vulnerable as you will be unable to move, doing your best impression of a turret. Using this to ambush an attacker can be an effective tactic, however it should be used sparingly as ambushes only work if they are unexpected!\nAdvanced players can shoot the hook at the ground, and then immediately let go as soon as the hook starts to pull you. This lets you launch into a bunny hop at a very high speed, and makes you less predictable of a target as you weave your way around the map\n[hr][/hr]\nMAPS\nOur update includes nine of the maps from the original mod\nhttps://images.ctfassets.net/rporu91m20dc/hVH0BRfmtin2OLRVI6fDu/ecc567a42f8e532f70966b12dbf4bbba/ctf1.png\nCTF1: MCKINLEY BASE\nCreated by Zoid Kirsch\nTwo bases connected by bridges, and an underwater route. An instant classic, and the most iconic map of the mod\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/5FCUo3En7z4JnHvtWWKRuz/310f73f919c52d73904463711fc8b057/ctf2.png\nCTF2: MCKINLEY STATION\nCreated by Zoid Kirsch\nThe sequel to McKinley Base, with bigger bases, a bigger flag room, and more routes. A classic, refined\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/6huuCopO6vZhOEBn7j7E8j/cad2318276267ab26a7e037788c0e1ff/ctf3.png\nCTF3: SPILL THE BLOOD\nCreated by Dale Bertheola\nCatwalks and bridges hanging over lava and acid, with a wind tunnel into the flag room that provides ample opportunities to overwhelm the defense for some skeet shooting practice\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/55lE1n8c22nsDxWHVo7VZN/e3b3392a4489ff89ac3dd52c7526eb57/ctf4.png\nCTF4: GLOOM CASTLES\nCreated by Tim Willits\nA CTF version of the classic E1M5: Gloom Keep. Two Gloom Keeps, face to face. The front door is the shortest route, but also the riskiest. Lose the defense by taking the long way around\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/2MdzLJfTGTE3rUksKEOtUD/61ac369db9031fd10299f9cb5455a05f/ctf5.png\nCTF5: CAPTUREPHOBOPOLIS\nCreated by American McGee\nThe mouthful of a map returns, but now with flags! This time, the bases are stacked on top of each other: red team on top, and blue team below\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/1C8i4Zii4OrUCMbuIUZQQi/ae45da440fb98c4cacb7e6fb90625950/ctf6.png\nCTF6: VERTIGO\nCreated by Dale Bertheola\nEach flag is flanked by a hulking Quake Q, looking over three paths out of the flag room and one-way wind tunnels\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/2Sm1EOyJHF1pMhrJKMiZ2X/fdfd4440d10c34b82020b574c3e95340/ctf7.png\nCTF7: THE STRONGBOX\nCreated by Brent McLeod\nWith a warehouse at its center, elevators and trains between bases provide ample grapple opportunities into tight flag rooms\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/1drZofczoXtCTyXjBqxZIF/845f06367d34c1789588fe1f10e05077/ctf8.png\nCTF8: CHTHON’S CAPTURE HOUSE\nCreated by Tim Willits\nChthon’s hellish domain has been converted into a base in our smallest map of the set, providing intense combat with nowhere to hide\nhttps://images.ctfassets.net/rporu91m20dc/26wns0NCApE6UDu1za2fGN/9659c10e436dfab57667ed0390e7cdbc/ctf9.png\nCTF9: DA ANCIENT WAR GROUNDS\nCreated by Matt Hooper\nCatapult yourself over the moats into two traditional medieval castles and grab the flag from the throne room\n[hr][/hr]\nBUG FIXES\n\n Fixed Fiend arm clipping into the floor at death\n Fixed auto aim debug variables that could be used to cheat in multiplayer\n Fixed loading lightmaps in huge levels, such as when users side-loaded \"Tears of the False God\" in Arcane Dimensions"
            },
            {
                "app_id": "2310",
                "title": "Quake - Update 3",
                "content": "Quake Update 3 includes new Accessibility features, three new Horde Mode maps from MachineGames, as well as QOL improvements, and bug fixes\n\nNEW ACCESSIBILITY FEATURES\n[hr][/hr]\nWe are happy to add new accessibility features to Quake so that the gameplay experience can be enjoyed by even more players\n\nAccessibility Options Notification\n\n After installing Update 3, you will be presented with an Accessibility Options notification. Read through the available options to make sure they are set to your preference. Once in-game, these options can be accessed from the Options/Accessibility sub-menu via the Main and Pause Menus\n\n(Note: All Accessibility options default to ON during first launch after install - but can be easily toggled OFF/ON via Disable/Enable All Settings)\nhttps://images.ctfassets.net/rporu91m20dc/53cZ87RNPifGqn0X1JxMSP/04e43649c8c4eeed604bab5d8e1171dfd/Quake-Accessibility-DisableALL_960x540_ESRB.gif\nAccessibility Options\nhttps://images.ctfassets.net/rporu91m20dc/7giJostYvbfEjA5pei7tsg/1d8626adee361a5006f3314a060e0f26/Quake_Accessibility_Options-1_960x540.png\nRead Chat Out Loud '*'\n\n Converts incoming multiplayer text chat into a synthesized voice\n\nTranscribe Voice Chat\n\n Converts incoming voice chat to text in the multiplayer chat window\n\nSpeak For Me in Voice Chat '*'\n\n Converts outgoing multiplayer text chat into a synthesized voice audible to other players\n\n'*' Voice profiles can be selected from the Accessibility menu when connected to an online multiplayer session\n'*' Text-to-Speech menu narration is not supported\nhttps://images.ctfassets.net/rporu91m20dc/1eDnrMMBOsjqI2qELw1tnD/aa089d1c14874197c51515592045aed2/Quake_Accessibility_Options-2_960x540.png\nNote: There are several Voice Profiles now available in Quake. The number available per language may vary\n[hr][/hr]\nHigh Contrast\n\n Changes the default text field backgrounds to improve User Interface legibility\n\nhttps://images.ctfassets.net/rporu91m20dc/3c8H4Fz4KZxpFUIl8pd4dq/6a3484ea39a6e24c3aae5ec34debd7e9/Quake_Accessibility_Options-1-2_960x540.png\nHigh Contrast OFF\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/7giJostYvbfEjA5pei7tsg/1d8626adee361a5006f3314a060e0f26/Quake_Accessibility_Options-1_960x540.png\nHigh Contrast ON\n[hr][/hr]\nAlternate Typeface\n\n Changes the original in-game font to a more modern one for improved legibility\n\nScreen Flash Amount\n\n Decreases opacity of onscreen effects to reduce flash intensity\n\nCenter Message Time\n\n Changes the display duration of center print HUD messages\n\nCorner Message Time\n\n Changes the display duration of corner print HUD messages\n\nMaximum Lines\n\n Changes the maximum number of onscreen corner print HUD messages\n\nChat Message Time\n\n Changes the display duration of multiplayer text chat messages\n\n[hr][/hr]\nHORDE MODE\nThree New Levels\n\nEnjoy three new Horde Mode levels courtesy of our friends at MachineGames!\n\nhttps://images.ctfassets.net/rporu91m20dc/6zb2TiKo4YxhtLtwSvjn8J/0378492257751c294a6da9cfee3396a4/Quake_Horde-Relic_960x540.png\nRelic\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/HJccYIr2IbCZRvlAQAQ6g/eaf0d6e9b11c7797b9d73859c8c5938b/Quake_Horde-TheTrial_960x540.png\nThe Trial\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/EmfsQOG1KI99J0ZXL7sJn/58d4f54eec73c911133363273f123ebb/Quake_Horde-TheTower_960x540.png\nThe Tower\n[hr][/hr]\nQUALITY OF LIFE IMPROVEMENTS\nGeneral Gameplay\n\n Added option to disable automatic weapon switching on pickup (Note: This may not work with certain Add-ons)\n Improved spawn logic to avoid spawning enemies when the player is on a spawn point\n\nHorde Mode\n\nSkill selection balance adjustments:\nWe’ve received community feedback that Horde Mode is too hard on Easy and too easy on the more difficult skill selections. To accommodate this feedback, we’ve made Horde Mode less difficult on Easy and more difficult on the Hard and Nightmare skill levels. We hope these balance changes are to your liking and look forward look forward to hearing from you on them!\n\n Fewer enemies are spawned in each squad on Easy skill selection\n Boss enemies will start showing up in earlier waves on Hard and Nightmare skill selections\n Hard skill selection now starts with as many enemies as wave 3 had previously\n Nightmare skill selection now starts with as many enemies as wave 6 had previously\n Additional balance adjustments:\n Ammo now respawns every 20 seconds instead of once per round\n Enemies are now more tenacious – they will now route around the map and obstacles to find you. No more hiding and safely picking off harmless monsters from a distance!\n Four player games will now spawn in double the enemies in each wave\n\nMultiplayer\n\n Removed ability to enable cheats in public multiplayer matches (Note: Cheats can still be enabled from a PC host in private matches)\n Changed color of enemy text chat from red to green for increased contrast and improved legibility\n Online multiplayer text chat messages can now be sent via the Pause Menu (Note: Only PC versions support text entry from physical keyboards)\n Added option to toggle the scoreboard on/off with a button press instead of a button hold (in Gameplay Options)\n\nMultiplayer Bots\n\n Added Deathmatch bot support for all single player levels in the original campaign, courtesy of Jorge Martins (Check out their super useful guides made for community modders here)\n Bots now roam around if the current map doesn't have items, finding their own roam goals\n Bots now better handle maps with lots of air blasts that push them around\n Improved bot navigation on MGDM1, and E1M2\n Bots now roam around if map doesn't have items, finding their own roam goals\n Bots now better handle maps with lots of air blasts that push them around\n Improved bot navigation on MGDM1, and E1M2\n\n[hr][/hr]\nBUG FIXES\nGeneral Gameplay\n\n Fixed an issue in which music was not playing correctly on certain Add-ons\n Reduced audio latency throughout the game\n Fixed a bug in which the House of Doom achievement was not unlocking when finding the secret level in Dimension of the Past\n Resolved an issue in which the Corner message would print the incorrect one for a single frame\n Fixed an issue in which menus would not scroll all the way to the top of the screen\n Resolved the issue where the text chat window was too small while playing at 4K resolution on supported platforms\n\nHorde Mode\n\n Fixed a bug in which suicide in Horde Mode would not deduct points and immediately respawn you\n Resolved an issue in which killing a teammate would incorrectly grant a frag and not end kill streaks\n Removed the random offset from dropped powerups to prevent them from falling out of the level\n\nMultiplayer Bots\n\n Fixed an issue in which bots would sometimes miss shootable triggers\n Fix bots incorrectly using Mjolnir when they don’t have ammo\n Addresses the issue where bots wouldn’t chatter when killing an enemy, or if teamkilled\n\n[hr][/hr]\nMODDING IMPROVEMENTS FOR MODDERS\nThe following changes apply to users who may be developing Add-ons that work on the PC version of Quake\n\nGeneral Modding Improvements\n\n Our QuakeC source code is now available! This includes the QuakeC source for the base game, Scourge of Armagon, Dissolution of Eternity, and the new Dimension of the Machine, which includes Horde Mode. This code is released under the GPL license and can be obtained from the id Software GitHub here\n QuakeC built-ins that are unique to the rerelease are now looked up by name, rather than hardcoded builtin numbers which could interfere with other engines\n Fixed issue with long centerprints disconnecting clients when sent, which could occur when using long custom intermission end texts in Copper\n Added \"walkpathtogoal\" QuakeC built-in. This can be used as a drop-in replacement for the existing AI movement to allow any entity to take advantage of bot pathfinding without needing them to be a bot client. Create a friendly dog that does your bidding, or haunted items that run away from the player to avoid being picked up. The world is your oyster!\n New entities are available for ranged, flying, and boss spawn points. The horde spawning logic will use these points if available\n Monster spawners can be controlled by using trigger_multitouch entities to enable or disable them as the player moves throughout the map\n\nMultiplayer Bots\n\n Added \"bot_movetopoint\" - new QuakeC built-in to give bots a high level command to move to a point\n Added \"bot_followentity\" - new QuakeC built-in to give bots a high level command to follow any entity that they are aware of\n Added Bot_PreThink - new QuakeC function that gets called before bots run their update logic in the engine\n Added Bot_PostThink - new QuakeC function that's called after bots run their update logic in the engine\n Added \"objective\" flag to items.txt processing. This allows you to tag any item as an objective. Bots track these as a special case, but rely on you to tell them what to do about it\n Warn at startup if weapons are not correctly setup with a power of two number in QuakeC\n Add cvar \"bot_entityRespawnFunc\" to tell the bots which function in a QuakeC mod handles respawning items. Bots use this knowledge to understand when items like the MegaHealth will actually respawn\n Bots can receive and will react to two stuffcmds: “color” and “kill”\n Update monster teams regularly - allows mods to add/remove monsters from teams during the game, and have bots understand the change\n Support idea that monsters can \"belong\" to a player in DM\n\nBot Navigation Editor\n\n Add cvar \"navEdit_removeNoclipOnExit\" to disable turning off noclip when exiting nav editor\n Expose bot pathfinding heuristic value to users in the nav editor, and save the heuristic into the nav file\n Rename cvar navEdit_waterLookPointDist to navEdit_inWaterLookPointDist for clarity\n When underwater, place nav node centered on crosshair\n Fix nav node placement in shallow water\n Add ability to clear start/goal nodes when testing paths in the editor by pressing F8\n Add ability to toggle seeing traversals when testing paths in the editor by pressing F5\n Add \"NoMonsters\" flag to nav nodes. Allows you to mark nodes that AI shouldn't use (eg. if the node is too close to a wall or obstacle that might get an AI stuck, but are not issues for bots)"
            },
            {
                "app_id": "2310",
                "title": "Quake | Free Add-ons Available | Honey, Underdark Overbright & Copper",
                "content": "Enjoy battling through new maps in Underdark Overbright as well as experience the original game with community-driven gameplay adjustments with a bonus to this Add-on, Copper.\n\nhttps://images.ctfassets.net/rporu91m20dc/3oMPerJVgGorknYUBRTMnN/193b7fb7cc24a11e9a949f918f5e35e0/QUAKE_UDOB_in-body_1-3.jpg\n\nUnderdark Overbright is an eight-level episode set in a mix of medieval architecture and overgrown environments, serving as a prime example of the modern Quake modding community. The new episode brings you through some unique moments such as an underwater gauntlet, a fight to survive on sinking lava platforms and single-player revisitations of Deathmatch classics. As a bonus, the original Quake episodes are available from the Underdark Overbright hub map as well as a whole new end level, so definitely check it out!\n\nUNDERDARK OVERBRIGHT & COPPER\n\nhttps://images.ctfassets.net/rporu91m20dc/3IILRJch7aiyLwc0QKm86B/6b017fe4ed5e8d3c8b4b5d9d54d1d1b4/QUAKE_UDOB_in-body_end-3.jpg\n\nSpeaking of the original Quake, also included in this Add-on is Copper - a modification that slightly alters Quake’s gameplay! With adjusted behaviors for items, monsters and weaponry, Copper’s quality-of-life changes offer a new take on your next trip through the Slipgate.\n\nHONEY\n\nhttps://images.ctfassets.net/rporu91m20dc/4NfpgLKGQ3jdY0UEW2y9gZ/090bcdaedcf0f2ef23aa83b63c73222d/QUAKE_HONEY_in-body_3.png\n\nEncounter waterlogged crypts and underground temples as you face the darkness, combating a deadly plague blighting the land. With expert use of fog effects and silhouettes, traversing through Honey’s maps are just as good at ambiance as they are obscuring the deadly threats you’ll face in this fan-favorite Add-on!\n\nhttps://images.ctfassets.net/rporu91m20dc/1RRWvLAJjHMSp0Y9VnWXP2/0f2c96b1e5f4798be704da025c037fe4/QUAKE_HONEY_in-body_4.png\n\nDownload Honey, Underdark Overbright & Copper for free via the Add-on menu in Quake today! Learn more how Underdark Overbright & Copper were developed with our exclusive interview with the original creators, Lunaran and Scampie! And of course our exclusive interview with Honey creator and MachineGames alum, Christian Grawert!"
            },
            {
                "app_id": "2310",
                "title": "Quake Remastered's second update adds a horde mode and new singleplayer levels",
                "content": "Nightdive Studios' excellent remaster of Quake already contained a bonus episode from Wolfenstein reboot devs, MachineGames. The game's second major update, released today, adds even more new content from the Swedish studio...\n                Read more."
            },
            {
                "app_id": "2310",
                "title": "Quake - Update 2",
                "content": "Update 2 contains a brand-new Horde Mode made by MachineGames with 1-4 player co-op (including optional bots), new Add-on \"Honey\", some quality-of-life improvements, and bug fixes.\nIt also marks the Quake release on the Epic Games Store (for PC). With Horde Mode you can play solo, with bots, or friends, and face off against waves of enemies of increasing difficulty. Earn Silver Keys to unlock access to better weapons. Survive long enough and earn a Gold Key, which will allow you to escape, or stay behind and fight against the armies of Quake until you fall\n\n\n\nHORDE MODE\n[hr][/hr]\nOverview\n\n All new multiplayer PvE experience designed by MachineGames \n Supports 1 - 4 players or bots in local multiplayer and online modes (Custom matches only)\n Playable on all difficulty levels\n Includes 4 new maps specifically designed for Horde Mode\n\nRules\n\n Score points by killing enemies\n Kill multiple enemies in quick succession for bonus points\n Your progression is reset after the last player dies\n Every 3rd wave has boss monsters but once you clear it, you get a Silver key to unlock more weapons and items\n After the 9th wave, you get a gold key to unlock the exit, or you can keep fighting as long as you are able\n Monsters have a chance of dropping quad damage and the pentagram of protection (powerups last for 5 seconds once picked up and despawn if not picked up after 10 seconds)\n\n[hr][/hr]\nNEW ADD-ON: HONEY\n[hr][/hr]\nhttps://images.ctfassets.net/rporu91m20dc/3tJ5fjdFjbLjmbfEvaLEdt/f383363ac9f29167265ab5ccf39297b7/QUAKE_HONEY_in-body_5.png\n\n Expand your Quake experience with the free Honey Add-on and delve deep into the darkness to conquer a deadly plague infecting the land\n For a unique look behind the curtain, check out our Nods to Mods interview with the author of \"Honey\", MachineGames' own Senior Level Designer - Christian Grawer here\n Read more about how to access Honey here\n\n[hr][/hr]\nIMPROVEMENTS\n[hr][/hr]\n\n Improved auto aim to reduce amount of snapping and view locking onto enemies\n Crosshair color and type can now be changed from the Gameplay options menu\n Add-ons menu can now be used to play previously downloaded add-ons while offline\n Text chat and push to talk voice chat are now available in pre-game lobbies\n Added ability to invite friends across PC platforms using players on your Bethesda.net friends list (optional)\n\n[hr][/hr]\nRANGER SKINS IN QUAKE CHAMPIONS AND DOOM ETERNAL\n[hr][/hr]\nhttps://images.contentful.com/rporu91m20dc/6PXCqwNGJM6TT3IJCD2K27/64fdd2943abc955f61811aa2e9a1cdcc/DE_QC_RangerSkins--1920x1080.png\n\n Owners of our Quake re-release can log in with their Bethesda.net credentials in-game to earn the Ranger Slayer Skin for DOOM Eternal and the Quake Guy Ranger Skin with the Gladus Axe in Quake Champions! (NOTE: In addition to owning Quake, players must also own DOOM Eternal or Quake Champions to use their respective skins)\n For more info, click here\n Note: Nintendo Switch users can unlock the Ranger Slayer Skin in DOOM Eternal alongside Update 6.66 sometime in early 2022. Stay tuned to the Slayers Club for updates!\n\n[hr][/hr]\nBUG FIXES\n[hr][/hr]\n\n Fixed Death Knight incorrectly referred to as Hell Knight in the main Quake campaign\n Bots now chat less\n Fixed cases where texture borders were visible around certain HUD elements\n Fixed weapon firing immediately after respawning in multiplayer\n Turning off Enable Microphone before connecting to online services now properly mutes the microphone\n\n[hr][/hr]\nMODDING IMPROVEMENTS\n[hr][/hr]\nThe following changes apply to users who may be developing add-ons that work on the PC version of Quake\n\n Added new cvar navEdit_onlyTraceAgainstWorld to validate look position only against the world (skipping all other entities). This cvar is exposed as a user option in the nav editor\n Added new cvar navEdit_skipLookPointValidation which completely skips look point validation, allowing user to place nodes anywhere • Bots now understand Zombies are killed easier with explosives and will switch weapons if possible\n Further improved bot control of powerups on the map in DM\n Bot characters are now reloaded when loading a new mod/Add-on\n Make sure FL_ISBOT flag is set on the bot client when the bot calls \"ClientConnect\" and \"PutClientInServer\" inside QuakeC. This allows mods to run bot specific logic when a bot spawns in\n Fixed bots trying to pick up weaker armors, when wearing a stronger set\n Added nav editor cvars that are handy when switching back and forth between editor and game for testing, navEdit_removeGodModeOnExit, and navEdit_removeNotargetOnExit\n Added g_removeAllAI to remove all AI that are on the map. Will check regularly for spawned AI to remove them as well\n Added nav editor cvar navEdit_showLinkType. Useful for debugging pathing issues. Cycles between showing all links/nodes, only nodes with one way links, and only nodes with non-walk links"
            },
            {
                "app_id": "2310",
                "title": "Quake 1 gets a \"major update\" that takes aim at mod problems",
                "content": "The first big patch for the Quake 1 enhanced edition has dropped, described by Bethesda as a \"major update\" that takes aim at issues such as controls, bot support in multiplayer, and numerous bug fixes. It also features numerous mod support improvements to get new and old Quake mods working with the new remaster.\nThe new enhanced edition of the first game in the Quake series was announced at QuakeCon in August and released the same day, along with two original expansions created by Wolfenstein: The New Order developer MachineGames and a PC version of Quake 64. It was great news - especially as it was released as a free patch for anyone who owned Quake on Steam.\nHowever, despite being a remaster of a 25-year-old game, the enhanced edition didn't launch without issues. Players reported numerous issues, including control problems such as with gamepads, mods not being compatible with the new version, multiplayer not working correctly, choppy performance - especially on the new expansion, Dimension of the Machine.\nRead the rest of the story...\nRELATED LINKS:\n\nWhat if: Quake gets a Doom Eternal style reboot?\n\nQuake remastered is real, out now, and brings Quake 64 to PC\n\nIt looks like a Quake announcement is coming soon"
            },
            {
                "app_id": "2310",
                "title": "Quake remaster gets big update expanding bot and mod support",
                "content": "new update for Quake's enhanced version is out, adding in significantly more bot and modding support for the remastered shooter that released in August. Improvements to user control and accessibility measures are also included...\n                Read more."
            },
            {
                "app_id": "2310",
                "title": "Quake - Update 1",
                "content": "Update 1 includes improvements to user controls, the addition of bot support to multiple Deathmatch maps, improvements to bot functionality and several notable bug fixes\n\nImprovements\n[hr][/hr]\nControls\n\n Improved analog stick input on controllers – now more responsive by default \n Added deadzone, aim acceleration, exponent and aim smoothing options to tweak gamepad input in the Input Options menu \n\nMap Improvements: Dimension of the Machine\n\n Hell or Dark Water (MGE3M2): added checkpoint spawns in co-op after traps section \n Grave Machine (MGE4M1): added checkpoint spawns in co-op and fixed pain triggers around pentagram \n A Grave Mistake (MGE4M2): added checkpoint spawns in co-op and pain triggers to prevent falling through and skipping them \n\nGeneral Improvements\n\n Save game process is faster on large levels\n Hosts are now identified by an icon instead of a color to make it easier to distinguish for color blind players\n Weapon wheel HUD element is no longer cut off on local multiplayer vertical split-screen\n\nOnline Multiplayer\n\n Removed visible game limit in match browser\n Improved Scourge of Armagon client-side prediction\n\nBots\nAdded bot support for the following levels:\n\n The Slipgate Complex (E1M1)\n Castle of the Damned (E1M2)\n The House of Chthon (E1M7)\n The Elder God Shrine (E4M3)\n Shub-Niggurath's Pit (END)\n The Edge of Oblivion (HIPDM1)\n The Pumping Station (HIP1M1)\n\n\n Improved bot melee attack, swimming and weapon selection behaviors\n Added text dialogues for when bots make kills or get killed\n Improved bot handling of elevators\n Improved bot navigation on The Abandoned Base (DM3)\n\nMisc. Improvements \n\n Added monitor select option\n\nControl Updates:\n\n Added quick save and quick load key binds\n Added default keyboard binds for the Laser Cannon, and Mjolnir in Scourge of Armagon\n\nNote: Users with existing save data may need to bind these manually from the Input Options menu\n[hr][/hr]\nBUG FIXES\n[hr][/hr]\nGameplay\n\n Fixed backward movement speed accidentally being set to walk\n Game speed now correctly resets after using the Weapon Wheel\n Resolved a bug that could result in the player getting stuck when jumping out of the water\n Turning off friendly fire no longer prevents self-damage\n\nAudio\n\n Fixed rare audio crash in Scourge of Armagon\n Resolved issue that caused excessive clipping when multiple sounds play simultaneously\n Resolved an issue in which the wrong audio track was playing during the Scourge of Armagon demo\n Fixed an issue in which Track 11 was playing instead of Track 10 on Gloom Keep (E1M5), The Wizard’s Manse (E2M5), The wind Tunnels (E3M5) and Hell’s Atrium (E4M5)\n\nMaps\n\n The Silver Key no longer shows up in Hell’s Atrium (E4M5) on Deathmatch\n Fixed an issue in which some decals were oriented incorrectly in Scourge of Armagon\n Fixed a lighting bug in The Door to Chthon (E1M6) that caused the darkened path to be lit prematurely\n Darkened lighting on the roof to restore the original visual effect on Shub-Niggurath's Pit (END)\n\nGeneral\n\n Usernames with quotation marks now appear correctly in game\n Spanish episode end slate text is no longer cut off\n Texture smoothing setting restores correctly after deactivating the Quake 64 add-on\n Fixed bug in which enhanced Ogre model would sink into ground plane after death\n\nOnline Multiplayer\n\n Resolved issue when sounds would drop and entities disappear or flicker during online play\n\nBots\n\n Resolved issue where bots would not grab needed pickups\n Bots should now see all triggers and doors as shootable\n Bots no longer linger in slime or lava for too long\n Removed Bot support on maps that lack waypoints\n Fixed issue in which bots tried to re-use single-use buttons and triggers\n\nMisc.\n\n Fixed an issue in which the Max FPS option did not correctly display custom settings in drop down menu\n Disabled GPU culling to improve performance in Dimension of the Machine\n\n[hr][/hr]\nMODDING IMPROVEMENTS\n[hr][/hr]\nThe following changes apply to users who may be developing add-ons that work on the PC version of Quake\n\n Added the pr_checkextension cvar and checkextension (\"QUAKE_EX\") function in QuakeC to detect if the mod is running under the updated Quake client\n Added the cl_nocsqc cvar (it is permanently set to 1 to indicate to modders that CSQC is not supported)\n Removed the -heapsize command line parameter. It is no longer used in favor of a dynamically sized heap\n Added FL_NO_BOTS edict flag (Instructs bots to ignore specified object(s) in QuakeC)\n Added a QuakeC built-in for playing a sound on a client: void localsound( entity client, string sample ) = #80;\n\nAdded the following QuakeC built-in functions for drawing debug shapes on clients (these are intended to help mod authors visually debug logic in 3D space):\n\n void draw_point( vector point, float colormap, float lifetime, float depthtest ) = #81;\n void draw_line( vector start, vector end, float colormap, float lifetime, float depthtest ) = #82;\n void draw_arrow( vector start, vector end, float colormap, float size, float lifetime, float depthtest ) = #83;\n void draw_ray( vector start, vector direction, float length, float colormap, float size, float lifetime, float depthtest ) = #84;\n void draw_circle( vector origin, float radius, float colormap, float lifetime, float depthtest ) = #85;\n void draw_bounds( vector min, vector max, float colormap, float lifetime, float depthtest ) = #86;\n void draw_worldtext( string s, vector origin, float size, float lifetime, float depthtest ) = #87;\n void draw_sphere( vector origin, float radius, float colormap, float lifetime, float depthtest ) = #88;\n void draw_cylinder( vector origin, float halfHeight, float radius, float colormap, float lifetime, float depthtest ) = #89;\n\n\n Added logic that resets AI state to neutral when activating the bot navigation editor\n Added bot nav editor fullbright toggle key bind to F2\n Added \"CheckForFloor\" flag to nav nodes (this can be used for drawbridges, floor traps, etc.)\n Added \"CheckForSolid\" flag to nav nodes (this can be used for crushers, traps, movable walls, etc.)\n Added ability to place nav nodes in shallow lava\n\nAdded the following cvars to change nav editor window positions:\n\n nav_properties_xpos\n nav_properties_ypos\n nav_legend_xpos\n nav_legend_ypos\n\nAdded navEdit_defaultNodeRadius to set preferred default nav node radius\nAdded ability to lock node height in place when moving nodes around\nAdded navEdit_defaultNodeRadius to set preferred default nav node radius\nAdded navEdit_waterLookPointDist to control how far away nodes will be placed in front of player when in water\n[hr][/hr]\nMODDING FIXES\n[hr][/hr]\n\n Fixed an issue in which the save command was appending an \"s\" to the beginning of filenames, resolving auto-save in mods like “Copper”\n Fixed Alpha not being applied to brush models\n Restored original behavior of centerprint, sprint, and bprint built-ins to fix issues with mods expecting arguments to concatenate instead of a string format"
            },
            {
                "app_id": "2310",
                "title": "Quake | Minor Update Release Notes | September 2",
                "content": "Multiplayer Update for All Platforms\n\n This minor update fixes an issue that caused multiplayer lobby instability for some users"
            }
        ]
    },
    {
        "cluster_id": "C005",
        "name": "Store & Product",
        "description": "Patch notes or announcements related to changes in how games are listed, bundled, or managed on digital storefronts (e.g., Steam), including title consolidations, package updates, and delisted items.",
        "single_notes": [
            {
                "app_id": "2280",
                "title": "We’re simplifying the id Software Steam Store Listings",
                "content": "Spanning across multiple decades, id Software’s library of work is as vast as it is full of amazing games.\n\nHowever, this means a number of the id’s offerings have been released or reiterated in ways that can make our digital storefronts a touch…confusing. Rather than write out the differences between Final DOOM, Ultimate DOOM and just DOOM, we’re consolidating our Steam library of titles! For those id Software experts that do know all the variations of our games released on Steam, bear with us as we simplify how our games appear so that newcomers have an easier time.\n\nHERE’S THE PLAN:\nStarting August 10, we will begin rolling out changes to our Steam Store listings for select id Software games. In short, we are consolidating each game under one major title and/or changing the title for a simpler shopping experience.\n\nBelow will detail our current plans for Steam consolidation and how it affects your current Steam library if you’ve purchased these games already. And don’t worry, even if we are delisting a title you currently own, you’ll still have the game in your library to download and play like always.\n\nWithout further ado, the lowdown:\n\nDOOM (1993)\nWe will be changing the name of Ultimate DOOM in the Steam Store to DOOM (1993). No other major changes are being made at this time.\n\nDOOM II\nDOOM II will include Final DOOM and Master Levels as one install package. Each can be launched separately as follows:\n\n DOOM II\n DOOM II (Enhanced)\n Master Levels for DOOM II\n Final DOOM\n\nDOOM 3\nDOOM 3 will be merged into a package containing the original DOOM 3 plus the Resurrection of Evil expansion and DOOM 3: BFG Edition. The package allows each version to be installed separately as follows:\n\n DOOM 3\n DOOM 3: Resurrection of Evil (Requires DOOM 3 to be installed)\n DOOM 3: BFG Edition\n\nQuake II\nQuake II and its mission packs, The Reckoning and Ground Zero, will be merged into one install package with multiple launch options:\n\n Quake II\n The Reckoning\n Ground Zero\n\nQuake III Arena\nQuake III Arena and Quake III Team Arena will be merged into one package with separate installs:\n\n Quake III Arena\n Quake III Team Arena\n\nSTEAM BUNDLES\nIn addition to updating our id Software titles on Steam, we’re also revamping our bundles (as well as introducing some new ones!) Note that if you already own certain titles listed in each bundle, you can complete it to get the remaining games added to your library at a discounted price. See below for details:\n\nDOOM Classic Bundle\nReplaces the DOOM Classic Complete Bundle on Steam, with this bundle now including DOOM 3 and DOOM 64.\n\n Includes DOOM (1993), DOOM II, DOOM 3 and DOOM 64\n\nDOOM Franchise Bundle\nExplore more DOOM with this bundle, including both the classic DOOM games as well as DOOM (2016) and DOOM Eternal.\n\n Includes DOOM Eternal Deluxe Edition, DOOM (2016), DOOM (1993), DOOM II, DOOM 3 and DOOM 64\n\nQuake Collection Bundle\nDive into Quake, all in one convenient bundle!\n\n Package will include Quake, Quake II, Quake III Arena, Quake Live, Quake 4\n\nDELISTED TITLES\nThe following will no longer appear in Steam Store searches, but will remain in your installed library listings:\n\n Quake II Demo\n Quake III Arena Demo\n Quake III Team Arena Demo\n Quake III Team Arena (This will be included with Quake III Arena)\n Final DOOM (This will install with DOOM II)\n Master Levels for DOOM II (This will install with DOOM II)\n Quake II Mission Pack: The Reckoning (This will be added to the Quake II launcher.)\n Quake II Mission Pack: Ground Zero (This will be added to the Quake II launcher.)\n DOOM 3: Resurrection of Evil (This will install with DOOM 3.)\n DOOM 3: BFG Edition (This will install with DOOM 3. Players that own DOOM 3: BFG will be upgraded to DOOM 3.)\n DOOM Classic Complete Bundle (This is being replaced by the DOOM Classic Bundle.)\n\n\nStill have some questions? Head over to our help portal here."
            },
            {
                "app_id": "2500",
                "title": "Frozenbyte 15th Anniversary and Update to Shadwen!",
                "content": "http://i.imgur.com/PmJO07R.jpg\r\n\r\nTo celebrate our 15th anniversary we are having our games on sale and added an update to Shadwen! \r\n\r\nThe update, called Escape from the Castle, adds 14 re-worked levels to Shadwen for free to all platforms: Windows, Linux and Mac. You can read more from our blog or go to Shadwen's Steam page from here.\r\n\r\nDon't forget to take advance of the bundle prices for example with Frozenbyte Collection. Its price adjusts if you already own some of the games!\r\n\r\nWe also made a video to show our progress from our first game, Shadowgrounds to Shadwen. You can find it below.\r\n\r\nhttps://www.youtube.com/watch?v=KmZ9OTmBLjQ\r\n\r\nThank you all for supporting us for so long! :)\r\n\r\nhttp://i.imgur.com/vNEibtO.jpg"
            },
            {
                "app_id": "2500",
                "title": "Frozenbyte 15th Anniversary and Update to Shadwen!",
                "content": "http://i.imgur.com/PmJO07R.jpg\r\n\r\nTo celebrate our 15th anniversary we are having our games on sale and added an update to Shadwen! \r\n\r\nThe update, called Escape from the Castle, adds 14 re-worked levels to Shadwen for free to all platforms: Windows, Linux and Mac. You can read more from our blog or go to Shadwen's Steam page from here.\r\n\r\nDon't forget to take advance of the bundle prices for example with Frozenbyte Collection. Its price adjusts if you already own some of the games!\r\n\r\nWe also made a video to show our progress from our first game, Shadowgrounds to Shadwen. You can find it below.\r\n\r\nhttps://www.youtube.com/watch?v=KmZ9OTmBLjQ\r\n\r\nThank you all for supporting us for so long! :)\r\n\r\nhttp://i.imgur.com/vNEibtO.jpg"
            }
        ]
    },
    {
        "cluster_id": "C006",
        "name": "Mod Changelog",
        "description": "Patch notes or announcements detailing specific features, fixes, or updates to an individual game mod, rather than the base game's modding support.",
        "single_notes": [
            {
                "app_id": "2280",
                "title": "Brutal Doom update v20 to add ragdoll physics, more brutality",
                "content": "I didn   t think it was possible for Doom to get any better, but mods make everything better. The absurdly violent Brutal Doom mod is doing a great job of keeping Doom just as shocking and visceral of an experience as it was when it first came out 20 years ago, and the newest version will add ragdoll physics   because when I shotgun an Imp, I wanna see it tumble.\n\nThe Brutal Doom mod, which you may have seen us squee about before, adds new effects, animations, way too much blood, and other things that heighten the experience. v20, as you can see in the video above, makes each shotgun blast even more satisfying by knocking the enemy back an unreasonable distance. To me it looks like the right amount of ridiculous, but creator Sergeant_Mark_IV said he   s going to tone it down a notch.\n\n   I have been playing a lot of Killing Floor lately and noticed how small zeds are sent rolling on the floor when killed by shotguns at close range, I love this effect, then I thought about making something similar on Brutal Doom,    he said.    Of course it will not send almost every enemy flying away like in the video. I will reduce the minimum range from 300 to 200 units. I mean, the shotgun will only send flying enemies that are VERY close to the player, and shooting on the legs or heads still causes amputations.   \n\nWhen it comes out, v20 should also make the mod run smoother, make blood splatters and ejected magazine last longer, and other nifty things. It seems like Facebook is the best place to keep up with it, and you can download it for free from Moddb."
            },
            {
                "app_id": "2280",
                "title": "Brutal Doom mod update coming next month, new trailer made of 90% gibs",
                "content": "Doom's just not metal enough; thank goodness for\\xa0Brutal Doom. Released in March last year, the beloved mod sought to make the classic even more hardcore and\\xa0real—it introduced new death animations, gave objects shadows, and made headshots a thing. Now Brutal Doom's announced its 19th update, and after watching this trailer, I can say that I am very ready for this. (Though my ears, maybe less so.)\n\n\n\n\n\n\n\nBrutal Doom's ModDB page reveals that the update releases August 9, with various unspecified new features, fixes, and \"polishments\" to be added. Developer Sgt Mark IV says that this will \"probably\" be the final version of Brutal Doom. The next game he's keen to focus on uber-gorifying with the Brutal treatment? Hexen. For now, we just wait till August for this. Someone pass me the super-chunky salsa—I want to bite down hard on that tasty, tasty desensitization."
            },
            {
                "app_id": "2280",
                "title": "Brutal Doom mod update adds custom fatality animations",
                "content": "In the word of Dethklok frontman Nathan Explosion: \"Brutal.\" Originally released in March, the Brutal Doom mod furnishes Doom's buckets of blood, steaming guts, and ultra-violence with a critically missing element: more buckets of blood, steaming guts, and ultra-violence. We're talking extreme Chunky Salsa Rule here. A freshly spawned Halloween update provides custom fatality animations as you RIP AND TEAR into Hell's minions. \n\n\n\nHelmed by the one-man efforts of Sergeant Mark IV, Brutal Doom doesn't just coat everything in strawberry juice. The mod also augments weapon and projectile behavior to react slightly more realistically—slightly; you're still fighting demonic hellspawn in a box in space—such as inflicting harmful splash damage to yourself if you're too close to a wall. Stealth kills and movable barrels are also possible. Headshots count. Limbs sever. \n\n\n\n\"Everything in Brutal Doom is extremely intense,\" the good Sergeant writes. \"Everything sounds louder, looks bigger, moves faster, and hits harder. The camera shakes every time something explodes near you. Enemies are harder and smarter, and weapons and explosions are loud as fuck.\n\n\n\n\"Some enemies will scream in anguish and try to crawl away when near death, and they can be used as human shields. Blood will drip through your visor every time you shoot enemies too close.\"\n\n\n\nBrutal."
            }
        ]
    },
    {
        "cluster_id": "C007",
        "name": "Accessibility & UI",
        "description": "Patch notes focusing on improving accessibility features for players, user interface enhancements, and user experience adjustments.",
        "single_notes": [
            {
                "app_id": "2310",
                "title": "Quake - Update 4.1",
                "content": "Update 4.1 for Quake includes an improved initial Accessibility options setup and a few other minor changes. Thanks to your feedback from the menu flow of Accessibility options we introduced in Update 4, we've improved the initial flow. On first startup, you will be presented with the following screen and have to choose one of the two options:\nhttps://images.ctfassets.net/rporu91m20dc/1cjUc2OaBRvb221wV3s7NU/5ed3b2a439c30a99e7f71e254f29ffa7/Quake_Update4.1_Initial_Accessibility_Screen_960x540.png\nChoosing Disable all settings will disable all Accessibility options and return you to the main menu. Choosing Customize accessibility settings… will bring you into the Accessibility Menu to so you can access the full list of settings.\nWe hope this helps players who were confused in Update 4 by the high-contrast and alternate typeface options being enabled, but weren’t sure how to disable them, while allowing players looking to dive into our Accessibility options quicker access.\n[hr][/hr]\nOTHER MINOR UPDATES\nLevel Select Menu\n\n Restored missing level MGEND: Chthon's Vengeance to the Level Select menu\n\nAdd-ons Menu\n\n Add-ons menu selection images are now 16:9 aspect ratio\n\nThreewave CTF\n\n Restored Threewave CTF spawns to original intended system: players will spawn for the first time in their own base, but afterwards will spawn randomly at deathmatch spawn points. This will prevent players from spawncamping a team inside their base\n\n[hr][/hr]\nICYMI - Read the full release notes from our last major release: Update 4 here."
            },
            {
                "app_id": "2310",
                "title": "Quake update adds new accessibility options after 26 years",
                "content": "A new update for the venerable FPS game Quake has added some welcome new accessibility features to the user interface, 26 years after the original version launched for MS-DOS. When you fire up the Steam version of Quake after applying today's patch, you'll notice that the main menu is displayed in a bright white, sans serif font - and there are other new options available as well.\nThe latest Quake patch adds additional accessibility options to Quake's main menu. When you first run the game after applying the patch, that will be the first screen that pops up, giving you the chance to select which of the new features you want enabled. You'll find new options for high contrast menus, the alternate menu typeface, and text-to-speech and speech-to-text options for chat.\nFor players with auditory or visual processing difficulties, these options could make playing the granddaddy of deathmatch significantly easier. In-game messages can be prominently displayed in crisp white lettering over black background blocks, making it much easier to see text like \"you got 5 shells\" or \"you found a secret area.\"\nRead the rest of the story...\nRELATED LINKS:\n\nQuake just got a new horde mode, made by the Wolfenstein devs\n\nQuake 1 gets a \"major update\" that takes aim at mod problems\n\nWhat if: Quake gets a Doom Eternal style reboot?"
            }
        ]
    },
    {
        "cluster_id": "C008",
        "name": "Promotional Content",
        "description": "Patch notes or announcements related to cross-game rewards, promotional items, special offers, contests, or other marketing-related content.",
        "single_notes": [
            {
                "app_id": "2500",
                "title": "Frozenbyte Christmas Calendar 2015!",
                "content": "Chance to win free Frozenbyte games each day!\r\n\r\nhttp://i.imgur.com/NfzZNiA.jpg\r\n\r\nTo celebrate the upcoming holidays, we wanted to do a Christmas Calendar for you this year.\r\n\r\nWe'll post pics and give away game codes for our games each day until 24th December for some lucky winners - so if you don't have all our games yet or you have friends you think might enjoy them, check our blog for more info!\r\n\r\nHOW TO PARTICIPATE:\r\n\r\nYou can participate on any of our social media channels (links below) - detailed rules always on our blog (first link). If you participate on all of them, your chances to win are higher. :)\r\n\r\n\r\nFrozenbyte Blog (Christmas Calendar)\r\n@Frozenbyte on Twitter\r\n@ShadwenGame on Twitter\r\nFrozenbyte Games on Facebook\r\nShadwen on Facebook\r\n@FrozenbyteGames on Instagram\r\nfrozenbytegames on Snapchat\r\n\r\n\r\nHappy upcoming holidays! :)"
            },
            {
                "app_id": "2500",
                "title": "Frozenbyte Christmas Calendar 2015!",
                "content": "Chance to win free Frozenbyte games each day!\r\n\r\nhttp://i.imgur.com/NfzZNiA.jpg\r\n\r\nTo celebrate the upcoming holidays, we wanted to do a Christmas Calendar for you this year.\r\n\r\nWe'll post pics and give away game codes for our games each day until 24th December for some lucky winners - so if you don't have all our games yet or you have friends you think might enjoy them, check our blog for more info!\r\n\r\nHOW TO PARTICIPATE:\r\n\r\nYou can participate on any of our social media channels (links below) - detailed rules always on our blog (first link). If you participate on all of them, your chances to win are higher. :)\r\n\r\n\r\nFrozenbyte Blog (Christmas Calendar)\r\n@Frozenbyte on Twitter\r\n@ShadwenGame on Twitter\r\nFrozenbyte Games on Facebook\r\nShadwen on Facebook\r\n@FrozenbyteGames on Instagram\r\nfrozenbytegames on Snapchat\r\n\r\n\r\nHappy upcoming holidays! :)"
            }
        ]
    },
    {
        "cluster_id": "C009",
        "name": "New Game Announcement",
        "description": "Announcements regarding the release, upcoming launch, or beta phases of entirely new game titles, including descriptions of gameplay and features.",
        "single_notes": [
            {
                "app_id": "2500",
                "title": "Boreal Blade Announced!",
                "content": "https://steamcdn-a.akamaihd.net/steamcommunity/public/images/clans/32975759/0ba0ddfc9b18acac16961e611ee300118f064555.jpg\r\n\r\nYou probably are unaware of it, but there has been a small team of Frozenbyteans making a game about sword fighting in all secrecy. We’ve been developing, testing, designing and perfecting this game for quite some time now. So let us introduce you to Boreal Blade, a team-based melee fighting game with a focus on PvP combat that combines reactionary and tactical gameplay, and allows you to alternate attacks and to develop a unique fighting style.\r\n\r\nhttps://youtu.be/5SmZqbvZlb0\r\nSteam Beta\r\nBoreal Blade will be making its way to PC during 2019, but all interested players are welcome to join the Steam beta which is available now! Just head to the official Boreal Blade Discord to request a key. On Discord you can also give feedback to the devs, discuss about the game and look for fellow warriors to battle with. And remember that you can also wishlish the game on Steam while waiting for the release. \r\n\r\nhttps://steamcdn-a.akamaihd.net/steamcommunity/public/images/clans/32975759/e4bb8cd55f814a131ad7deb2c9d835b605ad150d.png\r\n\r\nAbout Boreal Blade\r\n\r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/extras/600px.gif?t=1566826417\r\n\r\nThey have a saying in Norvalg: Fight for a cause worth dying for.\r\n\r\nA noble sentiment, but what happens when almost every cause is good enough to die for? Whenever a decision needs to be made – whether it is about heading to war or determining where the cheese should go in a sandwich – fierce Norvalgian warriors gather in their famous debating arenas, pray for strength from their gods and fight until the truth is uncovered. Are you ready to join the battle?\r\n \r\nBoreal Blade is a team-based melee fighting game with a focus on player vs player combat and gameplay consisting of both reactive and proactive elements. The game features various weapon types and three distinctive fighting styles, allowing players to choose between two-handed weapons, a shield and a weapon combo, or long thrusting weapons like spears and pikes. Three armour classes with their strengths and weaknesses are also included to guarantee a varied, everchanging fighting experience.\r\n \r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/ss_7125a860b535127a60753b55abd691ea1fa9a0bf.1920x1080.jpg?t=1566826417\r\n\r\nBoreal Blade strikes an excellent balance between realism and gameplay. The game turns away from the rock-paper-scissors approach where weapons and shields matter only when the player presses the corresponding button to use them for attacking or blocking. Actually, there is no block button at all, but the passive blocking featured in the game allows players to block attacks by simply positioning themselves wisely and timing their attacks with care. Pre-determined attack key combinations and complex counter moves have been abandoned in favour of the beautiful simplicity of only a single attack button - and hundreds of ways to variate every attack. Players can move their weapon and character around freely, turning an attack into a block - and back to another attack just in a blink of an eye. Strikes and blocks meld into a seamless continuity. Weapon movement feels very natural, allowing players to create and modify their signature moves and distinctive fighting styles. More seasoned warriors can spice up their game with dodges, sprints, blocks, powered attacks, feint attacks and weapon throws to confuse opponents and make the battle more unpredictable and exciting.\r\n \r\nBoreal Blade gives competitive players the chance to hone their prediction of attacks, counter-attacks, timing and the use of different stances to defeat their enemies on the battlefield and to hack them into pieces!\r\n\r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/ss_b5d655557688dde67c8a6d51e2a2d91b740e0786.1920x1080.jpg?t=1566826417\r\n\r\nKey Features\r\n\r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/extras/bb_steam_title_gameplay.png?t=1566826417\r\nReactionary and tactical gameplay\r\n\r\nComplete freedom of attack and block direction performed with simple controls, allowing players to concentrate on their battle tactics and series of manoeuvres and to control the flow of the battle.\r\nThere are hundreds of ways to variate attacks and players have complete freedom to move the weapon and character around, encouraging them to experiment and find the fighting style that suits them best.\r\n\r\nhttps://steamcdn-a.akamaihd.net/steam/apps/598780/extras/bb_steam_title_game_modes.png?t=1566994382\r\nFour multiplayer game modes\r\n\r\nPlayers can charge into combat together with their clan mate warriors in Team Deathmatch and Boreal Battle modes where two teams go up against each other.\r\nBoreal Claim mode consists of two teams who take turns attacking or defending a banner against the other team.\r\nIn Deathmatch it is everyone for themselves – the first warrior to get 20 kills wins the match!\r\n\r\nhttps://steamcdn-a.akamaihd.net/steam/apps/598780/extras/bb_steam_title_fighting_styles.png?t=1566994382\r\nFour different fighting styles\r\n\r\nHundreds of weapons, shields, pieces of armour and battle items for developing customized fighting styles and battle tactics.\r\n\r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/extras/bb_steam_title_character_creation.png?t=1566826417\r\nDetailed character creation and game world\r\n\r\nCreate your warrior and choose their equipment, accessories and weapons and customize their appearance with jewellery, facial hair and armour dyes.\r\nExplore the different fighting arenas across the Nordic mythology inspired, paintinglike Norvalg.\r\n\r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/ss_68c7525241fa580914dca5cf8cf26146793eba3e.1920x1080.jpg?t=1566826417\r\n\r\nThe game was also released today on Nintendo eShop for Nintendo Switch. There is a free demo version and full game available for all aspiring warriors.\r\n\r\nBoth the demo and the full game are compatible, allowing players of both versions play together!\r\n\r\nhttps://store.steampowered.com/app/598780/Boreal_Blade/\r\nJoin the mailing list at https://www.borealblade.com to make sure you never miss an update! And remember that you can join the Steam Beta and discussion at Discord.\r\n\r\nhttps://store.steampowered.com/gfxproxy/betagfx/apps/598780/ss_e08bdb10fe49e786c1ed13d1ba9d5a176c326f5a.1920x1080.jpg?t=1566826417"
            }
        ]
    }
]